[
  {
    "chunk_id": "2020_philadelphia_eagles_season_001",
    "doc_title": "2020_philadelphia_eagles_season",
    "text": "The 2020 season was the Philadelphia Eagles' 88th in the National Football League (NFL) and their fifth and final under head coach Doug Pederson. They failed to improve on their 9–7 record from the previous season following a 23–17 loss to the Seattle Seahawks in Week 12. They were eliminated from playoff contention for the first time since 2016 following a Week 16 loss to the Dallas Cowboys and finished with a dismal 4–11–1 record, the second-worst in the National Football Conference (NFC), and their worst since 2012. After starting 3–4–1 heading into their bye week and leading the NFC East, the Eagles would lose 7 of their last 8 games. Injuries and poor quarterback play were factors in their struggles in the season. On January 11, 2021, the Eagles announced head coach Doug Pederson would not return after the season, as he was dismissed the same day. For the first time since 1998, the Eagles failed to score 30 or more points in a single game the entire season. Their .281 winning percentage was their worst since 2012. Overall, Carson Wentz, statistically, had one of the poorest seasons by a quarterback in franchise history, throwing for 2,620 yards, 16 touchdowns, 15 interceptions, and completed just 57.4% of his passes (251 for 437) to go with his 72.8 passer rating. He also got sacked 50 times for 326 yards. On July 14, 2020, the city of Philadelphia placed a ban on large events for six months, meaning that the Eagles' home games would have no fans in attendance. However, starting in week 6, Philadelphia Mayor Jim Kenney announced that the city would allow 7,500 fans to attend Eagles home games. This was reversed on November 16, 2020, as the city of Philadelphia implemented outdoor restrictions. The season also marked the"
  },
  {
    "chunk_id": "2020_philadelphia_eagles_season_002",
    "doc_title": "2020_philadelphia_eagles_season",
    "text": "home games would have no fans in attendance. However, starting in week 6, Philadelphia Mayor Jim Kenney announced that the city would allow 7,500 fans to attend Eagles home games. This was reversed on November 16, 2020, as the city of Philadelphia implemented outdoor restrictions. The season also marked the end of the Carson Wentz era in Philadelphia as he was traded to the Indianapolis Colts in the 2021 off-season. As of the 2024 season, this is the most recent season the Eagles missed the playoffs, finished with a losing record, and finished in last place in the NFC East. Roster changes Free agents Signings Departures Trades March 19: The Eagles traded a third-round pick in the 2020 NFL draft and a fifth-round pick in the 2020 NFL draft to the Detroit Lions for CB Darius Slay. April 25: The Eagles traded their sixth-round pick in the 2020 NFL draft, 190th overall, to the San Francisco 49ers for their sixth-round pick, 210th overall, and Marquise Goodwin Draft Notes The Eagles acquired one additional seventh-round selection, along with wide receiver DeSean Jackson, in a trade that sent their 2019 sixth-round selection to the Tampa Bay Buccaneers. However, the Eagles made trades with the Atlanta Falcons and the New England Patriots involving both their own seventh-round selection and the one acquired from the Buccaneers. The Eagles acquired an additional fifth-round selection in a trade that sent one of their seventh-round selections and defensive end Michael Bennett to the Patriots. The Eagles acquired an additional sixth-round selection, along with linebacker Duke Riley, in a trade that sent one of their seventh-round selections and safety Johnathan Cyprien to the Falcons. The Eagles traded a sixth-round selection to the Chicago Bears in exchange for running back Jordan Howard. As the result of the negative differential"
  },
  {
    "chunk_id": "2020_philadelphia_eagles_season_003",
    "doc_title": "2020_philadelphia_eagles_season",
    "text": "an additional sixth-round selection, along with linebacker Duke Riley, in a trade that sent one of their seventh-round selections and safety Johnathan Cyprien to the Falcons. The Eagles traded a sixth-round selection to the Chicago Bears in exchange for running back Jordan Howard. As the result of the negative differential of free agent signings and departures that the Eagles experienced during the first wave of the 2019 free agency period, the team is projected to receive two compensatory selections for the 2020 draft. Free agent transactions that occurred after May 7, 2019, did not factor into the team's formula for determining compensatory selections. The Eagles traded a third-round and fifth-round selection in the 2020 NFL draft to the Detroit Lions for cornerback Darius Slay. Staff Final roster Preseason The Eagles' preseason schedule was announced on May 7, but was later cancelled due to the COVID-19 pandemic. Regular season Schedule The Eagles' 2020 schedule was announced on May 7. Note: Intra-division opponents are in bold text. Game summaries Week 1: at Washington Football Team In a near-reversal of the previous season's opener, the Eagles scored the first 17 points, only for the Washington Football Team to then shut their offense out for the remainder of the afternoon. Meanwhile, Washington's offense scored 27 unanswered points, and the defense sacked Carson Wentz eight times, recorded two interceptions, and forced three fumbles. With the loss, Philadelphia's six-game winning streak against Washington dating back to 2016 came to an end, and the Eagles lost the first game of the season for the first time since 2015. Week 2: vs. Los Angeles Rams The Eagles' struggles continued in their home opener against the Los Angeles Rams. An early fumble by Miles Sanders led to a Rams touchdown by Tyler Higbee. After the Eagles cut their deficit"
  },
  {
    "chunk_id": "2020_philadelphia_eagles_season_004",
    "doc_title": "2020_philadelphia_eagles_season",
    "text": "first game of the season for the first time since 2015. Week 2: vs. Los Angeles Rams The Eagles' struggles continued in their home opener against the Los Angeles Rams. An early fumble by Miles Sanders led to a Rams touchdown by Tyler Higbee. After the Eagles cut their deficit to four with a Jake Elliott field goal, Los Angeles responded with a Robert Woods touchdown run followed by a second Higbee touchdown catch. Trailing 21–3, the Eagles closed the deficit to five points by halftime with touchdown runs by Wentz and Sanders. After forcing a three-and-out on the Rams' first possession of the second half, the Eagles would drive to the Los Angeles 21, only for Wentz's first down pass to be picked off by Darious Williams, turning the momentum back in the Rams' favor as they would outscore the Eagles 16–3 the rest of the way. Despite not being sacked once during the game, Wentz finished the day with a 56.5 passer rating, completing 26 of 43 passes for 242 yards and two interceptions. The 37–19 blowout loss dropped Philadelphia to 0–2 for the first time since 2015, and marked the Eagles' first home opener loss since that same season. It was also the first home loss to the Rams franchise since 2001. Week 3: vs. Cincinnati Bengals The Eagles welcomed the Cincinnati Bengals to Lincoln Financial Field seeking their first win over Cincinnati since 2000. After a scoreless first quarter, the two teams traded field goals in the second, before the Bengals took a 10–6 lead on a touchdown reception by Tee Higgins. Wentz responded on the ensuing drive, as he threw his 100th career touchdown pass to Greg Ward to put the Eagles in front 13–10 at halftime. After the Eagles added another Jake Elliott field"
  },
  {
    "chunk_id": "2020_philadelphia_eagles_season_005",
    "doc_title": "2020_philadelphia_eagles_season",
    "text": "the second, before the Bengals took a 10–6 lead on a touchdown reception by Tee Higgins. Wentz responded on the ensuing drive, as he threw his 100th career touchdown pass to Greg Ward to put the Eagles in front 13–10 at halftime. After the Eagles added another Jake Elliott field goal, the Bengals reclaimed a one-point lead with Higgins' second touchdown of the afternoon. Cincinnati would pad its lead to seven points with two fourth-quarter field goals. Trailing 23–16 with just over 3 minutes left in regulation, Philadelphia drove down the field to score the game-tying touchdown on a 7-yard run for Wentz. In overtime, both defenses held strong, with neither team being able to get into field goal range until the final drive, when the Eagles got to the Bengals' 41. However, a costly false start on Matt Pryor brought Philadelphia out of field goal range. The Eagles punted the ball, and the game ended on the following play with the Bengals at their own 20. Despite his milestone, Wentz's struggles continued as he also threw two interceptions for the third straight game and finished the game with a 62.8 passer rating. Philadelphia improved to 0–2–1 with the tie, but failed to snap their winless streak against Cincinnati and fell to 0–3–2 in their last five against the Bengals, including an 0–2–1 mark at Lincoln Financial Field. This marked the Eagles' first tie since 2008, which was also against the Bengals. Week 4: at San Francisco 49ers A depleted Eagles team stunned the 49ers on Sunday Night Football to win their first game of the season. Unknown wide receiver Travis Fulgham signed a 1-year contract before the game and caught a key go-ahead score in the 3rd quarter. Linebacker Alex Singleton also scored a touchdown on an interception which"
  },
  {
    "chunk_id": "2020_philadelphia_eagles_season_006",
    "doc_title": "2020_philadelphia_eagles_season",
    "text": "Eagles team stunned the 49ers on Sunday Night Football to win their first game of the season. Unknown wide receiver Travis Fulgham signed a 1-year contract before the game and caught a key go-ahead score in the 3rd quarter. Linebacker Alex Singleton also scored a touchdown on an interception which proved to be the decider. Week 5: at Pittsburgh Steelers After being the hero the previous week, Travis Fulgham had a breakout game with 10 receptions for 152 yards and a touchdown, but was outperformed by Steelers rookie wide receiver Chase Claypool, who scored 4 total touchdowns, 3 receiving, from 7 catches and 110 yards. The loss dropped the Eagles to 1–3–1. Week 6: vs. Baltimore Ravens After falling behind 17–0 in the first half, the Eagles surged back with a dominant second half to pull within two points of the Ravens in the fourth quarter. However, the furious rally came up short as Carson Wentz was stopped on a would-be game-tying two-point conversion in the final two minutes. Baltimore recovered the ensuing onside kick and ran out the clock to seal the narrow 30–28 loss. With their second straight defeat, Philadelphia dropped to 1–4–1 on the season. This was the first game in the 2020 season where Carson Wentz did not throw an interception and he was praised with the near 4th quarter comeback. Week 7: vs. New York Giants The Eagles recovered from a 21–10 hole. They scored 12 unanswered points and reclaimed first place in the NFC East when Boston Scott caught a game-winning touchdown pass and linebacker Brandon Graham forced a fumble on Giants quarterback Daniel Jones. This win improved the Eagles to 2–4–1. They extended their all-time series lead to 89–86–2. Week 8: vs. Dallas Cowboys Despite committing four turnovers and being held to a"
  },
  {
    "chunk_id": "2020_philadelphia_eagles_season_007",
    "doc_title": "2020_philadelphia_eagles_season",
    "text": "East when Boston Scott caught a game-winning touchdown pass and linebacker Brandon Graham forced a fumble on Giants quarterback Daniel Jones. This win improved the Eagles to 2–4–1. They extended their all-time series lead to 89–86–2. Week 8: vs. Dallas Cowboys Despite committing four turnovers and being held to a season-low seven first half points, Wentz and the Eagles bumbled their way to a crucial division win over an injury-ravaged Dallas Cowboys team led by rookie quarterback Ben DiNucci. The Cowboys opened the scoring on the game's opening drive with a 49-yard field goal by Greg Zuerlein. After a fumble by Wentz gave the Cowboys the ball back, the Eagles regained possession on a DiNucci fumble and took a 7–3 lead on Jalen Reagor's first career touchdown reception. The Cowboys responded with another Zuerlein field goal following Wentz's second fumble, and took a 9–7 halftime lead on a 59-yard field goal (mirroring the halftime score in Dallas in 2017, also played on Sunday Night Football). On the Eagles' second-half opening drive, Wentz would be picked off by Cowboys rookie cornerback Trevon Diggs, who returned the ball to the Dallas 31, but the Cowboys failed to capitalize when Zuerlein's ensuing 52-yard field goal attempt sailed wide right. The Eagles used the momentum swing to regain the lead 15–9 on a 9-yard Travis Fulgham touchdown reception. In the fourth quarter, T. J. Edwards strip-sacked DiNucci, and the ensuing fumble was recovered and returned 53 yards for a touchdown by Rodney McLeod. With the 23–9 win, Philadelphia improved to 3–4–1 on the season heading into their Week 9 bye. Week 10: at New York Giants The Eagles came stumbling out of the bye week and suffered their first loss to the Giants since Week 9 of the 2016 season, ending an eight-game winning"
  },
  {
    "chunk_id": "2020_philadelphia_eagles_season_008",
    "doc_title": "2020_philadelphia_eagles_season",
    "text": "the 23–9 win, Philadelphia improved to 3–4–1 on the season heading into their Week 9 bye. Week 10: at New York Giants The Eagles came stumbling out of the bye week and suffered their first loss to the Giants since Week 9 of the 2016 season, ending an eight-game winning streak against New York. The Eagles also fell to 1–4 after the bye in the Doug Pederson era. This left many fans and media questioning Pederson's play calling creativity. Despite a subpar performance from Wentz, he played his first turnover free game of 2020. The Eagles fell to 3–5–1, but nonetheless remained in first place in a lowly NFC East. The all-time series fell to 89–87–2. Week 11: at Cleveland Browns In heavy rain and wind, the Eagles would lose a defensive game. Wentz struggled again, throwing 2 interceptions and absorbing 5 sacks, and Sanders lost a fumble, wasting a good effort by the defense against a high-powered Browns offense. This loss dropped the Eagles to 3–6–1. Week 12: vs. Seattle Seahawks The Eagles returned home to face the Seattle Seahawks behind closed doors. Philadelphia entered the game winless against Seattle in the Russell Wilson era with an 0–5 record. After a scoreless first quarter, the Seahawks would jump to a 14-point lead on touchdowns by David Moore and Chris Carson. A drive led by Carson Wentz at the end of the first half would put the Eagles on the board, but the Seahawks would not relinquish their lead for the remainder of the game. A garbage time Hail Mary from Wentz to Richard Rodgers pulled the Eagles within 6 points, but the Seahawks recovered the ensuing onside kick to seal Philadelphia's third straight loss. This touchdown would be Wentz's last in an Eagles uniform. The Eagles fell to 3–7–1"
  },
  {
    "chunk_id": "2020_philadelphia_eagles_season_009",
    "doc_title": "2020_philadelphia_eagles_season",
    "text": "the remainder of the game. A garbage time Hail Mary from Wentz to Richard Rodgers pulled the Eagles within 6 points, but the Seahawks recovered the ensuing onside kick to seal Philadelphia's third straight loss. This touchdown would be Wentz's last in an Eagles uniform. The Eagles fell to 3–7–1 on the season, 0–6 against Russell Wilson, 0–7 against Pete Carroll, and 0–6 at Lincoln Financial Field against the Seahawks with the 23–17 loss. Week 13: at Green Bay Packers This game is noted to be the final start for the 2016 number 2 overall pick QB Carson Wentz with the Philadelphia Eagles. With the loss, the Eagles fall to 3–8–1, and have sealed their first losing season since 2016. Carson Wentz was benched in favor for Jalen Hurts after the first drive in the third quarter. On December 8, it was announced Jalen Hurts would get the starting nod in favor of Wentz. Week 14: vs. New Orleans Saints Jalen Hurts made his first start in Week 14 as the Eagles stunned the favored Saints and snapped their 9-game winning streak. Hurts and Miles Sanders each ran for over 100 yards on the Saints' top ranked run defense as the Eagles roared out to a 17–0 lead at halftime and were able to hold off a late Saints rally to win 24–21. This is the first win against the Saints since the 2015 season. Week 15: at Arizona Cardinals Coming off an upset win against the Saints, Jalen Hurts was once again named the starter for Week 15 against the Arizona Cardinals. Despite a slow start, falling behind 16–0 due to a safety and two first quarter touchdowns from Kyler Murray (one of which came off a blocked punt), three-second quarter touchdown passes from Jalen Hurts including 2 to"
  },
  {
    "chunk_id": "2020_philadelphia_eagles_season_010",
    "doc_title": "2020_philadelphia_eagles_season",
    "text": "was once again named the starter for Week 15 against the Arizona Cardinals. Despite a slow start, falling behind 16–0 due to a safety and two first quarter touchdowns from Kyler Murray (one of which came off a blocked punt), three-second quarter touchdown passes from Jalen Hurts including 2 to Greg Ward allowed the Eagles to pull within 7 at halftime. The Eagles tied the score at 26 on a 7-yard run by Hurts, however due to an injury to punter Cameron Johnston, Philadelphia was left without a holder. Tight end Zach Ertz served as a backup holder on the extra point attempt, and mishandled a poor snap from long snapper Rick Lovato. Arizona would regain the lead after a successful fake punt, with Murray throwing a go-ahead 20-yard touchdown pass to DeAndre Hopkins. The Eagles attempted a comeback drive with less than 2 minutes left in the 4th quarter but on the final play of the game Jalen Hurts's pass to Goedert was knocked away, sealing the Arizona victory. With the loss, the Eagles fall to 4–9–1, their most losses in a season since the 2016 Season. Doug Pederson announced Monday that Jalen Hurts would start again for week 16 against the Dallas Cowboys. Week 16: at Dallas Cowboys The game began with the Eagles having an eleven-point first quarter lead after two touchdowns. However, the tides would turn in the second quarter, and the Eagles would massively struggle from there, as their defense gave up 513 total yards and 37 points on the evening. Fletcher Cox suffered a stinger injury in the second quarter which would ultimately cost the Eagles their season. Jalen Hurts's poor performance began with turning the ball over three times, one of which led to a Cowboys scoring drive. With the loss, the Eagles"
  },
  {
    "chunk_id": "2020_philadelphia_eagles_season_011",
    "doc_title": "2020_philadelphia_eagles_season",
    "text": "and 37 points on the evening. Fletcher Cox suffered a stinger injury in the second quarter which would ultimately cost the Eagles their season. Jalen Hurts's poor performance began with turning the ball over three times, one of which led to a Cowboys scoring drive. With the loss, the Eagles dropped to 4–10–1 and were eliminated from playoff contention. They also suffered double digit losses for the first time since the 2012 season. Week 17: vs. Washington Football Team While Philadelphia was already eliminated when this game was conducted, the game was still relevant to the playoffs; if the Eagles won, then the New York Giants would advance as NFC East champions, while if they lost, then Washington would win the NFC East. The game was scheduled as the final game of the regular season to ensure that the televised Sunday night football game would have playoff implications. Despite erasing an early 10-point deficit, the Eagles lost 20–14 to Washington, who clinched the NFC East and the fourth seed as a result. Philadelphia finished with a 4–11–1 overall record, their worst since the 2012 season, and were swept by Washington for the first time since the 2016 season. This loss also secured a last place finish in the NFC East for the first time since 2016. After the game, coach Doug Pederson was criticized for taking out starting quarterback Jalen Hurts in the fourth quarter for a third-string quarterback with the game still in close contention, a move more associated with preseason games that allegedly shocked the Eagles players. Some writers accused Pederson of throwing the game so that the Giants would miss the playoffs, and others accused him of tanking for a better draft spot. Pederson denied the allegations. The Eagles announced Pederson's dismissal eight days later, on January"
  },
  {
    "chunk_id": "2020_philadelphia_eagles_season_012",
    "doc_title": "2020_philadelphia_eagles_season",
    "text": "with preseason games that allegedly shocked the Eagles players. Some writers accused Pederson of throwing the game so that the Giants would miss the playoffs, and others accused him of tanking for a better draft spot. Pederson denied the allegations. The Eagles announced Pederson's dismissal eight days later, on January 11. Standings Division Conference References External links Official website"
  },
  {
    "chunk_id": "2021_philadelphia_eagles_season_001",
    "doc_title": "2021_philadelphia_eagles_season",
    "text": "The 2021 season was the Philadelphia Eagles' 89th season in the National Football League (NFL) and their first under head coach Nick Sirianni. They improved on their 4–11–1 record from the previous season after a 40–29 win against the New Orleans Saints in Week 11 and returned to the playoffs after a one-year absence. This was the Eagles' first season since 2015 without quarterback Carson Wentz, as he was traded to the Indianapolis Colts in March 2021. Philadelphia entered the season with low expectations following a disastrous 4–11–1 2020 season that resulted in the firing of Super Bowl champion head coach Doug Pederson. The Eagles started the 2021 season slowly with a 2–5 record. However, things turned around and the Eagles went 7–2 in their next 9 games and clinched a playoff berth after a one-year absence. The Eagles finished tied with the New Orleans Saints for the last Wild Card spot, but won the tiebreaker based on their Week 11 head-to-head victory over the Saints. The Eagles went on to face the Tampa Bay Buccaneers in the Wild Card round, but lost by a score of 31–15 to the defending champions. Despite the 9–8 record, the Eagles did not beat any team that made the playoffs in the 2021 season, going 0–6. New Orleans was the only team with a winning record that the Eagles beat during the season. Roster changes Free agents Signings Departures Trades March 17: The Eagles traded QB Carson Wentz to the Indianapolis Colts for a third-round pick in the 2021 NFL draft and a conditional second-round pick in the 2022 NFL draft. March 17: Per the terms that saw WR Marquise Goodwin traded to the Philadelphia Eagles in 2020, Goodwin has reverted to San Francisco 49ers after not appearing for Philadelphia. The Eagles received"
  },
  {
    "chunk_id": "2021_philadelphia_eagles_season_002",
    "doc_title": "2021_philadelphia_eagles_season",
    "text": "a third-round pick in the 2021 NFL draft and a conditional second-round pick in the 2022 NFL draft. March 17: Per the terms that saw WR Marquise Goodwin traded to the Philadelphia Eagles in 2020, Goodwin has reverted to San Francisco 49ers after not appearing for Philadelphia. The Eagles received a seventh-round selection in the 2021 NFL draft from 49ers as part of this deal. May 18: The Eagles traded CB Jameson Houston and a sixth-round pick in the 2023 NFL draft to the Jacksonville Jaguars for CB Josiah Scott. August 28: The Eagles traded a conditional sixth-round pick in the 2022 NFL draft to the Jacksonville Jaguars for QB Gardner Minshew. August 31: The Eagles traded G Matt Pryor and a seventh-round pick in the 2022 NFL draft to the Indianapolis Colts for a sixth-round pick in the 2022 NFL draft. October 15: The Eagles traded TE Zach Ertz to the Arizona Cardinals for CB Tay Gowan and a fifth-round pick in the 2022 NFL draft. October 25: The Eagles traded QB Joe Flacco to the New York Jets for a conditional sixth-round pick in the 2022 NFL draft. November 2: The Eagles traded a sixth-round pick in the 2022 NFL draft to the Denver Broncos for CB Kary Vincent Jr. Draft Draft Notes The Eagles received two compensatory selections, both in the sixth round (224th and 225th overall). The Eagles traded a fourth-round selection (110th) to the Cleveland Browns in exchange for defensive end Genard Avery. The Eagles received a third-round selection (84th) and a 2022 conditional second-round selection, which became a first-round selection, from the Indianapolis Colts in exchange for quarterback Carson Wentz The Eagles received 2020 and 2021 fifth-round selections (156th) from the Dallas Cowboys in exchange for a 2020 fourth-round selection. The Eagles received 2021"
  },
  {
    "chunk_id": "2021_philadelphia_eagles_season_003",
    "doc_title": "2021_philadelphia_eagles_season",
    "text": "received a third-round selection (84th) and a 2022 conditional second-round selection, which became a first-round selection, from the Indianapolis Colts in exchange for quarterback Carson Wentz The Eagles received 2020 and 2021 fifth-round selections (156th) from the Dallas Cowboys in exchange for a 2020 fourth-round selection. The Eagles received 2021 seventh-round selection (240th) from the San Francisco 49ers as part of the deal that saw Marquise Goodwin revert to the 49ers. The Eagles traded their first-round selection (6th) and a fifth-round selection (156th) to the Miami Dolphins in exchange for a first-round selection (12th), a fourth-round selection (123rd), and a 2022 first-round selection. The Eagles traded their first-round selection (12th) and third-round selection (84th) to the Dallas Cowboys in exchange for a first round selection (10th) Philadelphia traded a third-round selection (70th) to Carolina in exchange for third and sixth-round selections (73rd and 191st) The Eagles traded a sixth-round selection (225th) and a seventh-round selection (240th) to the Washington Football Team in exchange for a fifth-round selection in the 2022 NFL draft Staff Final roster Preseason Regular season Schedule The Eagles' 2021 schedule was announced on May 12. Note: Intra-division opponents are in bold text. Game summaries Week 1: at Atlanta Falcons After an Atlanta field goal, the Eagles would take the lead after an 18 yard pass from Jalen Hurts to DeVonta Smith and never looked back. The week one rout over the Falcons was the Eagles biggest win, scoring over 30 points, and have a winning record (1-0) for the first time since 2019. This is also the Eagles first win in Atlanta since 2009. Week 2: vs. San Francisco 49ers The Eagles would start the game being able to march down the field throughout the first half, including a 91 yard bomb from Jalen Hurts to Quez"
  },
  {
    "chunk_id": "2021_philadelphia_eagles_season_004",
    "doc_title": "2021_philadelphia_eagles_season",
    "text": "for the first time since 2019. This is also the Eagles first win in Atlanta since 2009. Week 2: vs. San Francisco 49ers The Eagles would start the game being able to march down the field throughout the first half, including a 91 yard bomb from Jalen Hurts to Quez Watkins. However, after a failed \"Philly Special\" attempt, and blocked field goal, the Birds could only muster 3 points in the first half. The 49ers would tack on 10 points in the 4th quarter before surrendering a late QB sneak TD from Hurts. The loss dropped the Eagles to 1-1 and their first loss to the 49ers since 2014. Week 3: at Dallas Cowboys The Eagles traveled down to Arlington, Texas to take on the Dallas Cowboys on Monday Night Football. The Cowboys would jump on the board quickly after an Ezekiel Elliott 1 yard TD. The Eagles defense made a play by stripping the ball from Dak Prescott in their own endzone resulting in a touchdown from Fletcher Cox. From that point on, the Dallas offense had its way on the Eagles defense and didn't get any help from a pass heavy Eagles offense that could not gain much momentum. The Eagles would get a couple of garbage time TDs from Jalen Hurts to Zach Ertz and Greg Ward. With the loss, the Eagles would fall to 1-2 and lose their 4th straight game at AT&T Stadium. Week 4: vs. Kansas City Chiefs Week 5: at Carolina Panthers After a slow offensive start, the Eagles would rally a second half comeback with the help of a blocked punt and outscoring the Panthers 15-3 in the second half. With the win, the Eagles improved to 2-3. Week 6: vs. Tampa Bay Buccaneers Week 7: at Las Vegas Raiders Week 8:"
  },
  {
    "chunk_id": "2021_philadelphia_eagles_season_005",
    "doc_title": "2021_philadelphia_eagles_season",
    "text": "a slow offensive start, the Eagles would rally a second half comeback with the help of a blocked punt and outscoring the Panthers 15-3 in the second half. With the win, the Eagles improved to 2-3. Week 6: vs. Tampa Bay Buccaneers Week 7: at Las Vegas Raiders Week 8: at Detroit Lions In a newly looking, run heavy offense, the Eagles would rush their way to a 44-6 blowout over the lowly Detroit Lions. The win marks the first time the Eagles win at Ford Field since 2010, as well as their first 40+ point game since Super Bowl LII. With the Win, the Eagles improve to 3-5. Week 9: vs. Los Angeles Chargers Week 10: at Denver Broncos Going into Denver, the Eagles introduced their white jersey on black pants. With the win, the Eagles earn their first win in Denver since 1989 and matched their 2020 win total. Week 11: vs. New Orleans Saints The Eagles survived a late rally by the Saints to earn their first home win since Week 14 of the 2020 season, which coincidentally also came against New Orleans. Philadelphia improved to 5–6 on the season with the 40-29 win, improving on their win total from the previous season. Week 12: at New York Giants Hurts played poorly throughout the game, throwing 3 interceptions. On the Eagles' final two plays, Jalen Reagor dropped two passes at the goal line, securing their defeat. With the loss, the Eagles 2-game winning streak was snapped as they fell to 5–7, and lost back-to-back games against the Giants for the first time since 2007-08. Week 13: at New York Jets Thanks to a stellar performance by backup quarterback Gardner Minshew, the Eagles improved to 12–0 in their all-time series against the New York Jets. Week 15: vs."
  },
  {
    "chunk_id": "2021_philadelphia_eagles_season_006",
    "doc_title": "2021_philadelphia_eagles_season",
    "text": "they fell to 5–7, and lost back-to-back games against the Giants for the first time since 2007-08. Week 13: at New York Jets Thanks to a stellar performance by backup quarterback Gardner Minshew, the Eagles improved to 12–0 in their all-time series against the New York Jets. Week 15: vs. Washington Football Team In the week leading up to the game, a COVID-19 outbreak among the Washington Football Team led to postponement of the game originally scheduled for December 19. The game was moved to Tuesday night. On the rare Tuesday Night Football, Washington got off to a quick start after a pair of Eagles turnovers starting from a flukey interception bouncing off of Dallas Goedert's foot to a Jalen Hurts' fumble. From the second quarter on, the Eagles would score 20 unanswered points before surrendering a Washington TD. A late back shoulder throw from Jalen Hurts to Greg Ward would secure the Eagles' victory. This is the first divisional win in the Hurts/Sirianni era and a win that keeps the Eagles alive in the playoff push. Week 16: vs. New York Giants Despite a slow start, the Eagles rallied with 31 second-half points in a 34-10 rout of the shorthanded New York Giants, including a touchdown catch by Lane Johnson and a pick-six by Alex Singleton. This win was Philadelphia's eighth straight home win and 90th overall win over their rivals. Week 17: at Washington Football Team Despite again playing less-than-stellar football to start the game, the Eagles rallied for their fourth straight win, improving to 9-7 on the year and earning their first winning season and playoff appearance since 2019, thanks to wins by the San Francisco 49ers and Green Bay Packers later that day. This was also Philadelphia's first sweep of Washington since that same season, and"
  },
  {
    "chunk_id": "2021_philadelphia_eagles_season_007",
    "doc_title": "2021_philadelphia_eagles_season",
    "text": "for their fourth straight win, improving to 9-7 on the year and earning their first winning season and playoff appearance since 2019, thanks to wins by the San Francisco 49ers and Green Bay Packers later that day. This was also Philadelphia's first sweep of Washington since that same season, and their fourth in their past five seasons. Week 18: vs. Dallas Cowboys With a playoff spot already clinched, the Eagles rested Jalen Hurts, who was nursing an ankle injury, and most other key starters in the season finale. The Cowboys, who played nearly all of their key starters, had an offensive attack that was too powerful for the Eagles' backups to handle. The 51–26 loss ended the Eagles' regular season with a 9–8 record, and the 51 points were the most the Eagles surrendered in a single game at Lincoln Financial Field, surpassing the previous mark of 48 against the New Orleans Saints in 2009. Standings Division Conference Postseason Game summaries NFC Wild Card Playoffs: at (2) Tampa Bay Buccaneers The Eagles travelled to take on the #2 seed and defending Super Bowl champion Tampa Bay Buccaneers. Tampa Bay would jump out to an early lead and never look back in a 31-15 rout of Philadelphia. The game would mark the first career playoff appearances for Eagles head coach Nick Sirianni and quarterback Jalen Hurts, and would be the final playoff victory for Tampa Bay quarterback Tom Brady. Brady marched the Bucs to two first quarter touchdown drives, while Hurts struggled to move the ball against the Tampa defense. A Ryan Succop 34-yard field goal early in the second quarter pushed the Tampa lead to 17–0. Trying to get the Eagles back into the game, Hurts drove the offense to the Tampa 21-yard line late in the half, but a"
  },
  {
    "chunk_id": "2021_philadelphia_eagles_season_008",
    "doc_title": "2021_philadelphia_eagles_season",
    "text": "struggled to move the ball against the Tampa defense. A Ryan Succop 34-yard field goal early in the second quarter pushed the Tampa lead to 17–0. Trying to get the Eagles back into the game, Hurts drove the offense to the Tampa 21-yard line late in the half, but a pass intended for DeVonta Smith was intercepted in the end zone. The Eagles defense stopped the Bucs on their first drive of the third quarter, but Jalen Reagor muffed the punt, and Brady turned the opportunity into short touchdown pass to Rob Gronkowski. Hurts was intercepted again on the ensuing drive, and Brady laced a 36-yard touchdown pass to Mike Evans on the next play to it 31–0 Bucs. Early in the fourth quarter, Smith gained 31 yards on a catch-and-run, and Boston Scott scampered 34 yards for a touchdown on the following play to get the Eagles on the board. Hurts completed a 14-yard touchdown to rookie Kenneth Gainwell on the next drive, then found Smith for a successful 2-point conversion to close the scoring at 31–15. Tampa boasted after the game that Hurts was unable to read their defense. He finished with 258 yards passing with one touchdown and two interceptions. Dallas Goedert caught six passes for 92 yards, while defensive end Ryan Kerrigan, coming off a disappointing season for the Eagles and playing in his last game as a professional, tallied 1.5 sacks of Brady. Statistics Team Individual Statistics correct as of the end of the 2021 NFL season References External links Official website"
  },
  {
    "chunk_id": "2021_philadelphia_eagles_season_009",
    "doc_title": "2021_philadelphia_eagles_season",
    "text": "NFL season References External links Official website"
  },
  {
    "chunk_id": "2022_philadelphia_eagles_season_001",
    "doc_title": "2022_philadelphia_eagles_season",
    "text": "The 2022 season was the Philadelphia Eagles' 90th in the National Football League (NFL), their 20th playing home games at Lincoln Financial Field, their second under head coach Nick Sirianni, and seventh under general manager Howie Roseman since he returned to the position (twelfth overall). The Eagles started 8–0 for the first time in franchise history, before their winning streak was snapped with a 32–21 upset loss to the Washington Commanders in Week 10. They improved on their 9–8 record from last year after a 40–33 victory over the Green Bay Packers in Week 12. With a 48–22 road win over the division rival New York Giants in Week 14, the Eagles clinched their second straight playoff berth, and their fifth in six seasons. After a 25–20 road win over the Chicago Bears in Week 15, the Eagles matched their franchise-best 13–1 start in the 2004 season and secured their third 13-win season win in franchise history, after 2004 and 2017. With a 22–16 win over the Giants in Week 18, the Eagles won the NFC East for the first time since 2019, and clinched the NFC's #1 seed for the first time since 2017. The Eagles also reached 14 regular season wins, a franchise record. In the Divisional Round, the Eagles routed the Giants 38–7 for their first postseason win since 2018. With this win, Philadelphia completed a 3-0 sweep of all three games played against New York, and advanced to the NFC Championship for the first time since 2017. The Eagles went on to win the NFC Championship against the San Francisco 49ers 31–7, advancing to Super Bowl LVII, their fourth Super Bowl appearance in franchise history, to face the Kansas City Chiefs and former longtime head coach Andy Reid. Despite holding a 24–14 lead at halftime, the"
  },
  {
    "chunk_id": "2022_philadelphia_eagles_season_002",
    "doc_title": "2022_philadelphia_eagles_season",
    "text": "2017. The Eagles went on to win the NFC Championship against the San Francisco 49ers 31–7, advancing to Super Bowl LVII, their fourth Super Bowl appearance in franchise history, to face the Kansas City Chiefs and former longtime head coach Andy Reid. Despite holding a 24–14 lead at halftime, the Eagles ultimately lost to the Chiefs by a score of 38–35. As of 2025, this is the most recent season where the Eagles did not face the Buccaneers or Rams. Roster changes Free agents Signings Departures Trades April 28: The Eagles traded a first-round pick in the 2022 NFL draft and a third-round pick in the 2022 NFL draft to the Tennessee Titans for WR A. J. Brown. August 15: The Eagles traded TE J. J. Arcega-Whiteside to the Seattle Seahawks for S Ugo Amadi. August 24: The Eagles traded S Ugo Amadi and a seventh-round pick in the 2024 NFL draft to the Tennessee Titans for a sixth-round pick in the 2024 NFL draft. August 30: The Eagles traded a fifth-round pick in the 2023 NFL draft and a sixth-round pick in the 2024 NFL draft to the New Orleans Saints for S C. J. Gardner-Johnson and a seventh-round pick in the 2025 NFL draft. August 31: The Eagles traded WR Jalen Reagor to the Minnesota Vikings for a seventh-round pick in the 2023 NFL draft and a conditional fourth-round pick in the 2024 NFL draft. October 26: The Eagles traded a fourth-round pick in the 2023 NFL draft to the Chicago Bears for DE Robert Quinn. Draft Draft trades Staff Final roster Team captains Jason Kelce (C) Lane Johnson (T) Jalen Hurts (QB) Jake Elliott (K) Darius Slay (CB) Fletcher Cox (DT) Brandon Graham (DE) Preseason Regular season Schedule Note: Intra-division opponents are in bold text. Game summaries"
  },
  {
    "chunk_id": "2022_philadelphia_eagles_season_003",
    "doc_title": "2022_philadelphia_eagles_season",
    "text": "to the Chicago Bears for DE Robert Quinn. Draft Draft trades Staff Final roster Team captains Jason Kelce (C) Lane Johnson (T) Jalen Hurts (QB) Jake Elliott (K) Darius Slay (CB) Fletcher Cox (DT) Brandon Graham (DE) Preseason Regular season Schedule Note: Intra-division opponents are in bold text. Game summaries Week 1: at Detroit Lions For the third straight year, the Eagles were on the road to kick off the season. After the Lions scored on their opening drive, the Eagles would score 21 unanswered points. The Lions would try and rally with 21 points in the second half, but the Eagles would hang on and defeat the Lions for the second straight year. With the win, the Eagles started 1–0 for the ninth time since 2010 and for the second time under head coach Nick Sirianni. Week 2: vs. Minnesota Vikings This week 2 matchup was thought to see two high powered offenses go at it in a possible high scoring affair. However, only the Eagles would show off their high powered offense. The Eagles would receive the ball and march down the field finishing with a 3 yard Jalen Hurts touchdown. Kicking off the second quarter, Jalen Hurts would connect with Quez Watkins on a 53 yard touchdown to double Philadelphia's lead to 14–0. The Vikings would counter that with a touchdown pass from Kirk Cousins to Irv Smith Jr. Later in the second quarter, Jalen Hurts would scramble and power his way in for a 26 yard touchdown (the longest from an Eagles QB since Donovan McNabb in 2002). The Eagles would close out the second quarter with a Jake Elliott 38 yard field goal. In the second half, the Eagles defense would step up and shut down the Vikings offense. The only glimmers of hope for"
  },
  {
    "chunk_id": "2022_philadelphia_eagles_season_004",
    "doc_title": "2022_philadelphia_eagles_season",
    "text": "touchdown (the longest from an Eagles QB since Donovan McNabb in 2002). The Eagles would close out the second quarter with a Jake Elliott 38 yard field goal. In the second half, the Eagles defense would step up and shut down the Vikings offense. The only glimmers of hope for Minnesota were a blocked field goal in the third quarter and a fourth-quarter interception by former Eagle Jordan Hicks; in both instances, however, each of the ensuing Vikings drives ended in Eagles interceptions. Despite no second half points from either team, the Eagles looked to be the dominant team. The Eagles would go on to win and have their first 2–0 start since 2016. Furthermore, this game was by far Jalen Hurts' best performance throwing the ball and claimed by many media members his possible \"breakout game.\" Jalen would finish 26 of 31 for 333 yards 3 total touchdowns and 1 interception with a passer rating of 108.7. Week 3: at Washington Commanders In his first time facing the Eagles since being traded away from them, Carson Wentz was sacked 9 times and the Commanders only had 47 total yards of offense in the first half. Jalen Hurts threw for 300 yards in back-to-back games and threw touchdown passes to Dallas Goedert, A. J. Brown, and DeVonta Smith in the second quarter. The third touchdown to Smith to make the score 24–0 was on the last play of the 1st half on 4th and Goal from the 1-yard line. Smith finished with 8 receptions for 169 yards, and the Eagles won 24–8. They became the first NFC team to hit the 3–0 mark and was the first time they accomplished that feat in six years. Week 4: vs. Jacksonville Jaguars The Eagles hosted the Jacksonville Jaguars in a reunion with"
  },
  {
    "chunk_id": "2022_philadelphia_eagles_season_005",
    "doc_title": "2022_philadelphia_eagles_season",
    "text": "finished with 8 receptions for 169 yards, and the Eagles won 24–8. They became the first NFC team to hit the 3–0 mark and was the first time they accomplished that feat in six years. Week 4: vs. Jacksonville Jaguars The Eagles hosted the Jacksonville Jaguars in a reunion with former Eagles head coach, Doug Pederson. Philadelphia entered the game as the lone unbeaten team in the league following the Miami Dolphins' loss to the Cincinnati Bengals the previous Thursday. The Jaguars jumped out to a quick 14–0 lead following a pick six by Andre Cisco and a 4 yard touchdown reception by Jamal Agnew. The Eagles rebounded with a dominant second quarter to take a 20–14 lead on touchdown runs by Jalen Hurts, Miles Sanders, and Kenneth Gainwell. The defense would also stymie Jacksonville throughout the game, forcing an interception and four Trevor Lawrence fumbles, including one that snuffed out any hope of a Jaguars comeback. With the 29–21 win, the Eagles improved to 4–0 for the first time since the 2004 season. Also with this win, Philadelphia defeated Jacksonville for the fourth straight time. The Eagles took their first-ever lead in their all-time series with the Jaguars: now leading 4–3 after initially trailing 0–3. Week 5: at Arizona Cardinals The Eagles withstood a late rally by the Cardinals and improved to 5–0 on the season. This was Philadelphia's first win in Arizona since the 2001 season, as well as their first ever win at State Farm Stadium. Week 6: vs. Dallas Cowboys The Eagles continued their 2nd quarter dominance, scoring 20 points on four consecutive drives. The Cowboys offense battled back in the 2nd half scoring touchdowns on two long drives to cut the deficit to 20–17, but DeVonta Smith scored a touchdown to make it a two-score"
  },
  {
    "chunk_id": "2022_philadelphia_eagles_season_006",
    "doc_title": "2022_philadelphia_eagles_season",
    "text": "6: vs. Dallas Cowboys The Eagles continued their 2nd quarter dominance, scoring 20 points on four consecutive drives. The Cowboys offense battled back in the 2nd half scoring touchdowns on two long drives to cut the deficit to 20–17, but DeVonta Smith scored a touchdown to make it a two-score game again. Cooper Rush threw his third interception, with the following drive leading to a missed field goal attempt. The Eagles ran out the clock and won 26–17. This was the Eagles' first win against the Cowboys since 2020, their first with Hurts at starting QB and Sirianni as head coach. They also started 6–0 for the third time in franchise history. Week 8: vs. Pittsburgh Steelers Thanks to a 3-touchdown performance by AJ Brown and 4 passing touchdowns by Jalen Hurts, with this win, the Eagles matched their franchise best 7–0 start in 2004. Week 9: at Houston Texans This was played the same day as Game 5 of the 2022 World Series between the Houston Astros and the Philadelphia Phillies, moved back by one day due to rain in Philadelphia earlier in the week. Estimates from Nielsen Media Research show the baseball game drew an average of five million more viewers, with a share of at least 50 in both Philadelphia and Houston. Meanwhile, the football game, originally scheduled to air on the Fox affiliates in both markets per NFL rules, moved to the MyNetworkTV affiliates in both markets. Week 10: vs. Washington Commanders The Eagles welcomed the surging Washington Commanders to Philadelphia for a rematch of their Week 3 meeting. Philadelphia started strong early, but the tables would turn in the second quarter once Washington got their run game going. The Commanders rallied behind a dominant ground attack and a lights-out defense, outscoring the Eagles 25–7 over"
  },
  {
    "chunk_id": "2022_philadelphia_eagles_season_007",
    "doc_title": "2022_philadelphia_eagles_season",
    "text": "surging Washington Commanders to Philadelphia for a rematch of their Week 3 meeting. Philadelphia started strong early, but the tables would turn in the second quarter once Washington got their run game going. The Commanders rallied behind a dominant ground attack and a lights-out defense, outscoring the Eagles 25–7 over the final three quarters to hand Philadelphia its first defeat of the season in a 32–21 upset. With the stunning loss, the Eagles fell to 8–1 and failed to become the first NFL team to start a season 9–0 since the Steelers did two seasons ago, who coincidentally also faced their first loss to Washington, who were then the Washington Football Team. Despite this loss, Philadelphia still tied a franchise record for their best start at 8–1. Week 11: at Indianapolis Colts This was head coach Nick Sirianni's first return to Indianapolis since leaving the team in January 2021 to become the Eagles' head coach. Sirianni previously served as the Colts' offensive coordinator under then-head coach Frank Reich from 2018 to 2020, appearing in the playoffs twice in that span, and Sirianni's last game was the 2020 AFC Wild Card game, which was a 27–24 loss to the Buffalo Bills. After trailing 13–3 through three quarters, Jalen Hurts and the Eagles rallied in the fourth quarter to stun the Colts 17–16, with Hurts running the ball for the game winning score from 7 yards out with less than 90 seconds left. This victory marked the first time the Eagles won a game after trailing by 10 or more points entering the fourth quarter since 2010. The Eagles improved to 9–1, matching their win total from 2018, 2019, and 2021, and matching their best record through 10 games set in 1949, 1960, 1980, 2004, and 2017. Week 12: vs. Green Bay"
  },
  {
    "chunk_id": "2022_philadelphia_eagles_season_008",
    "doc_title": "2022_philadelphia_eagles_season",
    "text": "a game after trailing by 10 or more points entering the fourth quarter since 2010. The Eagles improved to 9–1, matching their win total from 2018, 2019, and 2021, and matching their best record through 10 games set in 1949, 1960, 1980, 2004, and 2017. Week 12: vs. Green Bay Packers The Eagles put up 363 rushing yards against Green Bay, with both Jalen Hurts and Miles Sanders rushing for over 100 yards each. While the Eagles defense gave up 33 points to the Packers, they intercepted Aaron Rodgers twice. Rodgers exited the game in the third quarter due to an injury and was replaced by Jordan Love, who threw a 63-yard touchdown to rookie wide receiver Christian Watson. The Eagles would clinch the victory with a 54-yard field goal from Jake Elliott. With the win, the Eagles improved to 10–1 (their first double digit win season since 2017) and maintained their lead in the NFC. Week 13: vs. Tennessee Titans A. J. Brown dominated his former team for 119 yards and 2 touchdowns on 8 receptions. Philadelphia's defense held Titans star running back Derrick Henry to just 30 yards on the day. With the win, the Eagles improved to 11–1, their best start in 12 games since 2004. Week 14: at New York Giants The Eagles improved to 12–1, clinching their second consecutive playoff berth, and their best start since 2004. The 48 points scored by the Eagles were the most since 2017 versus the Broncos. Jalen Hurts had his 10th rushing touchdown of 2022 in this game, becoming the first quarterback in NFL history to have 10 or more rushing touchdowns in back to back seasons. Week 15: at Chicago Bears The Eagles would go on to win their 13th game for the third time in franchise history"
  },
  {
    "chunk_id": "2022_philadelphia_eagles_season_009",
    "doc_title": "2022_philadelphia_eagles_season",
    "text": "his 10th rushing touchdown of 2022 in this game, becoming the first quarterback in NFL history to have 10 or more rushing touchdowns in back to back seasons. Week 15: at Chicago Bears The Eagles would go on to win their 13th game for the third time in franchise history (2017, 2004 prior) and their best start since 2004. After a shaky start with 2 interceptions, Jalen Hurts would settle in throwing for 315 yards and scoring 3 touchdowns. Those touchdowns would tie an Eagles franchise record for the most total touchdowns (35) by a quarterback in a season. A day after the game, it was revealed that Hurts had sprained his shoulder late in the third quarter. Impressively, Hurts went 6/9 for 102 yards and 104.9 rating with the sprained shoulder, including a rushing touchdown and subsequent 2-point conversion. Week 16: at Dallas Cowboys Backup quarterback Gardner Minshew started the Eagles' road finale against the arch-rival Cowboys in place of Jalen Hurts, who was sitting out due to the shoulder injury he sustained the prior week against Chicago. Despite a solid performance by Minshew, Philadelphia blew two 10–point leads and was doomed by a season-high four turnovers, all of which led to scoring drives for Dallas, in what turned out to be a high-scoring slugfest. The Eagles gave up a 3rd-and-30 conversion via Dak Prescott's 52-yard pass to T.Y. Hilton, which the Cowboys would score a touchdown that same drive, which proved to be the turning point of the game. Trailing 40–34 late in the game, Minshew attempted to lead the Eagles on a go-ahead drive into Cowboys territory, but a fourth-down pass would fall incomplete, sealing Philadelphia's first and ultimately only road loss of the season. With the loss, the Eagles fell to 13–2. Week 17: vs. New"
  },
  {
    "chunk_id": "2022_philadelphia_eagles_season_010",
    "doc_title": "2022_philadelphia_eagles_season",
    "text": "game. Trailing 40–34 late in the game, Minshew attempted to lead the Eagles on a go-ahead drive into Cowboys territory, but a fourth-down pass would fall incomplete, sealing Philadelphia's first and ultimately only road loss of the season. With the loss, the Eagles fell to 13–2. Week 17: vs. New Orleans Saints The Eagles returned home, seeking to clinch the NFC East for the first time since 2019 and the number 1 seed for the first time since 2017. However, they were instead dealt their second straight defeat in a defensive slugfest with a red-hot New Orleans Saints team. After falling behind 13–0 at halftime, Philadelphia pulled within three points of New Orleans with a ten-point third quarter, but their momentum would be halted with a Marshon Lattimore pick-six in the fourth quarter. With the 20–10 upset loss, the Eagles dropped to 13–3 on the year, and now need either a Week 18 win against the New York Giants or a Dallas Cowboys loss to clinch the division. It was the first since the 2018 season that Philadelphia was defeated by New Orleans. Week 18: vs. New York Giants Jalen Hurts returned to the Eagles' lineup against the New York Giants after missing the previous two games to a shoulder injury. Philadelphia would secure the NFC East division and the NFC's top seed behind five field goals by Jake Elliott and a rushing touchdown by Boston Scott. With the 22–16 victory, their ninth straight at home against the Giants, the Eagles finished the regular season with a 14–3 record, and set a franchise high for most regular season wins in a season. Standings Division Conference Postseason Schedule Game summaries NFC Divisional Playoffs: vs. (6) New York Giants The Eagles convincingly routed their division rival New York Giants 38–7 in their"
  },
  {
    "chunk_id": "2022_philadelphia_eagles_season_011",
    "doc_title": "2022_philadelphia_eagles_season",
    "text": "Eagles finished the regular season with a 14–3 record, and set a franchise high for most regular season wins in a season. Standings Division Conference Postseason Schedule Game summaries NFC Divisional Playoffs: vs. (6) New York Giants The Eagles convincingly routed their division rival New York Giants 38–7 in their first home playoff victory since the 2017 Super Bowl championship season. New York had won their Wild Card playoff matchup on the road against the Minnesota Vikings, with Daniel Jones turning in arguably his strongest performance as a professional. The Eagles, meanwhile, had lumbered down the stretch, dropping two of their last three games and needing to play starters in Week 18 to finally secure the top seed. Jalen Hurts connected with DeVonta Smith for 40 yards on the second play from scrimmage. Dallas Goedert brought in a pass one-handed for a touchdown to finish the drive. Consecutive sacks by Haason Reddick turned the ball back over to the Eagles, who went up 14–0 on a 9-yard touchdown reception by Smith. Former Giant James Bradberry intercepted Jones on New York's ensuing possession. In the second quarter, Boston Scott scored on a 3-yard touchdown run, and Hurts capped off a 14-play drive with a 5-yard touchdown run to push the score to 28–0. A third quarter touchdown run by Matt Breida got New York on the board, set up by a 39-yard Saquon Barkley rush. A 15-play, 8-minute drive resulted in a Jake Elliott field goal and essentially ended any hope of a New York comeback. A 35-yard rushing touchdown by Kenneth Gainwell closed the scoring at 38–7 Eagles. The Eagles offense produced 268 rushing yards on 44 carries, with Gainwell leading the way at 112 yards, while the defense contributed five sacks. With the victory, the Eagles advanced to the"
  },
  {
    "chunk_id": "2022_philadelphia_eagles_season_012",
    "doc_title": "2022_philadelphia_eagles_season",
    "text": "of a New York comeback. A 35-yard rushing touchdown by Kenneth Gainwell closed the scoring at 38–7 Eagles. The Eagles offense produced 268 rushing yards on 44 carries, with Gainwell leading the way at 112 yards, while the defense contributed five sacks. With the victory, the Eagles advanced to the NFC Championship, their first in five seasons. NFC Championship: vs. (2) San Francisco 49ers The Eagles routed the San Francisco 49ers 31–7 in the NFC Championship Game. While this was Philadelphia's first appearance in the conference championship since the 2017 season, it was San Francisco's third trip in four years. The 49ers had rolled to a 13–4 record and second seed during the season, mostly behind the league's top-ranked defense, but also due to the surprising play of rookie (7th round draft pick) quarterback Brock Purdy. On the opening drive of the game, DeVonta Smith made a diving, one-armed reception on a fourth down play to set up first-and-goal for the Eagles. Replays showed the ball had hit the ground, but the 49ers failed to challenge the play in time. Miles Sanders took a handoff six yards up the middle for a touchdown to make it 7–0 Philadelphia. On San Francisco's first possession, Purdy was sacked while in his throwing motion by Haason Reddick. The hit resulted in a fumble recovered by Eagles nose tackle Linval Joseph, and more consequentially, injured Purdy's throwing elbow. Journeyman backup Josh Johnson replaced Purdy, and strong defensive play by each team dominated the rest of the first quarter and into the second quarter. An impressive 29-yard touchdown run, in which he broke four tackles, by Christian McCaffrey tied the game for San Francisco. The Eagles answered immediately with a methodical touchdown drive capped off by a 13-yard scamper into the end zone by Sanders."
  },
  {
    "chunk_id": "2022_philadelphia_eagles_season_013",
    "doc_title": "2022_philadelphia_eagles_season",
    "text": "of the first quarter and into the second quarter. An impressive 29-yard touchdown run, in which he broke four tackles, by Christian McCaffrey tied the game for San Francisco. The Eagles answered immediately with a methodical touchdown drive capped off by a 13-yard scamper into the end zone by Sanders. With 1:19 left in the half, Johnson lost a fumble on a shotgun, and Boston Scott rushed to the right side for a 10-yard touchdown to make it 21–7 Eagles at halftime. On the first series of the third quarter, Johnson was knocked out of the game on a hit by Ndamukong Suh, forcing an injured Purdy back into action. With Purdy unable throw more than about ten yards, the 49ers offense was powerless to mount a credible comeback attempt. Jalen Hurts added a 1-yard rushing touchdown after a 15-play drive late in the third quarter, and Jake Elliott's fourth quarter field goal made it 31–7 Eagles. With less than 5 minutes left to play, 49ers All-Pro left tackle Trent Williams slammed Eagles backup safety K'Von Wallace to the ground, causing a brawl between both teams. The 49ers were able to limit Hurts to just 121 passing yards; however, the Eagles ground attack was able to move the ball against the stout San Francisco rushing defense, totaling 148 yards for the day with all four touchdowns coming on the ground. The Eagles defense tallied three sacks and forced three turnovers (all fumbles). With the win, Philadelphia reached the Super Bowl for the first time since Super Bowl LII. The win would also mark the franchise's fourth overall NFC Championship and their third since 2004, all of which were won at Lincoln Financial Field. Super Bowl LVII: vs. (A1) Kansas City Chiefs The Eagles fell 38–35 to the Kansas City Chiefs"
  },
  {
    "chunk_id": "2022_philadelphia_eagles_season_014",
    "doc_title": "2022_philadelphia_eagles_season",
    "text": "for the first time since Super Bowl LII. The win would also mark the franchise's fourth overall NFC Championship and their third since 2004, all of which were won at Lincoln Financial Field. Super Bowl LVII: vs. (A1) Kansas City Chiefs The Eagles fell 38–35 to the Kansas City Chiefs in the franchise's fourth ever Super Bowl appearance. Pre-game storylines centered on Eagles center Jason Kelce and Chiefs tight end Travis Kelce becoming the first brothers to meet in the Super Bowl. Additionally, Chiefs head coach Andy Reid was facing his former team, where he spent 14 seasons as head coach (1999-2012). Finally, the game featured two of the league's best quarterbacks in Jalen Hurts and Patrick Mahomes in the first-ever Super Bowl matchup of two black quarterbacks. Hurts opened the scoring with a quarterback sneak into the end zone on the first series. Mahomes needed six plays to match, tying the game on a touchdown pass to Kelce. On the first play of the second quarter, Hurts connected on a 45-yard bomb to receiver A. J. Brown in the end zone to make it 14–7 Eagles. On Philadelphia's next possession, Hurts drove to midfield, but lost the football in the backfield on a third down play. Chiefs linebacker Nick Bolton recovered the fumble and returned it for a game-tying touchdown. Hurts responded to the costly miscue with a 75-yard drive ending in him rushing the ball in himself for a 4-yard score. On Kansas City's next possession, Mahomes appeared to aggravate an ankle injury he had suffered earlier in the playoffs after a tackle by linebacker T. J. Edwards. A 22-yard reception by A.J. Brown helped set up a 35-yard Jake Elliott field goal, sending the teams to halftime with the score 24–14 Philadelphia. The Chiefs offense would play"
  },
  {
    "chunk_id": "2022_philadelphia_eagles_season_015",
    "doc_title": "2022_philadelphia_eagles_season",
    "text": "to aggravate an ankle injury he had suffered earlier in the playoffs after a tackle by linebacker T. J. Edwards. A 22-yard reception by A.J. Brown helped set up a 35-yard Jake Elliott field goal, sending the teams to halftime with the score 24–14 Philadelphia. The Chiefs offense would play a nearly flawless second half, however. Their opening drive of the third quarter culminated in an Isiah Pacheco 1-yard touchdown run, narrowing the score to 27–24. Hurts countered with a 17-play drive that included two impressive third down conversions to tight end Dallas Goedert, but the drive ended in a field goal, allowing Kansas City to take its first lead when Mahomes hit Kadarius Toney for a 5-yard touchdown on the Chiefs' next possession. The Eagles then went three-and-out, and the resultant Arryn Siposs punt was kicked away from the planned coverage, enabling a 65-yard return by Toney to the Philadelphia 5-yard line. Mahomes, on a broken play, completed a touchdown pass to Skyy Moore, opening up a 35–27 Chiefs lead. With just over nine minutes remaining in regulation, Hurts drove the Eagles to midfield then connected on a 45-yard pass down the left sideline to DeVonta Smith. Hurts scored on a quarterback sneak on the next play, then broke a tackle on the two-point conversion attempt to tie the game at 35–35. Philadelphia's defense remained unable to stop the Chiefs, however, and Mahomes drove into the red zone. A controversial holding penalty on Eagles corner James Bradberry allowed the Chiefs to run down most of the remaining time before kicking the game-deciding field goal from 27 yards out. Hurts starred for the Eagles in defeat, passing for 304 yards and a touchdown, while also rushing for 70 yards and three touchdowns. The Philadelphia defense, which recorded 70 sacks during"
  },
  {
    "chunk_id": "2022_philadelphia_eagles_season_016",
    "doc_title": "2022_philadelphia_eagles_season",
    "text": "Chiefs to run down most of the remaining time before kicking the game-deciding field goal from 27 yards out. Hurts starred for the Eagles in defeat, passing for 304 yards and a touchdown, while also rushing for 70 yards and three touchdowns. The Philadelphia defense, which recorded 70 sacks during the regular season and 8 in the playoffs, was unable to get to Mahomes. The defeat dropped the Eagles to 1–3 all-time in Super Bowls. Awards and honors References External links Official website"
  },
  {
    "chunk_id": "2023_philadelphia_eagles_season_001",
    "doc_title": "2023_philadelphia_eagles_season",
    "text": "The 2023 season was the Philadelphia Eagles' 91st season in the National Football League (NFL), their 30th under the ownership of Jeffrey Lurie and their third under head coach Nick Sirianni. The Eagles entered the season as defending NFC champions. This season would mark the first season since 2010 that the Eagles wore Kelly green uniforms and the first time since 1995 that they would be featured multiple times in a season. Despite starting with a 10–1 record for the second consecutive season, the Eagles lost five of their last six games. In Week 17, after a devastating home loss to the Arizona Cardinals, the Eagles lost control of their own destiny for the NFC East division title. In Week 18, after the Cowboys' victory against the Commanders and their own loss to the Giants, the Eagles were locked into the #5 seed. Even in victory, the Eagles had problems with a poor defense the entire season, which was ranked 26th out of 32; 8 of their 11 victories fell within one score, while they conversely suffered blowout losses to the playoff-bound 49ers and Cowboys, as well as the Giants by 3 scores. In fact, the Eagles defense allowed the third-most points of any team in the league, with over 428. The Eagles' late season woes continued into the playoffs, in which they were eliminated in the Wild Card round by the NFC South champion Tampa Bay Buccaneers in a 32–9 loss. This was the final season for center Jason Kelce, who announced his retirement in the subsequent offseason after spending his entire 13-year career with the Eagles. It was also the final season for defensive tackle Fletcher Cox, who retired after spending his entire 12-year career with the team. The Philadelphia Eagles drew an average home attendance of 69,878"
  },
  {
    "chunk_id": "2023_philadelphia_eagles_season_002",
    "doc_title": "2023_philadelphia_eagles_season",
    "text": "Kelce, who announced his retirement in the subsequent offseason after spending his entire 13-year career with the Eagles. It was also the final season for defensive tackle Fletcher Cox, who retired after spending his entire 12-year career with the team. The Philadelphia Eagles drew an average home attendance of 69,878 in 8 home games in the 2023 NFL season. Roster changes Free agents Signings Departures Trades Draft Draft trades Staff Final roster Preseason Regular season Schedule Note: Intra-division opponents are in bold text. Game summaries Week 1: at New England Patriots On a rainy opening day, the Eagles would come out of the gates strong with 16 unanswered points which included a 32-yard field goal from Jake Elliott, a Darius Slay 70 yard pick 6 and a 5-yard touchdown pass from Jalen Hurts to DeVonta Smith. New England would rally back with a pair of touchdown passes from Mac Jones to Hunter Henry and Kendrick Bourne. In the second half, Jake Elliott would kick 3 field goals from 56, 48, and 51 yards. The Patriots would march down the field late in the 4th quarter and score a touchdown pass from Jones to Bourne again making the score 25–20. A Jalen Hurts fumble and turnover on downs gave the Patriots 2 more shots for the go-ahead touchdown. On 4th-and-11 with 24 seconds left in the game, Jones appeared to complete a pass to Kayshon Boutte to set up 1st-and-goal for the Patriots at the Eagle's 7-yard line before Boutte was forced out of bounds by Josh Jobe. However, the pass was ruled incomplete after the replay showed that Boutte did not get both feet inbounds after catching the ball, therefore resulting in a turnover on downs, and the Eagles would win their season opener for the third straight year (all"
  },
  {
    "chunk_id": "2023_philadelphia_eagles_season_003",
    "doc_title": "2023_philadelphia_eagles_season",
    "text": "forced out of bounds by Josh Jobe. However, the pass was ruled incomplete after the replay showed that Boutte did not get both feet inbounds after catching the ball, therefore resulting in a turnover on downs, and the Eagles would win their season opener for the third straight year (all on the road) and their seventh in the last eight seasons. Week 2: vs. Minnesota Vikings The Eagles would strike first on a 24-yard Jake Elliott field goal. In the second quarter, the Vikings would get on the board with a 5-yard touchdown pass from Kirk Cousins to T.J. Hockenson. The Eagles would punch back with a Jalen Hurts \"tush push\" 1-yard touchdown. The Vikings would march down the field with Cousins hitting a wide open Justin Jefferson. On the play, Jefferson was diving towards the pylon. However, in doing so, the ball would come loose from his hand prior to going over the plain and would go out of bounds in the endzone resulting in a touchback. Under a minute remaining, the Eagles would march down to set up Jake Elliott for a 61-yard field goal. It would tie as his longest career field goal made and put the Eagles up 13–7 at the half. On the opening second half drive, the Eagles would march down the field again and Jalen Hurts would score his second touchdown on the day with another \"tush push.\" The Eagles would once again get the ball back on a Vikings turnover and Jalen Hurts would hit DeVonta Smith for a 63-yard touchdown putting the Eagles up 27–7. The Vikings would fight back on a pair of touchdowns from the Vikings making the score 27–21. The Eagles would rush their way down the field and would top it off with a 2-yard D'Andre Swift"
  },
  {
    "chunk_id": "2023_philadelphia_eagles_season_004",
    "doc_title": "2023_philadelphia_eagles_season",
    "text": "Hurts would hit DeVonta Smith for a 63-yard touchdown putting the Eagles up 27–7. The Vikings would fight back on a pair of touchdowns from the Vikings making the score 27–21. The Eagles would rush their way down the field and would top it off with a 2-yard D'Andre Swift touchdown. Keeping things interesting, the Vikings would quickly march down field and score a touchdown of their own from Cousins to Hockenson making the score 34–28. The Vikings would get the ball back one more time in a Hail Mary effort, but would fall short. The game was noted on the 4 Vikings turnovers caused by the Eagles defense and the Eagles vicious rushing attack mainly coming from Swift who had 175 yards on the ground. The Eagles would come out 2-0 for the second straight year. Week 3: at Tampa Bay Buccaneers The Eagles took a 13–3 lead at halftime and built up to a 25–3 lead during the 4th quarter. While the Buccaneers responded with a touchdown and a 2-point conversion, the Eagles never let Tampa Bay get the ball back. Week 4: vs. Washington Commanders In a back-and-forth thriller that featured many lead changes in the fourth quarter, the Eagles defeated their division rival in overtime. This win, along with a Miami Dolphins loss to the Buffalo Bills, allowed Philadelphia to become one of only two unbeaten teams remaining, the other being the San Francisco 49ers, who defeated the Arizona Cardinals later that day. Week 5: at Los Angeles Rams Although the Rams took a 14–10 lead with 32 seconds remaining in the first half, the Eagles responded with a touchdown drive capped by a 1-yard Jalen Hurts run to take a 17–14 lead at halftime. The Rams were shut out in the second half as the"
  },
  {
    "chunk_id": "2023_philadelphia_eagles_season_005",
    "doc_title": "2023_philadelphia_eagles_season",
    "text": "Los Angeles Rams Although the Rams took a 14–10 lead with 32 seconds remaining in the first half, the Eagles responded with a touchdown drive capped by a 1-yard Jalen Hurts run to take a 17–14 lead at halftime. The Rams were shut out in the second half as the Eagles extended their lead with two fourth-quarter field goals to secure the win. Week 6: at New York Jets The Eagles entered their Week 6 matchup with the New York Jets as the lone remaining undefeated team in the league, thanks to the San Francisco 49ers' loss to the Cleveland Browns just moments after the kickoff. Philadelphia raced out to a 14–3 lead in the second quarter, but the game would quickly fall apart for the Eagles from there as the Jets continued to chip away at the lead over the remainder of the game. With their lead down to 14–12 at the two-minute warning, Jalen Hurts was picked off by Tony Adams, and gave the Jets an opportunity to win the game. Breece Hall scored the go-ahead touchdown for New York on the very next play, and Philadelphia failed to respond on their final drive, allowing the Jets to run the clock out. The Eagles fell to 5–1 on the season with the 20–14 upset loss. It also marked Philadelphia's first ever loss to the New York Jets in thirteen regular-season meetings. Week 7: vs. Miami Dolphins Following their first-ever loss to the New York Jets, the Eagles returned to Lincoln Financial Field to face the AFC East-leading Miami Dolphins. Philadelphia wore its Kelly Green alternate uniforms for the first time since 2010. After trading field goals with the Dolphins in the first quarter, the Eagles would jump out to a 17–3 lead on a Dallas Goedert touchdown reception,"
  },
  {
    "chunk_id": "2023_philadelphia_eagles_season_006",
    "doc_title": "2023_philadelphia_eagles_season",
    "text": "to Lincoln Financial Field to face the AFC East-leading Miami Dolphins. Philadelphia wore its Kelly Green alternate uniforms for the first time since 2010. After trading field goals with the Dolphins in the first quarter, the Eagles would jump out to a 17–3 lead on a Dallas Goedert touchdown reception, followed by a Jalen Hurts quarterback sneak. Tyreek Hill would close the gap to seven points before halftime with a 27-yard touchdown reception. The teams traded punts to start the second half, before the Eagles forced a turnover on downs on a controversial play where James Bradberry appeared to grab the face mask of Cedrick Wilson Jr., but no penalty was called. A game-tying 22-yard pick six by Jerome Baker almost immediately after the controversial call seemed to turn the momentum in Miami's favor. However, Baker's pick six proved to be the last Dolphins score, as the Eagles took control of the ball for the rest of the game. On the very next possession, A. J. Brown scored on a 14-yard reception, and Kenneth Gainwell ran 3 yards for the game-clinching touchdown in the fourth quarter. With the 31–17 win, the Eagles improved to 6–1 on the season, and became the top team in the conference when the San Francisco 49ers lost to the Minnesota Vikings the following night. Week 8: at Washington Commanders In an offense-heavy game between the two teams, the Commanders jumped out to a 14–3 lead and were up 17–10 at halftime due to a 61-yard field goal as the half expired. However, Philadelphia scored three consecutive touchdowns in the fourth quarter to take a 38–24 lead. While Washington was able to cut the deficit to 38–31, their ensuing onside kick was recovered by Philadelphia, preserving the Eagles' win. Week 9: vs. Dallas Cowboys Despite committing"
  },
  {
    "chunk_id": "2023_philadelphia_eagles_season_007",
    "doc_title": "2023_philadelphia_eagles_season",
    "text": "field goal as the half expired. However, Philadelphia scored three consecutive touchdowns in the fourth quarter to take a 38–24 lead. While Washington was able to cut the deficit to 38–31, their ensuing onside kick was recovered by Philadelphia, preserving the Eagles' win. Week 9: vs. Dallas Cowboys Despite committing multiple mistakes in the game's closing minutes, the Eagles staved off a late Cowboys rally to preserve a 28–23 win. The Eagles narrowly escaped with the victory when Dak Prescott completed a pass to CeeDee Lamb, who was tackled by Darius Slay four yards short of the end zone as time expired. Philadelphia improved to 8–1 for the second consecutive year with the win, and earned their first victory over a Dak Prescott led Cowboys team for the first time since 2019. Week 11: at Kansas City Chiefs In a rematch of Super Bowl LVII, the Chiefs took a 17–7 lead at halftime on touchdowns by Justin Watson and Travis Kelce and a field goal by Harrison Butker, while the only Eagles' scoring play of the first half was a touchdown by D'Andre Swift. However, the Eagles held the Chiefs scoreless in the second half and mounted a comeback. In the third quarter, Jalen Hurts rushed for a 10-yard touchdown to cut the Chiefs' lead to 17–14. In the fourth quarter, the Chiefs converted a 4th-and-1 in the Eagles red zone, but on the next play, Bradley Roby stripped the ball from Kelce and Nicholas Morrow recovered the fumble. Two possessions later, Hurts rushed for a 1-yard touchdown, giving the Eagles a 21–17 lead. On the Chiefs' final drive, Patrick Mahomes threw a long pass that was dropped by Marquez Valdes-Scantling, and on the next play, Mahomes was flagged for intentional grounding, setting up 4th-and-25 for the Chiefs. Mahomes' pass"
  },
  {
    "chunk_id": "2023_philadelphia_eagles_season_008",
    "doc_title": "2023_philadelphia_eagles_season",
    "text": "possessions later, Hurts rushed for a 1-yard touchdown, giving the Eagles a 21–17 lead. On the Chiefs' final drive, Patrick Mahomes threw a long pass that was dropped by Marquez Valdes-Scantling, and on the next play, Mahomes was flagged for intentional grounding, setting up 4th-and-25 for the Chiefs. Mahomes' pass to Watson fell incomplete, turning the ball over on downs, and allowing the Eagles to run out the clock. The Eagles improved to 9–1 with their first ever consecutive 9-1 starts in franchise history. This was the Eagles' first-ever win against former longtime head coach Andy Reid. Week 12: vs. Buffalo Bills Despite trailing 24–14 at the end of the 3rd quarter, the Eagles were able to take the lead following a touchdown, an interception by the Bills and another touchdown. While the Bills took the lead just after the two minute warning with another touchdown, Jake Elliott converted a 59-yard field goal with 20 seconds left to force overtime. After the Eagles held the Bills to a field goal, Jalen Hurts rushed for a touchdown to complete the comeback. Week 13: vs. San Francisco 49ers In a rematch of the 2022 NFC Championship Game, which saw the San Francisco 49ers without their quarterback Brock Purdy, the Eagles took a 6–0 lead in the first quarter buoyed by a poor performance from Purdy and two field goals for Philadelphia by Jake Elliott. However, the next six drives from San Francisco for the remaining three quarters all resulted in touchdowns, with Purdy and Deebo Samuel leading the charge to bring San Francisco to 42 points. Philadelphia could only manage to score on two drives in the second half, both touchdowns from Jalen Hurts and DeVonta Smith, with the latter touchdown being followed by an unsuccessful two-point conversion attempt. Philadelphia scored only"
  },
  {
    "chunk_id": "2023_philadelphia_eagles_season_009",
    "doc_title": "2023_philadelphia_eagles_season",
    "text": "Purdy and Deebo Samuel leading the charge to bring San Francisco to 42 points. Philadelphia could only manage to score on two drives in the second half, both touchdowns from Jalen Hurts and DeVonta Smith, with the latter touchdown being followed by an unsuccessful two-point conversion attempt. Philadelphia scored only 19 points in the loss, falling to 10–2. Week 14: at Dallas Cowboys The Cowboys took a 24–6 lead at halftime, with Philadelphia being held to two field goals while the Cowboys scored three touchdowns and converted a 60-yard field goal. While Philadelphia did respond in the second half with a fumble recovery touchdown by Jalen Carter, the Eagles could not score again, while Aubrey converted 3 more field goals. Following the loss, the Cowboys took NFC East control from the Eagles. Week 15: at Seattle Seahawks Seattle started their backup quarterback Drew Lock in place of the injured Geno Smith. The first three quarters saw Philadelphia take the lead over Seattle 17–10, from two touchdowns from Jalen Hurts and a field goal from Jake Elliott. In the fourth quarter, with two minutes left in the game and Seattle down 13–17, Lock led his team on a 94-yard drive, culminating in a 29-yard pass to Jaxon Smith-Njigba in the end zone for a touchdown to take the lead with 28 seconds left to play. Philadelphia attempted a last-ditch drive to score, which spanned 20 yards and 22 seconds before Hurts was intercepted by Julian Love, sealing the win for Seattle and handing Philadelphia their third straight loss. Seattle also extended their winning streak over Philadelphia to eight, including the teams' 2019 postseason meeting. Since 2008, the Eagles have not beaten the Seahawks. Week 16: vs. New York Giants Christmas Day games The Eagles took a 20–3 lead at halftime on"
  },
  {
    "chunk_id": "2023_philadelphia_eagles_season_010",
    "doc_title": "2023_philadelphia_eagles_season",
    "text": "and handing Philadelphia their third straight loss. Seattle also extended their winning streak over Philadelphia to eight, including the teams' 2019 postseason meeting. Since 2008, the Eagles have not beaten the Seahawks. Week 16: vs. New York Giants Christmas Day games The Eagles took a 20–3 lead at halftime on touchdowns by Jalen Hurts and DeVonta Smith and two field goals by Jake Elliott, while the Giants' only scoring play of the half was a field goal by Mason Crosby. However, the Giants started to chip away at the Eagles' lead during the third quarter. During the kickoff at the beginning of the half, Giants linebacker Isaiah Simmons threw Eagles wide receiver Olamide Zaccheaus into running back Boston Scott, causing a fumble that was recovered by Simmons. Soon after, Saquon Barkley scored on a 7-yard run, and near the end of the third quarter, Hurts threw an interception to cornerback Adoree' Jackson, who returned it 76 yards for a touchdown, during which Hurts was flagged for a horse-collar tackle while trying to chase down Jackson. The Giants elected to enforce that penalty on a two-point conversion attempt, which Barkley scored, cutting the Eagles' lead to 20–18. In the fourth quarter, on the Eagles' next drive, Hurts converted a 3rd-and-20 to wide receiver A. J. Brown, which eventually lead to a 5-yard touchdown run by D'Andre Swift. The Giants turned the ball over on downs after failing to convert a 4th-and-1, leading to Elliott kicking another field goal to increase Philadelphia's lead to 30–18. New York responded with a two-play 75-yard drive, culminating in Darius Slayton scoring on a 69-yard pass from Tyrod Taylor, cutting the Eagles' lead to 30–25. Trying to run out the clock with the ground game, Philadelphia drove to the New York 26-yard line, but could only"
  },
  {
    "chunk_id": "2023_philadelphia_eagles_season_011",
    "doc_title": "2023_philadelphia_eagles_season",
    "text": "lead to 30–18. New York responded with a two-play 75-yard drive, culminating in Darius Slayton scoring on a 69-yard pass from Tyrod Taylor, cutting the Eagles' lead to 30–25. Trying to run out the clock with the ground game, Philadelphia drove to the New York 26-yard line, but could only run the clock down to 1:14, resulting in another field goal by Elliott, keeping it a one-score game at 33–25. The Giants, now needing a touchdown and a two-point conversion to send the game into overtime, drove to the Philadelphia 26-yard line with three seconds remaining, but Taylor threw a pass that was intercepted in the end zone by Eagles cornerback Kelee Ringo, sealing the victory for the Eagles and snapping their three-game losing streak. The Eagles improved to 11–4 with the win and regained control of the NFC East following the Dallas Cowboys' loss to the Miami Dolphins the previous night. Week 17: vs. Arizona Cardinals Philadelphia took a 21–6 lead at halftime from three touchdowns, two from Julio Jones and one from an interception return by Sydney Brown. Arizona only scored two field goals in the first half, but would make the only scoring plays in the third quarter: touchdowns from Michael Carter and James Conner, with the latter touchdown being followed by a successful two-point conversion to tie the game at 21–21. In the fourth quarter, Philadelphia and Arizona each scored touchdowns, from Dallas Goedert and Michael Wilson respectively, keeping the game tied at 28–28. Despite the Cardinals attempting an onside kick and failing to recover, a poor offense led Philadelphia to do a field goal to take the lead with two minutes left in regulation, during which key receiver DeVonta Smith was injured and withdrew from the game. Kyler Murray led Arizona on a 70-yard drive,"
  },
  {
    "chunk_id": "2023_philadelphia_eagles_season_012",
    "doc_title": "2023_philadelphia_eagles_season",
    "text": "Cardinals attempting an onside kick and failing to recover, a poor offense led Philadelphia to do a field goal to take the lead with two minutes left in regulation, during which key receiver DeVonta Smith was injured and withdrew from the game. Kyler Murray led Arizona on a 70-yard drive, with Conner scoring a decisive touchdown in the final minute. With 32 seconds left to play, Jalen Hurts attempted a last-ditch effort to score only to be intercepted by Joey Blount, mirroring Philadelphia's defeat to the Seattle Seahawks two weeks prior, thus sealing the upset for Arizona. With the stunning 35–31 loss and the Dallas Cowboys' win over the Detroit Lions the night prior, the Eagles surrendered control of the NFC East and their playoff positioning to Dallas. As the San Francisco 49ers had defeated the Washington Commanders that same day, Philadelphia also lost their chances at clinching the first seed in the conference, as San Francisco clinched the first seed. Week 18: at New York Giants New York came out of the gate with an explosive offense that saw them score 24 points in the first half off of three touchdowns and a field goal, with Tyrod Taylor throwing for 229 yards in the first half. Philadelphia failed to score in the first half, during which A. J. Brown, Sydney Brown, and Jalen Hurts withdrew from the game due to injuries. Marcus Mariota entered the game for Hurts and led Philadelphia to a field goal and a touchdown in the second half. Although New York's offense had cooled down by then, the Eagles were unable to overcome the deficit as they ended the regular season with a 27–10 loss. With the loss, the Eagles ended their season 11–6, and clinched the fifth seed in the NFC as the Dallas"
  },
  {
    "chunk_id": "2023_philadelphia_eagles_season_013",
    "doc_title": "2023_philadelphia_eagles_season",
    "text": "the second half. Although New York's offense had cooled down by then, the Eagles were unable to overcome the deficit as they ended the regular season with a 27–10 loss. With the loss, the Eagles ended their season 11–6, and clinched the fifth seed in the NFC as the Dallas Cowboys had beaten the Washington Commanders to take the division title and mark the NFC East's 19th consecutive season without a repeat champion. Standings Division Conference Postseason Schedule Game summaries NFC Wild Card Playoffs: at (4) Tampa Bay Buccaneers Philadelphia returned to the playoffs coming off a disastrous late-season collapse that saw them fall into the fifth seed, and were hoping to reverse their momentum with a win over NFC South champion Tampa Bay. Wide receiver A. J. Brown, who suffered a knee injury in the regular season finale against the New York Giants, was unable to make it to the game. Philadelphia's poor defense struggled to tackle Tampa Bay's ball carriers, giving up huge runs down the field; Tampa Bay logged 119 rushing yards on 29 carries and made 6-of-14 third down conversions, with Baker Mayfield throwing for 337 yards and three touchdowns. Most notably, cornerback James Bradberry made contact with Trey Palmer but failed to bring him down, proving costly as it facilitated his 56-yard touchdown run in the third quarter. Philadelphia's offensive line failed to perform well as Tampa Bay also employed the blitz defense against Jalen Hurts, leading to him getting sacked three times, with one of them occurring inside of Philadelphia's own end zone, resulting in a safety. On the offensive side, Philadelphia were held to just a field goal and a passing touchdown by Tampa Bay's defense. Following their touchdown, Philadelphia attempted a \"tush push\" maneuver for a two-point conversion, but Tampa Bay was"
  },
  {
    "chunk_id": "2023_philadelphia_eagles_season_014",
    "doc_title": "2023_philadelphia_eagles_season",
    "text": "of them occurring inside of Philadelphia's own end zone, resulting in a safety. On the offensive side, Philadelphia were held to just a field goal and a passing touchdown by Tampa Bay's defense. Following their touchdown, Philadelphia attempted a \"tush push\" maneuver for a two-point conversion, but Tampa Bay was able to hold them off and pull Hurts away from the end zone. Although Hurts threw for 250 yards and DeVonta Smith caught for 148 yards, not once did Philadelphia convert off of a third down, and they only logged 42 rushing yards on 15 carries. Their sixth loss in seven games, Philadelphia exited the postseason early with the 32–9 blowout loss, unable to defend their NFC championship. The Eagles promptly fired offensive coordinator Brian Johnson and defensive coordinators Sean Desai and Matt Patricia within a week of their playoff exit. References External links Official website"
  },
  {
    "chunk_id": "2024_philadelphia_eagles_season_001",
    "doc_title": "2024_philadelphia_eagles_season",
    "text": "The 2024 season was the Philadelphia Eagles' 92nd in the National Football League (NFL) and their fourth under head coach Nick Sirianni. The Eagles won their second Super Bowl title and first since 2017, defeating the two-time defending champion Kansas City Chiefs 40–22, in Super Bowl LIX. With this victory, the Eagles became the only franchise in NFL history to win multiple Super Bowls against defending Super Bowl champions, having previously done so seven years earlier. Philadelphia also became the only NFL franchise to avenge a Super Bowl loss against multiple franchises, defeating the Patriots and Chiefs in Super Bowls LII and LIX after losing to them in XXXIX and LVII, respectively. In the offseason, two longtime Eagles players, center Jason Kelce and defensive tackle Fletcher Cox, announced their retirements. This season was highlighted by the spectacular play of the newly acquired Saquon Barkley, who became the ninth running back in NFL history to reach 2,000 yards. Despite a turnover-plagued 2–2 start which included a stunning home loss to the Atlanta Falcons and a 33–16 drubbing at the Tampa Bay Buccaneers, the Eagles rebounded to win 16 of their final 17 games. With their Week 14 win over the Carolina Panthers, along with losses by the Falcons and Arizona Cardinals that same day, the Eagles clinched a playoff berth for the fourth straight year and seventh time in the last 8 seasons. With a Week 15 win over their instate rival Pittsburgh Steelers, the Eagles also improved on their 11–6 record from the previous season and won ten consecutive games for the first time in franchise history. In Week 17, the Eagles clinched the NFC East and with that win, swept the Dallas Cowboys for the first time since 2011. With their Week 18 win over the New York Giants,"
  },
  {
    "chunk_id": "2024_philadelphia_eagles_season_002",
    "doc_title": "2024_philadelphia_eagles_season",
    "text": "record from the previous season and won ten consecutive games for the first time in franchise history. In Week 17, the Eagles clinched the NFC East and with that win, swept the Dallas Cowboys for the first time since 2011. With their Week 18 win over the New York Giants, the Eagles finished 14–3 for the second time in three seasons. Under first-year defensive coordinator Vic Fangio, The defense vastly improved from last season by finishing first in total defense, allowing just 278.4 yards per game—the lowest in the league, as well as allowing only 17.8 points per game which was the second fewest overall. They registered 41 sacks, and forced 22 turnovers, as well as ranking second in turnover differential with a +11. The Eagles defeated the Green Bay Packers 22–10 in the Wild Card Round and the Los Angeles Rams 28–22 in the Divisional Round. In the NFC Championship Game, the Eagles defeated their division rival Washington Commanders 55–23 to advance to Super Bowl LIX. That victory also gave the Eagles an all-time winning record for the first time in franchise history. The Eagles then faced the Chiefs in a rematch of Super Bowl LVII from two years earlier and defeated the two-time defending champions 40–22, preventing Kansas City from winning three straight Super Bowl championships. The Eagles finished with 18 total wins, tying an NFL record for most total wins in a season along with the 1984 San Francisco 49ers, 1985 Chicago Bears, and 2007 New England Patriots. The Eagles also set an NFL record for most points scored in one postseason, at 145. In December 2024, Philadelphia Eagles owner Jeffrey Lurie sold an 8% minority stake in the team to two family investment groups, based on a valuation of $8.3 billion. NFL Top 100 The Eagles"
  },
  {
    "chunk_id": "2024_philadelphia_eagles_season_003",
    "doc_title": "2024_philadelphia_eagles_season",
    "text": "Patriots. The Eagles also set an NFL record for most points scored in one postseason, at 145. In December 2024, Philadelphia Eagles owner Jeffrey Lurie sold an 8% minority stake in the team to two family investment groups, based on a valuation of $8.3 billion. NFL Top 100 The Eagles had five players ranked in the NFL Top 100 Players of 2024. The following player was ranked in the NFL Top 100 Players of 2024 based on his performance with the Philadelphia Eagles in 2023 but is no longer on the team following the release of the list. Offseason Coaching changes On January 22, 2024, the Eagles fired defensive coordinator Sean Desai after only one year in that role. On January 23, the Eagles relieved offensive coordinator Brian Johnson of his duties. On January 27, Vic Fangio was named the team's new defensive coordinator. On February 5, the team named Kellen Moore their new offensive coordinator. The 2024 season was the second season in a row that the Eagles fielded both new offensive and defensive coordinators. Roster changes Future contracts All players listed below were signed to reserve/future contracts on January 18, unless otherwise noted. Each player was officially added to the active roster on March 13—the first day of the 2024 league year. Free agents Signings Extensions Releases Retirements Trades Trades below only are for trades that included a player. Draft pick-only trades will go in draft section. Draft Draft notes Undrafted free agents All undrafted free agents were signed on May 10, unless otherwise noted. Staff Final roster Preseason The Eagles' preseason opponents and preliminary schedule were announced on May 15, in conjunction with the release of the regular season schedule. Regular season Schedule Note: Intra-division opponents are in bold text. Game summaries Week 1: vs. Green Bay"
  },
  {
    "chunk_id": "2024_philadelphia_eagles_season_004",
    "doc_title": "2024_philadelphia_eagles_season",
    "text": "signed on May 10, unless otherwise noted. Staff Final roster Preseason The Eagles' preseason opponents and preliminary schedule were announced on May 15, in conjunction with the release of the regular season schedule. Regular season Schedule Note: Intra-division opponents are in bold text. Game summaries Week 1: vs. Green Bay Packers NFL Brazil games In the first quarter, the Eagles turned the ball over twice in Packers territory, however, the defense was able to hold them to field goals both times, thus the Eagles only trailed 6–0 after the first quarter. In the second quarter, both teams exchanged touchdowns twice to make the score 19–14 in favor of the Packers, before the Eagles drove down the field. Despite taking up the final five minutes from the half, the Eagles were held to a field goal, resulting in the score being 19–17 at halftime. After the two sides exchanged touchdowns in the third quarter, the Eagles were able to take a 31–26 lead after Jordan Love got picked off deep in Eagles territory. Following a miss by Brayden Narveson from 43 yards out, the Eagles drove all the way to the Packers 14 yard line before Jalen Hurts got intercepted in the end zone. However, the Packers were held to a field goal on their next drive, and on their next possession, the Eagles drained the clock to just 27 seconds before kicking a field goal to take a 34–29 lead. Despite the Packers reaching midfield, Zack Baun got a sack on Malik Willis after Love exited the game due to an injury, clinching the win. Week 2: vs. Atlanta Falcons Despite having the ball deep in Atlanta territory up 18–15, giving the team a 99% chance of victory, the Eagles could not hold on and were dealt their first home"
  },
  {
    "chunk_id": "2024_philadelphia_eagles_season_005",
    "doc_title": "2024_philadelphia_eagles_season",
    "text": "on Malik Willis after Love exited the game due to an injury, clinching the win. Week 2: vs. Atlanta Falcons Despite having the ball deep in Atlanta territory up 18–15, giving the team a 99% chance of victory, the Eagles could not hold on and were dealt their first home loss to the Falcons since the 2012 season. A dropped pass by Saquon Barkley stopped the clock, giving Atlanta time on the final drive to take the lead with 34 seconds remaining in regulation. Jessie Bates III then picked off Jalen Hurts on the Eagles' final drive, securing the 22–21 upset victory for Atlanta and dropping Philadelphia to 1–1 on the year. Week 3: at New Orleans Saints The Eagles fell behind 3–0 after three quarters following two turnovers from quarterback Jalen Hurts and two failed fourth-down conversions in New Orleans territory. However, at the beginning of the final quarter, Saquon Barkley rushed for a 65-yard touchdown after the Saints had a turnover on downs deep in Eagles territory following a blocked punt. Following a field goal by the Saints, Eagles kicker Jake Elliott missed a 60-yard field goal, and the Saints scored a touchdown to take a 12–7 lead with just over two minutes left. However, a short pass from Hurts to Dallas Goedert for 61 yards on 3rd-and-16 set up another touchdown plus a two-point conversion by Barkley to make it a 15–12 Eagles lead. Reed Blankenship picked off Derek Carr on the final drive to seal the win. The Eagles won in New Orleans for the first time since 2007. Week 4: at Tampa Bay Buccaneers The Eagles visited the Tampa Bay Buccaneers without star receivers A. J. Brown and DeVonta Smith as well as tackle Lane Johnson, due to concussions suffered by Smith and Johnson and"
  },
  {
    "chunk_id": "2024_philadelphia_eagles_season_006",
    "doc_title": "2024_philadelphia_eagles_season",
    "text": "win. The Eagles won in New Orleans for the first time since 2007. Week 4: at Tampa Bay Buccaneers The Eagles visited the Tampa Bay Buccaneers without star receivers A. J. Brown and DeVonta Smith as well as tackle Lane Johnson, due to concussions suffered by Smith and Johnson and an ailing hamstring for Brown respectively. The Buccaneers raced to a 24–0 lead in the first half, and never looked back. While the Eagles were able to cut Tampa Bay's lead to 24–14 in the third quarter thanks to a better defensive effort, the Buccaneers would pull away, limiting Philadelphia to only a defensive two-point conversion the rest of the way. The Eagles dropped to 2–2 with the 33–16 road loss. It was the fourth time in the last five meetings Tampa Bay had beaten Philadelphia, including playoff matchups in 2022 and 2024. Week 6: vs. Cleveland Browns The Eagles jumped out to a 10–0 lead following a 49-yard field goal by Elliott and a 22-yard touchdown reception by A. J. Brown. However, the Browns cut the lead to 10–3 following a field goal by Dustin Hopkins, and a 57-yard field goal attempt by Elliott was blocked and returned by former Eagles safety Rodney McLeod for a touchdown to tie the game at halftime. The two teams would proceed to exchange field goals before Hurts hit DeVonta Smith for a 45-yard touchdown. The Eagles held the Browns to a 31-yard field goal to maintain a 20–16 lead, and Hurts hit Brown for a 40-yard gain to seal the game. The game marked rookie Cooper DeJean's first start of the season, playing the nickelback position. It was the first of ten straight victories after starting 2-2. Week 7: at New York Giants Thanks to a 176 rushing yard performance from Saquon"
  },
  {
    "chunk_id": "2024_philadelphia_eagles_season_007",
    "doc_title": "2024_philadelphia_eagles_season",
    "text": "Brown for a 40-yard gain to seal the game. The game marked rookie Cooper DeJean's first start of the season, playing the nickelback position. It was the first of ten straight victories after starting 2-2. Week 7: at New York Giants Thanks to a 176 rushing yard performance from Saquon Barkley and 8 sacks from the defense, the Eagles defeated their division rival Giants by a final score of 28–3. While they did not score in the first quarter, Saquon Barkley scored a rushing touchdown early in the second quarter. Later in the same quarter, Jalen Hurts connected with A. J. Brown on a 41-yard touchdown pass on a 4th-and-3. The Eagles continued scoring in the second half, converting two quarterback sneaks for touchdowns in the third and fourth quarters. Early in the fourth quarter, both teams benched their starting quarterbacks, and the Eagles rested all of their offensive starters for the remainder of the game. The only points surrendered by Philadelphia came on a field goal just before the end of the first half. This game marked the first multi-score win for the Eagles since Week 7 of 2023, as well as their first game since their 2021 season opener against the Atlanta Falcons in which they did not surrender a touchdown. Week 8: at Cincinnati Bengals Despite falling behind 10–3 early, the Eagles tied up the game by halftime, and eventually gained the lead by the end of the 3rd quarter. With the assistance of two turnovers in the fourth, the Eagles won 37–17 against the Bengals. With the win, the Eagles recorded their first-ever win in Cincinnati in six tries, as well as defeating the Bengals for the first time since 2000. The game traded time slots with the Chicago Bears-Washington Commanders matchup. As such, this was"
  },
  {
    "chunk_id": "2024_philadelphia_eagles_season_008",
    "doc_title": "2024_philadelphia_eagles_season",
    "text": "the fourth, the Eagles won 37–17 against the Bengals. With the win, the Eagles recorded their first-ever win in Cincinnati in six tries, as well as defeating the Bengals for the first time since 2000. The game traded time slots with the Chicago Bears-Washington Commanders matchup. As such, this was no longer the marquee Sunday matchup of the day. Week 9: vs. Jacksonville Jaguars The Eagles took a 22–0 lead over the Jaguars early in the third quarter. However, the Jaguars would quickly rebound with a Trevor Lawrence touchdown run and two-point conversion, cutting the Eagles' lead to 22–8. Fourteen seconds later, the Jaguars forced a Saquon Barkley fumble, which was returned for a touchdown by Travon Walker. Despite replays appearing to show Barkley down by contact, the ruling was upheld, and Jacksonville trimmed its deficit to 22–16 after the ensuing two-point conversion. The Eagles would rebuild the lead to 12 points with a 25-yard DeVonta Smith touchdown, but Lawrence would record another touchdown run to make it 28–23. The Eagles missed a 57-yard field goal on the ensuing possession, giving the Jaguars the ball near midfield with a chance to mount a game-winning drive. However, after Lawrence advanced to the Eagles 13-yard line, he threw his second interception of the afternoon to Nakobe Dean with 1:38 remaining in regulation, sealing the Eagles' fourth straight win. Philadelphia improved to 6–2 on the year. Despite coming away with the victory, Eagles head coach Nick Sirianni's decision-making was criticized due to two turnovers on downs in Jaguars territory and three failed two-point conversions. Week 10: at Dallas Cowboys The Eagles had a rocky first half. After Dallas fumbled the ball, the Eagles were set up with a short field and scored a touchdown on a quarterback sneak by Jalen Hurts to take"
  },
  {
    "chunk_id": "2024_philadelphia_eagles_season_009",
    "doc_title": "2024_philadelphia_eagles_season",
    "text": "turnovers on downs in Jaguars territory and three failed two-point conversions. Week 10: at Dallas Cowboys The Eagles had a rocky first half. After Dallas fumbled the ball, the Eagles were set up with a short field and scored a touchdown on a quarterback sneak by Jalen Hurts to take a 7–0 lead. The Cowboys answered with a Brandon Aubrey field goal to trim the Eagles' lead to 7–3. Jalen Hurts threw an interception into the end zone on the next possession. However, the Cowboys fumbled in the red zone, although the Eagles immediately fumbled as well, giving Dallas the ball at the Philadelphia 6-yard line. The Eagles defense forced a three-and-out, limiting the Cowboys to another Aubrey field goal, before ending the half with a Dallas Goedert touchdown reception to take a 14–6 lead. In the third quarter, the offense took off and took a 28–6 lead before Dallas turned the ball over three more times. The Eagles put their backups early in the 4th quarter and ultimately won 34–6. The Eagles picked up their first win in Dallas since 2017. Week 11: vs. Washington Commanders The Commanders jumped out to a 10–3 lead deep into the third quarter thanks to both a poor offense and special teams by Philadelphia, including Jake Elliott missing field goals from 44 and 51 yards. However, Philadelphia managed to score a field goal and force a punt, which they then capitalized on by scoring a touchdown to take a 12–10 lead following a missed extra point. The Commanders marched to the Philadelphia 25-yard line but Commanders head coach Dan Quinn chose to go for it on 4th and 2, which the Eagles stopped. The Eagles proceeded to score a touchdown to take a 19–10 lead before Jayden Daniels threw an interception to Reed"
  },
  {
    "chunk_id": "2024_philadelphia_eagles_season_010",
    "doc_title": "2024_philadelphia_eagles_season",
    "text": "missed extra point. The Commanders marched to the Philadelphia 25-yard line but Commanders head coach Dan Quinn chose to go for it on 4th and 2, which the Eagles stopped. The Eagles proceeded to score a touchdown to take a 19–10 lead before Jayden Daniels threw an interception to Reed Blankenship. Following the interception, Saquon Barkley ran for a 39 yard touchdown to give the Eagles a 26–10 lead. While Jayden Daniels' touchdown pass to former Eagle Zach Ertz trimmed Washington's deficit to 26–18 with 28 seconds remaining, the Commanders failed to recover the ensuing onside kick, sealing the win for Philadelphia. Week 12: at Los Angeles Rams Following a fumble recovery on the opening drive, the Eagles took a 3–0 lead on a 21-yard field goal from Jake Elliott. However, the Rams scored a touchdown to take a 7–3 lead at the end of the first quarter. The Eagles answered with another field goal by Elliott, then claimed a 13–7 lead on a 6-yard reception by A. J. Brown before halftime and would never look back. Immediately out of halftime, Saquon Barkley rushed for a 70-yard touchdown to take a 20–7 lead. The Rams responded with a touchdown to cut the lead to 20–14, but the Eagles scored a touchdown to take a 27–14 lead. Following a missed field goal from the Rams, the Eagles kicked a field goal to take a 30–14 lead. After sacking Matthew Stafford to set up a 4th-and-33, the Rams were forced to punt the ball away with only 5 minutes and 13 seconds remaining. The Eagles and Rams then exchanged touchdowns for a 37–20 final score. During the game, Saquon Barkley recorded 255 rushing yards and 302 total yards, setting two franchise records. Week 13: at Baltimore Ravens The Eagles started slow, stalling"
  },
  {
    "chunk_id": "2024_philadelphia_eagles_season_011",
    "doc_title": "2024_philadelphia_eagles_season",
    "text": "the ball away with only 5 minutes and 13 seconds remaining. The Eagles and Rams then exchanged touchdowns for a 37–20 final score. During the game, Saquon Barkley recorded 255 rushing yards and 302 total yards, setting two franchise records. Week 13: at Baltimore Ravens The Eagles started slow, stalling on all of their first-quarter possessions. Meanwhile, the Ravens kicked a field goal on their first possession and then scored a touchdown on their next possession: a pass to Mark Andrews. After this touchdown, however, kicker Justin Tucker missed the extra point, leaving the score at 9–0 Ravens. After a better offensive and defensive effort, the Eagles scored their first touchdown midway through the second quarter on a touchdown pass to Dallas Goedert. The Eagles extended their lead to 14–9, but the Ravens managed to kick a field goal just before halftime, bringing the score to 14–12, with the Eagles still in the lead. The Ravens missed two field goals in the third quarter, but the Eagles could not capitalize on either of their opportunities offensively. After stopping the Ravens' offense in the fourth quarter, the Eagles got the ball back, and they capped off their drive with a Saquon Barkley touchdown run to take a two-score lead. On the next possession, the Ravens were faced with a 4th-and-8 deep in their own territory. They decided to go for it, but Lamar Jackson's pass was tipped by Tristin McCollum and fell incomplete, and the Eagles got the ball back. They would kick a field goal to take a 24–12 lead with just over a minute to go in the game. The Ravens drove down the field and scored a touchdown with three seconds left to go in the game following a touchdown pass to Isaiah Likely, but they failed to"
  },
  {
    "chunk_id": "2024_philadelphia_eagles_season_012",
    "doc_title": "2024_philadelphia_eagles_season",
    "text": "would kick a field goal to take a 24–12 lead with just over a minute to go in the game. The Ravens drove down the field and scored a touchdown with three seconds left to go in the game following a touchdown pass to Isaiah Likely, but they failed to recover the ensuing onside kick, sealing the 24–19 win for Philadelphia. With the win, the Eagles improved to a 10–2 record. This was their eighth straight win dating back to their Week 5 bye. Philadelphia recorded their first-ever road win over the Ravens and their first win in Baltimore since the 1978 season against the Colts. Week 14: vs. Carolina Panthers Following a back-and-forth affair, the Eagles had the ball up 22–16. After their final drive stalled past midfield, the Eagles punted the football back to Carolina and pinned the ball inside the 5-yard line. Despite the Panthers getting as close as the opposite 37 yard line, wide receiver Xavier Legette dropped a go-ahead touchdown pass on 2nd down; two plays later, the Eagles defense stopped the Panthers on a 4th-and-9 to secure the 22–16 win. The Eagles improved to 11–2 with the victory, and following losses by the Falcons and Cardinals, clinched a playoff spot for the fourth consecutive year. Week 15: vs. Pittsburgh Steelers The Battle of Pennsylvania ended in a 27–13 Eagles victory. Despite struggling with turnovers early on, the Eagles would correct their course and ultimately win the game decisively. The Eagles won a franchise-record 10th straight game since the bye week and also won their 11th straight home matchup against the Steelers in the Super Bowl era. With the win, they swept the entire AFC North. They also beat Russell Wilson for the first time ever after losing their previous six matchups against Wilson during"
  },
  {
    "chunk_id": "2024_philadelphia_eagles_season_013",
    "doc_title": "2024_philadelphia_eagles_season",
    "text": "straight game since the bye week and also won their 11th straight home matchup against the Steelers in the Super Bowl era. With the win, they swept the entire AFC North. They also beat Russell Wilson for the first time ever after losing their previous six matchups against Wilson during his time in Seattle. Week 16: at Washington Commanders The Eagles initially had a 14-point lead in the first quarter, but an injury to Jalen Hurts allowed the Commanders to cut the Eagles' lead to 21–14 by halftime after a missed 56 yard field goal. Backup Kenny Pickett played out the remainder of the game as Hurts would not return, ultimately throwing 24 passes in relief. Despite the Eagles taking a 27–14 lead into the fourth quarter, back to back scoring drives gave the Commanders a 28–27 lead. The Eagles retook the lead following a 50-yard field goal by Jake Elliott and then the Eagles defense picked off Jayden Daniels for Philadelphia’s 5th turnover forced on the day. However, after wide receiver DeVonta Smith dropped a pass which would have allowed the Eagles to score another first down, they were forced to kick a field goal to extend the lead slightly to 33–28. The Commanders then begun a game-clinching, 57-yard drive culminating in a 9-yard touchdown reception by Jamison Crowder with six seconds left, giving Washington the eventual 36–33 victory. The Eagles' loss was ultimately sealed during the final kick return after cornerback Avonte Maddox had the ball punched out of his hands by safety Quan Martin, which was then recovered by Benjamin St-Juste. Due to the loss, Philadelphia missed an opportunity to secure the NFC East. This loss also broke their 10-game winning streak. Week 17: vs. Dallas Cowboys Despite not having starting quarterback Jalen Hurts, backup quarterbacks Kenny"
  },
  {
    "chunk_id": "2024_philadelphia_eagles_season_014",
    "doc_title": "2024_philadelphia_eagles_season",
    "text": "of his hands by safety Quan Martin, which was then recovered by Benjamin St-Juste. Due to the loss, Philadelphia missed an opportunity to secure the NFC East. This loss also broke their 10-game winning streak. Week 17: vs. Dallas Cowboys Despite not having starting quarterback Jalen Hurts, backup quarterbacks Kenny Pickett and Tanner McKee guided the Eagles offense to 34 points. The Eagles defense held Dallas to one touchdown while also forcing four turnovers: a C. J. Gardner-Johnson pick-six, an Oren Burks fumble, another Gardner-Johnson interception, and a Nolan Smith fumble. After several small fights throughout the early parts of the game, a massive fight broke out during the fourth quarter, resulting in the ejections of Cowboys players Jalen Brooks and Troy Pride as well as Eagles Safety Sydney Brown. With the win, the Eagles swept the Cowboys for the first time since 2011 and clinched the NFC East. Saquon Barkley reached 2,000 rushing yards, becoming the ninth running back in NFL history to do so. With the Vikings’ victory later in the day, the Eagles were locked into the NFC's #2 seed. Week 18: vs. New York Giants On December 31, 2024, the Eagles revealed they would wear their blackout alternate uniforms for their home contest against their divisional rival, the New York Giants. The Eagles rested a majority of their starters as it was no longer mathematically possible to improve their seeding. They went on to win by a final score of 20–13, which gave them their second 14-win season in the last three years. It was also the seventh time in the last eight divisional matchups Philadelphia toppled New York, dating back to December 2021, as well as their twelfth straight home win over the Giants, having last fallen to them at home in 2013. Standings Division"
  },
  {
    "chunk_id": "2024_philadelphia_eagles_season_015",
    "doc_title": "2024_philadelphia_eagles_season",
    "text": "14-win season in the last three years. It was also the seventh time in the last eight divisional matchups Philadelphia toppled New York, dating back to December 2021, as well as their twelfth straight home win over the Giants, having last fallen to them at home in 2013. Standings Division Conference Postseason Schedule Game summaries NFC Wild Card Playoffs: vs. (7) Green Bay Packers The Eagles defeated the Green Bay Packers by a 22–10 margin. Philadelphia and Green Bay had previously played each other in Week 1, a 34–29 Eagles victory in Brazil. The Packers had finished the 2024 regular season with an 11–6 record, the best ever by an NFC #7 seed. Eagles starting quarterback Jalen Hurts was cleared from concussion protocol after having missed most of Week 16 and all of Week 17-18, returning to start the playoff run while also continuing to nurse a broken finger on his non-throwing hand, while Packers quarterback Jordan Love was looking to repeat his success from the 2023-24 NFL playoffs. A hit by Oren Burks on the opening kickoff dislodged the football and led to a Philadelphia recovery at Green Bay 28-yard line. Hurts found Jahan Dotson for a touchdown reception three plays later to open the scoring. Later in the quarter, the Eagles added a Jake Elliott field goal to complete an 11-play drive and extend the lead to 10–0. Interceptions by Darius Slay and Zack Baun helped hold Green Bay scoreless through the second quarter. The Packers cut the lead to 10–3 with a field goal in the third quarter, but the Eagles quickly responded with a 5-play drive featuring a 28-yard reception by DeVonta Smith and a 24-yard touchdown reception by tight end Dallas Goedert, in which he stiff-armed Packer corner Carrington Valentine multiple times on his way"
  },
  {
    "chunk_id": "2024_philadelphia_eagles_season_016",
    "doc_title": "2024_philadelphia_eagles_season",
    "text": "lead to 10–3 with a field goal in the third quarter, but the Eagles quickly responded with a 5-play drive featuring a 28-yard reception by DeVonta Smith and a 24-yard touchdown reception by tight end Dallas Goedert, in which he stiff-armed Packer corner Carrington Valentine multiple times on his way to the end zone. The play put Philadelphia ahead 16–3, but on Green Bay's ensuing possession, running back Josh Jacobs broke through for a 32-yard run, then scored from a yard out on the next play to make it 16–10 early in the fourth quarter. Hurts led the Eagles on a 13-play field goal drive that ate up 7:23 of game clock to make it 19–10 Philadelphia. Green Bay went for it fourth down on their next possession, but Malik Heath could not bring in Love's pass and keep his feet inbounds. An unnecessary roughness penalty on Packers' defensive lineman T.J. Slaton for a late-hit on Saquon Barkley extended Philadelphia's next drive and led to a 32-yard Elliott field goal and a 22–10 lead. Quinyon Mitchell then intercepted Love in the end zone to put to rest any Green Bay comeback hopes. Barkley finished the game with 25 carries for 119 yards and seemingly would have had more if he didn't choose to slide down at the Philadelphia 41-yard line with open field ahead of him on the Eagles' final possession. The Eagles won the turnover differential 4–0, carried by three interceptions of Love, while Nolan Smith chipped in a pair of sacks. The Packers were further hindered by four starters, including their top two receivers (Romeo Doubs and Jayden Reed), leaving the game due to injury. This was the Eagles' first Wild Card victory at home since 2006. NFC Divisional Playoffs: vs. (4) Los Angeles Rams The Eagles defeated"
  },
  {
    "chunk_id": "2024_philadelphia_eagles_season_017",
    "doc_title": "2024_philadelphia_eagles_season",
    "text": "pair of sacks. The Packers were further hindered by four starters, including their top two receivers (Romeo Doubs and Jayden Reed), leaving the game due to injury. This was the Eagles' first Wild Card victory at home since 2006. NFC Divisional Playoffs: vs. (4) Los Angeles Rams The Eagles defeated the Los Angeles Rams 28–22 in a contest heavily impacted by winter weather in the second half. In Week 12, Philadelphia had defeated the Rams 37–20 at SoFi Stadium as Saquon Barkley set the Eagles franchise record for rushing yards in a single game with 255. His performance included touchdown runs of 72 and 70 yards. Much of the pregame attention focused on disparaging comments about Philadelphia fans made by Rams rookie linebacker Jared Verse. Philadelphia scored on the opening drive on a 44-yard touchdown run by Jalen Hurts, but Jake Elliott missed the extra point leaving the Eagles with a 6–0 lead. The Rams answered with a 13-play touchdown drive, capped by a 4-yard Tyler Higbee touchdown reception, to take a 7–6 lead. Later in the opening quarter, Saquon Barkley broke a 62-yard touchdown run to the right side to give the Eagles a 13–7 lead. Los Angeles responded with a field goal to cut the Eagles lead to 13–10, and timely sacks by Verse prevented Philadelphia from scoring on either of its second quarter possessions. As the third quarter began, heavy snow was falling and accumulating on the field surface. Following another field goal by the Rams, the score was tied 13–13 midway through the third quarter. The Eagles responded with a 44-yard Elliott field goal to take a 16–13 lead, but after getting pinned deep in their own territory, Hurts took a sack in the end zone for a safety to cut the Eagles lead to one"
  },
  {
    "chunk_id": "2024_philadelphia_eagles_season_018",
    "doc_title": "2024_philadelphia_eagles_season",
    "text": "score was tied 13–13 midway through the third quarter. The Eagles responded with a 44-yard Elliott field goal to take a 16–13 lead, but after getting pinned deep in their own territory, Hurts took a sack in the end zone for a safety to cut the Eagles lead to one point. However, on the opening play of the fourth quarter with the Rams driving, Jalen Carter punched the ball away from Kyren Williams, with Isaiah Rodgers recovering the fumble and returning it to the Rams 10-yard line. A false start penalty took a would-be Hurts touchdown off the board, forcing the Eagles to settle for a field goal and a 19–15 lead. On Los Angeles' next drive, Matthew Stafford was strip sacked by Nolan Smith, with Zack Baun recovering at the Rams 38-yard line. The Eagles converted another field goal to extend the lead to 22–15. Following a three-and-out by the Rams, Barkley broke loose in the snow down the left sideline for a 78-yard touchdown with under five minutes to play, but another missed extra point kept the Eagles lead to 28–15. The Rams, in a hurry up offense, proceeded to score a touchdown to cut the Eagles lead to 28–22. The Eagles quickly went three-and-out, taking only 13 seconds off the clock, before Braden Mann hit a 55-yard punt to pin the Rams at their 18-yard line. Stafford again drove down the field, completing a 37-yard sideline pass to Puka Nacua inside the red zone. However, Carter came up with a season-saving sack on third down, then pressured Stafford into an errant throw on the resulting fourth down, sealing the win for Philadelphia. With the victory, the Eagles advanced to their second NFC Championship game in three years. Barkley finished with 205 rushing yards, making him the first"
  },
  {
    "chunk_id": "2024_philadelphia_eagles_season_019",
    "doc_title": "2024_philadelphia_eagles_season",
    "text": "up with a season-saving sack on third down, then pressured Stafford into an errant throw on the resulting fourth down, sealing the win for Philadelphia. With the victory, the Eagles advanced to their second NFC Championship game in three years. Barkley finished with 205 rushing yards, making him the first player to rush for more than 200 yards against the same opponent during the regular season and playoffs. The Eagles' defense sacked Stafford five times, with Carter responsible for two of them. NFC Championship: vs. (6) Washington Commanders The Eagles exploded for 55 points in a dismantling of their division rival Washington Commanders. The game marked the second ever playoff meeting between the Commanders and Eagles; their first came in the 1990 NFC Wild Card Game, where the then-Washington Redskins defeated the Eagles 20–6 at Veterans Stadium in Philadelphia. This was the first time the NFC Championship featured a divisional matchup since the Los Angeles Rams and San Francisco 49ers from the NFC West met in the 2021–22 playoffs, and the first involving NFC East sides since the New York Giants played the Redskins in 1986–87. During the 2024 regular season, the Eagles and Commanders split the series, with the Eagles winning 26–18 during Week 11 in Philadelphia, and the Commanders winning 36–33 during Week 16 in Washington. The Commanders were coming off a 45–31 upset of the top-seeded Detroit Lions, and Jayden Daniels was looking to become the first rookie quarterback to lead his team to the Super Bowl. Daniels converted two fourth downs on the opening 18-play drive. However, the Commanders settled for a field goal. On the Eagles' first offensive play, Saquon Barkley broke a 60-yard touchdown run to make it 7–3. Linebacker Zack Baun forced a fumble on Washington's next drive, recovered by safety Reed Blankenship."
  },
  {
    "chunk_id": "2024_philadelphia_eagles_season_020",
    "doc_title": "2024_philadelphia_eagles_season",
    "text": "Daniels converted two fourth downs on the opening 18-play drive. However, the Commanders settled for a field goal. On the Eagles' first offensive play, Saquon Barkley broke a 60-yard touchdown run to make it 7–3. Linebacker Zack Baun forced a fumble on Washington's next drive, recovered by safety Reed Blankenship. The Eagles capitalized with a 4-yard Barkley touchdown run to increase the lead to 14–3. In the second quarter, Washington narrowed their deficit to 14–12 with a field goal (capping off a drive extended by a successful fake punt), followed by a 36-yard Terry McLaurin touchdown reception after a missed 54-yard field goal attempt by Eagles kicker Jake Elliott gave the Commanders a short field. Facing a 4th-and-5 from the Washington 45-yard line on the Eagles' ensuing drive, Jalen Hurts connected on a 31-yard pass to A. J. Brown. This crucial conversation led to points on a 1-yard \"tush push\" touchdown by Hurts. With less than two minutes left in the half, the Commanders fumbled the kickoff return, giving the Eagles the ball back. Hurts would complete a 4-yard touchdown pass to Brown to extend the lead to 27–12. Washington added another field goal to make the halftime score 27–15. In the third quarter, Hurts scored his second rushing touchdown, a 9-yard scamper to the left side to make it 34–15. Daniels responded with a rushing touchdown of his own, followed by a successful two-point conversion, to keep Washington within two scores. After an Eagles punt, Washington drove to midfield, but turned the ball over again, this time linebacker Oren Burks punching the ball away from Austin Ekeler. Philadelphia now began to pull away. A 22-yard rush by Barkley to the 1-yard line was followed by four straight offsides/encroachment penalties by the Commanders defense. After the fourth consecutive penalty, referee"
  },
  {
    "chunk_id": "2024_philadelphia_eagles_season_021",
    "doc_title": "2024_philadelphia_eagles_season",
    "text": "but turned the ball over again, this time linebacker Oren Burks punching the ball away from Austin Ekeler. Philadelphia now began to pull away. A 22-yard rush by Barkley to the 1-yard line was followed by four straight offsides/encroachment penalties by the Commanders defense. After the fourth consecutive penalty, referee Shaun Hochuli advised Washington that if another encroachment penalty occurred, Philadelphia would automatically be awarded 6 points. Hurts eventually scored another tush push touchdown to increase the lead to 41–23. A fourth down sack by Nolan Smith ended Washington's next drive, and Barkley put the game away with his third touchdown, a 4-yard rush to the right side. Rookie cornerback Quinyon Mitchell would then intercept a Daniels heave into in the end zone, battling McLaurin on the play. Rookie Will Shipley then ripped off a 57-yard rush, and finished the drive with a 4-yard touchdown to bring the score to 55–23. Former Eagles' tight end Zach Ertz caught 11 passes and posted 104 receiving yards, but Washington lost three fumbles and an interception. Hurts passed for 246 yards and a touchdown, while the Eagles combined for seven rushing touchdowns. The Eagles' 55 points set the record for the most points in a conference championship game. With the win, they advanced to their fifth Super Bowl in franchise history and their second in three years. Super Bowl LIX: vs. (A1) Kansas City Chiefs Two years after their 38–35 defeat at the hands of the Kansas City Chiefs in Super Bowl LVII, the Eagles routed Kansas City 40–22 in a Super Bowl rematch. The Chiefs, led by head coach Andy Reid and quarterback Patrick Mahomes, were vying for an unprecedented third straight Super Bowl championship, and were in fact the first team ever to reach the Super Bowl with a chance for"
  },
  {
    "chunk_id": "2024_philadelphia_eagles_season_022",
    "doc_title": "2024_philadelphia_eagles_season",
    "text": "the Eagles routed Kansas City 40–22 in a Super Bowl rematch. The Chiefs, led by head coach Andy Reid and quarterback Patrick Mahomes, were vying for an unprecedented third straight Super Bowl championship, and were in fact the first team ever to reach the Super Bowl with a chance for the \"threepeat\". The Eagles were forced to punt on their opening drive after a 32-yard completion to A. J. Brown was nullified by an offensive pass interference penalty. JuJu Smith-Schuster gained 11 yards on Kansas City's first offensive play, but it was to be the Chiefs' only first down until the third quarter. Jalen Hurts completed a 28-yard pass to Jahan Dotson on the Eagles ensuing drive just short of the endzone, then \"tush pushed\" the ball in on the next play for a 7–0 lead. After another Chiefs punt, Hurts took the Eagles back into Kansas City territory, but the drive ended on an interception to Bryan Cook – his first since Week 10, over half the entire NFL season ago. The Chiefs went three-and-out again and punted back to the Eagles. A 22-yard reception by Brown set up a Jake Elliott field goal. At this point, the onslaught by Philadelphia's top-ranked defense intensified. Mahomes was sacked on consecutive plays, then fired an interception to Eagles rookie cornerback Cooper DeJean, who returned the pick 38 yards for a touchdown and 17-0 advantage. After the teams traded punts, Mahomes, affected by pressure applied from defensive end Josh Sweat, tossed his second interception. The turnover, a diving catch by linebacker Zack Baun, set up Hurts' 12-yard touchdown pass to Brown, giving the Eagles a 24–0 halftime lead. Kansas City's offense continued to struggle as the third quarter began, with sacks by Jordan Davis and Sweat forcing another punt. Hurts marched the"
  },
  {
    "chunk_id": "2024_philadelphia_eagles_season_023",
    "doc_title": "2024_philadelphia_eagles_season",
    "text": "second interception. The turnover, a diving catch by linebacker Zack Baun, set up Hurts' 12-yard touchdown pass to Brown, giving the Eagles a 24–0 halftime lead. Kansas City's offense continued to struggle as the third quarter began, with sacks by Jordan Davis and Sweat forcing another punt. Hurts marched the Eagles on a 12-play field goal drive, which included two scrambles for first downs and a 22-yard downfield completion to Saquon Barkley. The Chiefs offense was then turned away again, with backup defensive back Avonte Maddox breaking up a fourth down pass to the outside intended for DeAndre Hopkins. Philadelphia took over on downs, and Jalen Hurts delivered a decisive 46-yard touchdown pass to DeVonta Smith on a play-action post pattern that extended the Eagles' lead to 34–0. Mahomes finally put the Chiefs on the board with a 24-yard touchdown pass to rookie speedster Xavier Worthy. Another Hurts scramble, this time for 17 yards, set up another Elliott field goal to make it 37–6 early in the fourth quarter. On Kansas City's next drive, defensive tackle Milton Williams strip-sacked Mahomes and recovered his own forced fumble, leading to Elliott's fourth field goal and a 40–6 lead. Mahomes would connect on garbage time touchdown passes to Hopkins and Worthy to complete the scoring. The MVP award went to Hurts, who completed 17 of his 22 passes for 221 yards and two touchdowns, to go along with his 72 rushing yards and one rushing touchdown. Barkley, the clear focus of Kansas City's defensive gameplan, had his least productive game of the season statistically (57 rushing yards), but he still eclipsed Terrell Davis' record for most rushing yards in a season including playoffs (finishing with a total of 2,504 yards). Philadelphia's defense amassed six sacks – Sweat leading the way with 2.5, and"
  },
  {
    "chunk_id": "2024_philadelphia_eagles_season_024",
    "doc_title": "2024_philadelphia_eagles_season",
    "text": "defensive gameplan, had his least productive game of the season statistically (57 rushing yards), but he still eclipsed Terrell Davis' record for most rushing yards in a season including playoffs (finishing with a total of 2,504 yards). Philadelphia's defense amassed six sacks – Sweat leading the way with 2.5, and Williams adding two of his own. The win delivered the Eagles their second championship in a seven-year span, and the dominance of the team's performance in the playoffs and latter portion of the season led to consideration of this iteration of the Eagles as the best in franchise history. Notes References External links Official website"
  },
  {
    "chunk_id": "jalen_hurts_001",
    "doc_title": "jalen_hurts",
    "text": "Jalen Alexander Hurts (born August 7, 1998) is an American professional football quarterback for the Philadelphia Eagles of the National Football League (NFL). He began his college football career with the Alabama Crimson Tide, leading the team to consecutive College Football Playoff National Championship appearances in 2016 and 2017. Hurts used his final year of eligibility with the Oklahoma Sooners and made an appearance in the 2019–20 College Football Playoff. Selected by the Eagles in the second round of the 2020 NFL draft, Hurts became their starter near the end of his rookie season. Hurts had a breakout season in 2022 when he led the Eagles to their conference's top seed and an appearance in Super Bowl LVII, earning him Pro Bowl and second-team All-Pro honors. Two years later, he won Super Bowl LIX and was named Super Bowl MVP. Early life Hurts attended Channelview High School in Channelview, Texas. Hurts' father, Averion, was the football coach at Channelview High School throughout his son's high school career. As a senior, he passed for 2,384 yards with 26 touchdown passes and rushed for 1,391 yards and 25 touchdowns. Hurts was a second-team all-district selection as a sophomore and was named the District 21-6A Overall MVP as a junior during his high school playing years. Throughout his high school career Hurts was rated as a four-star recruit and was ranked among the top dual-threat quarterbacks in the class of 2016. Although Texas A&M made a strong push to recruit Hurts, Hurts committed to the University of Alabama on June 5, 2015. He was recruited by Alabama's defensive line coach Bo Davis and offensive coordinator Lane Kiffin. In addition to football, Hurts participated in powerlifting. As a sophomore in high school, Hurts was squatting 500 pounds (230 kg) of weight and would eventually"
  },
  {
    "chunk_id": "jalen_hurts_002",
    "doc_title": "jalen_hurts",
    "text": "to the University of Alabama on June 5, 2015. He was recruited by Alabama's defensive line coach Bo Davis and offensive coordinator Lane Kiffin. In addition to football, Hurts participated in powerlifting. As a sophomore in high school, Hurts was squatting 500 pounds (230 kg) of weight and would eventually become regional finalist in the 198-pound weight class. College career Alabama Freshman season As a true freshman for the Alabama Crimson Tide football team in 2016, Hurts competed to open the season as the starting quarterback. Blake Barnett started the first game against the USC Trojans, but by the second game, Hurts had taken over the starting role, becoming the first true freshman to start at quarterback for Alabama in 32 years (Vince Sutton in 1984 was the last). Hurts produced a historic freshman season under head coach Nick Saban. He threw for 2,780 yards and 23 touchdowns with nine interceptions. His completion percentage was at 62.8 percent, and he finished the season with a quarterback rating of 139.12. He rushed for a total of 954 yards and 13 touchdowns, breaking the school single-season record for rushing yards by a quarterback, surpassing Steadman Shealy's previous record of 791 yards. He finished the 2016 season with 36 overall touchdowns breaking the previous record for touchdowns in a single season for the Crimson Tide (35) set by Blake Sims in 2014. Hurts became the first quarterback coached by Nick Saban to rush for more than 11 touchdowns in a single season. He was the first player in Alabama history to pass for 300 yards and rush for 100 yards in the same game and the first quarterback to rush for 120 yards or more in multiple games. In the Iron Bowl game against Auburn, Hurts completed 75% of his passes, which set"
  },
  {
    "chunk_id": "jalen_hurts_003",
    "doc_title": "jalen_hurts",
    "text": "was the first player in Alabama history to pass for 300 yards and rush for 100 yards in the same game and the first quarterback to rush for 120 yards or more in multiple games. In the Iron Bowl game against Auburn, Hurts completed 75% of his passes, which set a new Iron Bowl record. Alabama concluded the 2016 regular season with a perfect 12–0 (8–0 SEC) record. On November 30, 2016, Hurts was declared one of the ten finalists for the Manning Award, which is given to the nation's top college quarterback. On December 3, 2016, he led his team to win the 2016 SEC Championship by a score of 54–16 over the Florida Gators and was subsequently named SEC Offensive Player of the Year, SEC Freshman of the Year, and received Freshman All-American from several publications. Hurts was featured on the cover page of Sports Illustrated College Football Playoff magazine on December 6, 2016. On January 9, 2017, top-seeded Alabama lost the 2017 College Football Playoff National Championship against the Clemson Tigers by a score of 35–31. The bowl game was played at Raymond James Stadium in Tampa. Hurts passed and rushed for a touchdown in the loss. Sophomore season In 2017, Hurts led the Tide to an 11–1 regular season record, losing 26–14 to Auburn in the regular season finale. The Tide still qualified for the College Football Playoff as the #4 seed, where they played Clemson in the 2018 Sugar Bowl semifinal. Hurts was the offensive MVP for the 24–6 win. Going up against the Georgia Bulldogs in the 2018 College Football Playoff National Championship, Alabama fell behind 13–0 at halftime, and Hurts was benched in favor of true freshman Tua Tagovailoa. Tagovailoa led the Crimson Tide to a come-from-behind 26–23 victory in overtime. Hurts finished"
  },
  {
    "chunk_id": "jalen_hurts_004",
    "doc_title": "jalen_hurts",
    "text": "MVP for the 24–6 win. Going up against the Georgia Bulldogs in the 2018 College Football Playoff National Championship, Alabama fell behind 13–0 at halftime, and Hurts was benched in favor of true freshman Tua Tagovailoa. Tagovailoa led the Crimson Tide to a come-from-behind 26–23 victory in overtime. Hurts finished the 2017 season with 2,081 passing yards, 17 passing touchdowns, and one interception to go along with 855 rushing yards and eight rushing touchdowns. Junior season After Tagovailoa led the Crimson Tide to victory in the National Championship the year before, questions arose if Hurts would remain the starting quarterback for Alabama. In the season opener against Louisville, Tagovailoa was the starter. Hurts came into the game in a rotation. He had 70 passing yards in the 51–14 victory. Tagovailoa was officially named the starter going into the next game against Arkansas State. In a backup role, Hurts earned significant playing time in the 2018 season. He made ten appearances in the regular season, passing for seven touchdowns. In the 2018 SEC Championship Game, he relieved an injured Tagovailoa and led the team to a 35–28 comeback victory against Georgia. Alabama moved to 13–0 and secured a spot in the College Football Playoff. Hurts completed his B.A. in communication and information sciences in December 2018. Oklahoma On January 16, 2019, Hurts announced via social media he would use his final year of eligibility to transfer to the University of Oklahoma to play for the Sooners. As a graduate transfer, he was eligible to play for the 2019 season. In his first game as a Sooner on September 1, 2019, Hurts shattered Oklahoma's single-game yardage record in a debut (previously held by Baker Mayfield when he put up 396 yards of total offense against Akron in 2015), putting up 508 yards"
  },
  {
    "chunk_id": "jalen_hurts_005",
    "doc_title": "jalen_hurts",
    "text": "was eligible to play for the 2019 season. In his first game as a Sooner on September 1, 2019, Hurts shattered Oklahoma's single-game yardage record in a debut (previously held by Baker Mayfield when he put up 396 yards of total offense against Akron in 2015), putting up 508 yards of total offense against Houston. On September 28, in a 55–14 victory over Texas Tech, he had 415 passing yards, three passing touchdowns, and one interception to go along with nine carries for 70 rushing yards and a rushing touchdown. Hurts helped lead Oklahoma to a 7–0 start to the season. The team's first setback came against Kansas State on October 26. In the 48–41 loss, Hurts passed for 395 yards and a passing touchdown to go along with 19 carries for 96 rushing yards and three rushing touchdowns. Hurts helped lead Oklahoma to a Big 12 Championship and a spot in the College Football Playoff. The Sooners' season ended with a 63–28 loss to LSU in the 2019 Peach Bowl. Hurts recorded a successful season with the Sooners, recording 3,851 passing yards, 32 passing touchdowns, and eight interceptions to go along with 1,298 rushing yards and 20 rushing touchdowns. He finished second in the Heisman Trophy voting to Joe Burrow. Hurts' improvement at Oklahoma was further reflected in his rise from a questionable NFL prospect at Alabama to earning early-round NFL Draft projections following his sole season as a Sooner. Hurts completed his M.A. in human relations in May 2023. College statistics Professional career 2020 season The Philadelphia Eagles selected Hurts 53rd overall in the second round of the 2020 NFL draft. After originally being named the third-string quarterback behind Nate Sudfeld, he gained the backup position at Week 2, mainly so he could be used for quarterback runs"
  },
  {
    "chunk_id": "jalen_hurts_006",
    "doc_title": "jalen_hurts",
    "text": "2023. College statistics Professional career 2020 season The Philadelphia Eagles selected Hurts 53rd overall in the second round of the 2020 NFL draft. After originally being named the third-string quarterback behind Nate Sudfeld, he gained the backup position at Week 2, mainly so he could be used for quarterback runs or as a decoy. On December 6, 2020, Hurts relieved Carson Wentz, who was benched due to ineffective play, against the Green Bay Packers. In this Week 13 matchup, Hurts threw his career first passing touchdown to Greg Ward and finished with 109 passing yards with a touchdown and an interception in the 30–16 loss. On December 8, 2020, Hurts was named the starter for their Week 14 game against the New Orleans Saints. In his first NFL start, Hurts completed 17 of 30 passing attempts for 167 passing yards and one touchdown, leading the Eagles to a 24–21 win. Hurts also added 106 rushing yards, totaling 273 all purpose yards. On December 20, 2020, in Week 15 against the Arizona Cardinals, Hurts finished with 338 passing yards, three passing touchdowns, 63 rushing yards and one rushing touchdown in the 33–26 loss. In Week 16 against the Dallas Cowboys, Hurts threw for 342 yards, one touchdown, two interceptions, and rushed for 69 yards during the 37–17 loss. In Week 17 against the Washington Football Team on Sunday Night Football, Hurts threw for 72 yards and an interception and rushed for 34 yards and two touchdowns before being benched in favor of Sudfeld during the 20–14 loss. Hurts's benching drew allegations of Eagles head coach Doug Pederson attempting to deliberately lose the game; Pederson was fired shortly afterwards. 2021 season Before the start of the regular season, Hurts switched his jersey number to No. 1, which had become available with the"
  },
  {
    "chunk_id": "jalen_hurts_007",
    "doc_title": "jalen_hurts",
    "text": "of Sudfeld during the 20–14 loss. Hurts's benching drew allegations of Eagles head coach Doug Pederson attempting to deliberately lose the game; Pederson was fired shortly afterwards. 2021 season Before the start of the regular season, Hurts switched his jersey number to No. 1, which had become available with the departure of punter Cameron Johnston. On August 31, 2021, Hurts was named the starter for the regular season by new head coach Nick Sirianni. In the season opener against the Atlanta Falcons, Hurts led the Eagles to a 32–6 victory, throwing for three touchdowns and a passer rating of 126.4. Throughout the season, the Eagles would run the earliest versions of their Tush Push play, with Hurts being pushed from behind by fullback Jack Stoll in Week 5 against the Carolina Panthers for a rushing touchdown, and by tight end Dallas Goedert in Week 11 against the New Orleans Saints for a first down. During a Week 12 loss to the New York Giants, Hurts suffered an ankle injury which kept him out for the following week's game against the New York Jets. The Eagles won that game 33–18 led by backup quarterback Gardner Minshew. Hurts returned after the bye week in a Week 15 matchup against Washington en route to a 27–17 victory. Hurts helped lead the Eagles to a playoff berth after defeating the Washington Football Team 20–16 in Week 17 and with wins from the San Francisco 49ers and Packers later that day. On December 23, 2021, Hurts was named a 2021 Pro Bowl National Football Conference (NFC) alternate. In the 2021 season, Hurts finished with 3,144 passing yards, 16 passing touchdowns, and nine interceptions to go along with 139 carries for 784 rushing yards and ten rushing touchdowns. He led all quarterbacks in rushing yards and"
  },
  {
    "chunk_id": "jalen_hurts_008",
    "doc_title": "jalen_hurts",
    "text": "Hurts was named a 2021 Pro Bowl National Football Conference (NFC) alternate. In the 2021 season, Hurts finished with 3,144 passing yards, 16 passing touchdowns, and nine interceptions to go along with 139 carries for 784 rushing yards and ten rushing touchdowns. He led all quarterbacks in rushing yards and rushing touchdowns in the 2021 season. In the Wild Card Round against the Tampa Bay Buccaneers, Hurts threw for 258 yards and a touchdown, but he fumbled once and threw two interceptions in the 31–15 loss. 2022 season: NFL MVP runner-up and first Super Bowl appearance Hurts completed 22 of his 35 pass attempts for 340 yards and three touchdowns over the Washington Commanders in a 24–8 victory to improve to 3–0 on the season. For his performance, Hurts was named NFC Offensive Player of Month for September, becoming the first Eagles player to win the award since 2017. During Week 5 against the Arizona Cardinals, Hurts and the Eagles would use the Tush Push to successfully make five out of six first-down conversions, resulting in the play becoming the team's primary focus during short-yardage situations. After a 29–17 victory over the Houston Texans, Hurts became the first Eagles quarterback to lead the team to an 8–0 record. In Week 12, Hurts rushed for 157 yards and threw for 153 yards and two touchdowns in a 40–33 win over the Packers, earning NFC Offensive Player of the Week. He became the first player with 150+ rushing yards, 150+ passing yards and multiple passing touchdowns in a single game. In Week 13, Hurts threw 380 pass yards and four total touchdowns (three passing, one rushing) against the Tennessee Titans, becoming the first Eagles player with at least 350 pass yards, three passing touchdowns, and a rushing touchdown in the same game."
  },
  {
    "chunk_id": "jalen_hurts_009",
    "doc_title": "jalen_hurts",
    "text": "and multiple passing touchdowns in a single game. In Week 13, Hurts threw 380 pass yards and four total touchdowns (three passing, one rushing) against the Tennessee Titans, becoming the first Eagles player with at least 350 pass yards, three passing touchdowns, and a rushing touchdown in the same game. With a Week 14 win over the Giants, Hurts led the Eagles to a consecutive playoff berth. A day after the win over the Bears, it was revealed that Hurts sprained his throwing shoulder, ruling him out for the Eagles' Week 16 game against the Cowboys. Despite his injury, Hurts would help lead the Eagles to a 22–16 victory over the Giants in Week 18. Hurts finished the season with a starting record of 14–1, tying a franchise-best (with Randall Cunningham) 35 total touchdowns (22 passing, 13 rushing) to just six interceptions, 3,701 passing yards, and a 101.5 quarterback rating. As a result of his play in the 2022 season, Hurts was named to his first career Pro Bowl, and was a Second Team All-Pro. On January 25, 2023, Hurts was named as one of the five finalists for the NFL Most Valuable Player Award, where he would eventually finish second in voting. On January 21, 2023, Hurts led the Eagles to a 38–7 victory over the Giants in the Divisional Round of the 2022–23 NFL playoffs. In doing so, Hurts won his first playoff game, and later led the Eagles to a 31–7 win in the NFC Championship against the 49ers to advance to Super Bowl LVII and face the Kansas City Chiefs. In the game, Hurts threw for 304 yards and a touchdown, and rushed for 70 yards and scored three rushing touchdowns, the most rushing yards and rushing touchdowns by a quarterback in Super Bowl history. His"
  },
  {
    "chunk_id": "jalen_hurts_010",
    "doc_title": "jalen_hurts",
    "text": "the 49ers to advance to Super Bowl LVII and face the Kansas City Chiefs. In the game, Hurts threw for 304 yards and a touchdown, and rushed for 70 yards and scored three rushing touchdowns, the most rushing yards and rushing touchdowns by a quarterback in Super Bowl history. His three touchdowns and a two-point conversion also tied the record for most points scored in a Super Bowl with 20. However, Hurts also lost a fumble which was returned for a touchdown by Nick Bolton in the second quarter, and attempted a Hail Mary pass on the last play of the game which fell short as the Eagles lost to the Chiefs, 38–35. He was ranked third by his fellow players on the NFL Top 100 Players of 2023. 2023 season On April 17, 2023, Hurts signed a five-year contract extension for $255 million ($180 million guaranteed), making him the highest paid player in NFL history, although that was surpassed just 10 days later by Lamar Jackson's contract with the Baltimore Ravens. The deal also includes a no-trade clause, the first in Eagles history. In Week 8, Hurts threw for 319 yards and four touchdowns in a 38–31 win over the Washington Commanders, earning NFC Offensive Player of the Week. In a Week 9 game against the Cowboys, Hurts scored his 33rd career rushing touchdown, surpassing Randall Cunningham for the most by a quarterback in franchise history. In Week 12, Hurts achieved his 10th rushing touchdown for the season and finished with 265 total passing and rushing yards and five touchdowns in a 37–34 win over the Buffalo Bills. He became the first quarterback in NFL history to have three consecutive seasons with at least 10 rushing touchdowns each. In Week 16, in a game against the Giants, Hurts scored"
  },
  {
    "chunk_id": "jalen_hurts_011",
    "doc_title": "jalen_hurts",
    "text": "finished with 265 total passing and rushing yards and five touchdowns in a 37–34 win over the Buffalo Bills. He became the first quarterback in NFL history to have three consecutive seasons with at least 10 rushing touchdowns each. In Week 16, in a game against the Giants, Hurts scored his 15th rushing touchdown of the season, breaking the record for rushing touchdowns in a single season by a quarterback, which was previously set by Cam Newton in 2011. The following week, in a game against the Cardinals, Hurts scored his 36th total touchdown of the season with a throw to wide receiver Julio Jones, breaking the franchise record held by Randall Cunningham that Hurts had tied the season prior. In Week 18, Hurts suffered a dislocated middle finger against the Giants and was taken out of the game early. The following week, the Eagles lost 32–9 in the Wild Card round of the playoffs against the Buccaneers. He earned Pro Bowl honors for the 2023 season. Hurts ultimately finished the season with career highs in passing and rushing touchdowns, but also set career highs in interceptions and fumbles lost. Hurts was ranked 15th by his fellow players on the NFL Top 100 Players of 2024. 2024 season: Super Bowl MVP In his season debut, Hurts led the Eagles to a 34–29 victory over the Green Bay Packers in Brazil, completing 20 of 34 passes for 278 yards, two touchdowns, and two interceptions. After an 2–2 start to the season, where Hurts accumulated six touchdowns and seven turnovers, the following the bye week, Hurts led the Eagles to a 20–16 victory over the Cleveland Browns, passing for 264 yards, two touchdowns and no turnovers. In Week 8, Hurts guided the Eagles to a commanding 37–17 road win victory over the"
  },
  {
    "chunk_id": "jalen_hurts_012",
    "doc_title": "jalen_hurts",
    "text": "where Hurts accumulated six touchdowns and seven turnovers, the following the bye week, Hurts led the Eagles to a 20–16 victory over the Cleveland Browns, passing for 264 yards, two touchdowns and no turnovers. In Week 8, Hurts guided the Eagles to a commanding 37–17 road win victory over the Cincinnati Bengals, throwing for 236 yards scoring two one-yard rushing touchdowns and a passing touchdown. On November 10, Hurts accounted for four total touchdowns—two passing and two rushing—along with one interception in a 34–6 rout of the Cowboys. It marked the third time the Eagles scored over 30 points in a game and the second time they accomplished the feat against a division rival. In Week 14 against the Carolina Panthers, Hurts accounted for three total touchdowns—two passing and one rushing, helping the Eagles clinch their fourth consecutive playoff berth in a 22–16 win. The next week, Hurts threw for 290 yards, two touchdowns, and added a rushing score in a 27–13 win over the Pittsburgh Steelers, leading the Eagles to their first franchise 10-game win streak.On December 22, Hurts suffered a concussion against the Commanders in Week 16 in the first quarter and did not return, ending their win streak in the 36–33 loss as Kenny Pickett replaced him for the remainder of the game. He remained in concussion protocol and missed the final two games of the regular season, but he was cleared in time for the Eagles' Wild Card Game against the Packers. Hurts led the Eagles to a 22–10 win over the Packers in the Wild Card round. In the Divisional Round, Hurts helped the Eagles to a 28–22 victory. In the NFC Championship against the Commanders, Hurts tallied four touchdowns, zero turnovers, and directed the offense to a dominant 55–23 win, advancing to Super Bowl"
  },
  {
    "chunk_id": "jalen_hurts_013",
    "doc_title": "jalen_hurts",
    "text": "to a 22–10 win over the Packers in the Wild Card round. In the Divisional Round, Hurts helped the Eagles to a 28–22 victory. In the NFC Championship against the Commanders, Hurts tallied four touchdowns, zero turnovers, and directed the offense to a dominant 55–23 win, advancing to Super Bowl LIX. In Super Bowl LIX, Hurts threw for 221 yards with two touchdowns and an interception while also rushing for 72 yards and a touchdown in the 40–22 win against the Chiefs to avenge Philadelphia's loss two years earlier in Super Bowl LVII. He was named Super Bowl MVP for his performance, becoming the third Black quarterback to earn the honor and the fourth black starting quarterback to win a Super Bowl. Closing out the 2024 season, Hurts successfully led Philadelphia to the playoffs in all of his first four seasons as the primary starter, receiving two Pro Bowl selections in the process. He was ranked 19th by his fellow players on the NFL Top 100 Players of 2025. 2025 season Following their Super Bowl victory, Hurts and the Eagles made an appearance in the NFL Kickoff game, hosting the rival Dallas Cowboys. In the game, Hurts completed 19 passes out of 23 attempts for 152 yards, with no touchdowns or interceptions. He accompanied his passing performance with 14 carries for 62 yards and 2 touchdowns on the ground. Hurts led the Eagles to four consecutive wins to open their 2025 season with him recording a combined completion percentage of 79.9%, throwing for 609 yards and rushing for another 41. Hurts did not throw for a passing touchdown until Week 3's 33-26 victory over the Los Angeles Rams when he completed a 33 yard pass to tight end Dallas Goedert in the third quarter. He finished the game accounting for"
  },
  {
    "chunk_id": "jalen_hurts_014",
    "doc_title": "jalen_hurts",
    "text": "79.9%, throwing for 609 yards and rushing for another 41. Hurts did not throw for a passing touchdown until Week 3's 33-26 victory over the Los Angeles Rams when he completed a 33 yard pass to tight end Dallas Goedert in the third quarter. He finished the game accounting for four touchdowns total with one rushing and three passing. After back-to-back losses to the Denver Broncos and the New York Giants, Hurts had a bounce-back performance in Week 7 against the Minnesota Vikings, where he passed for 326 yards and 3 touchdowns with passer rating of 158.3, achieving the first game with a perfect passer rating in his professional career, becoming the third Eagles quarterback to do so. NFL career statistics Regular season Postseason Personal life Hurts's parents are Pamela and Averion Hurts. Hurts has two siblings: a younger sister, Kynnedy, and an older brother, Averion, named after their father. Averion was the starting quarterback for Texas Southern University. As of Hurts's freshman year, one of his parents attended his football game every week, while the other attended Averion's game. On June 14, 2025, Hurts married Bryonna \"Bry\" Rivera Burrows, his college sweetheart. Hurts is a Baptist. He has said, \"I keep God at the center of everything. I give Him all the praise, I lean on Him all the time. And I know that everything unfolds the way it’s supposed to.\" On June 20, 2022, Hurts filed for a trademark for the phrase \"HURTS SO GOOD.\" The trademark registry says that it will be used for a clothing line that includes \"men's, women's and children's clothing, namely shirts, jackets, sweatshirts, pants, shorts, vests, gloves, socks, sweaters, underwear, skirts, hats and belts.\" As of November 2024, the application is still under review by the U.S. Patent and Trademark Office. Hurts"
  },
  {
    "chunk_id": "jalen_hurts_015",
    "doc_title": "jalen_hurts",
    "text": "says that it will be used for a clothing line that includes \"men's, women's and children's clothing, namely shirts, jackets, sweatshirts, pants, shorts, vests, gloves, socks, sweaters, underwear, skirts, hats and belts.\" As of November 2024, the application is still under review by the U.S. Patent and Trademark Office. Hurts is an advocate for women in sports and employs an all-female management team, including his social media, marketing, communications, and sports agent team members. In 2021, Hurts honored female empowerment and women in sports when participating in the NFL's \"My Cause, My Cleats\" initiative. In 2023, the management team reached out to the producers of Abbott Elementary to express Hurts interest in making an appearance as 'he was a big fan' and Hurts and his teammates, Jason Kelce and Brandon Graham had their cameos during the one-hour season three premiere of the show. In 2022, Hurts provided vocals on the Christmas album A Philly Special Christmas. In 2025, Hurts was selected to the Time 100, a list of the 100 most influential people in the world. Hurts is the godfather of teammate A. J. Brown's daughter. References External links Career statistics from NFL.com · ESPN · CBS Sports · Yahoo Sports · Pro Football Reference Jalen Hurts on Twitter Philadelphia Eagles bio Oklahoma Sooners bio Alabama Crimson Tide bio"
  },
  {
    "chunk_id": "nick_sirianni_001",
    "doc_title": "nick_sirianni",
    "text": "Nicholas John Sirianni ( SEE-ree-AH-nee; born June 15, 1981) is an American professional football coach who is the head coach for the Philadelphia Eagles of the National Football League (NFL). He previously served as an assistant coach with the Kansas City Chiefs from 2009 to 2012, as an assistant coach with the San Diego/Los Angeles Chargers from 2013 to 2017, then as the offensive coordinator for the Indianapolis Colts from 2018 to 2020. Since his hiring as head coach for the Eagles, Sirianni has led the team to the playoffs in each of his first four seasons as head coach, including winning two division titles, two conference championships, and a victory in Super Bowl LIX in 2025. Early life and education Sirianni was born on June 15, 1981, in Jamestown, New York, the son of Fran and Amy Sirianni. Fran was a middle school science teacher and the former head football coach at Southwestern Central High School in West Ellicott, New York, where Nick graduated in 1999. He is of Italian descent through his father with roots in Calabria. Sirianni was raised Catholic, and grew up a fan of the Pittsburgh Steelers, owing to his family having roots in the Pittsburgh area. Sirianni played wide receiver at Division III Mount Union in Alliance, Ohio, winning national championships in 2000, 2001, and 2002. Though a calf injury and compartment syndrome nearly ended his playing career as a sophomore, Sirianni started for three years. As a senior in 2003, he had 998 yards and 13 touchdowns and graduated with a degree in education. Sirianni played one season for the Canton Legends of the American Indoor Football League. Career College coaching Sirianni began coaching as the defensive backs coach at Mount Union, his alma mater. After one season of coaching Mount Union, he"
  },
  {
    "chunk_id": "nick_sirianni_002",
    "doc_title": "nick_sirianni",
    "text": "yards and 13 touchdowns and graduated with a degree in education. Sirianni played one season for the Canton Legends of the American Indoor Football League. Career College coaching Sirianni began coaching as the defensive backs coach at Mount Union, his alma mater. After one season of coaching Mount Union, he was hired by Indiana University of Pennsylvania in Indiana, Pennsylvania, where he coached wide receivers for three seasons. Kansas City Chiefs In 2009, Sirianni was hired as offensive quality control coach for the Kansas City Chiefs by Todd Haley, the new head coach of the Chiefs. Sirianni and Haley got to know each other when they attended the same YMCA when Sirianni was in college and Haley was wide receivers coach for the Chicago Bears. Sirianni was retained under new coach Romeo Crennel and was promoted to wide receivers coach in Crennel's only season as the Chiefs head coach. Sirianni was not retained for the 2013 season under new head coach Andy Reid. San Diego Chargers Sirianni joined the San Diego Chargers when Mike McCoy was hired as the team's head coach in 2013. In 2014 he became the team's quarterbacks coach, working with quarterback Philip Rivers and offensive coordinator Frank Reich. In 2016, Sirianni became the wide receivers coach. Indianapolis Colts After Reich became the head coach of the Indianapolis Colts in 2018, he hired Sirianni as offensive coordinator. Sirianni developed a close relationship with Reich, though unlike some head coaches, Reich chose to call the team's plays rather than delegate the responsibility to Sirianni. During his three years as offensive coordinator with the Colts, Sirianni had a different starting quarterback each year, working with Andrew Luck, Jacoby Brissett, and Philip Rivers. The Colts made the playoffs twice and finished 10th, 19th, and 12th in offensive DVOA, a measure"
  },
  {
    "chunk_id": "nick_sirianni_003",
    "doc_title": "nick_sirianni",
    "text": "than delegate the responsibility to Sirianni. During his three years as offensive coordinator with the Colts, Sirianni had a different starting quarterback each year, working with Andrew Luck, Jacoby Brissett, and Philip Rivers. The Colts made the playoffs twice and finished 10th, 19th, and 12th in offensive DVOA, a measure of offensive success. Philadelphia Eagles On January 24, 2021, Sirianni was hired to become the head coach of the Philadelphia Eagles after the firing of Doug Pederson. Two months later, the Eagles traded quarterback Carson Wentz to the Colts, leaving former second-round pick Jalen Hurts as the presumed starter. Sirianni put together a staff of young coaches, including defensive coordinator Jonathan Gannon and offensive coordinator Shane Steichen, both of whom had previously worked with Sirianni. Although much of Pederson's staff was replaced, Sirianni retained veteran offensive line coach Jeff Stoutland. 2021 season On September 12, 2021, Sirianni made his regular-season head coaching debut against the Atlanta Falcons and led the Eagles to a 32–6 victory. Despite a 2–5 start, Sirianni finished his first season as head coach with a 9–8 record and a wild card berth. The Eagles lost in the Wild Card Round of the playoffs to the defending Super Bowl champion Tampa Bay Buccaneers 31–15. Sirianni was the only first-year coach to lead a team to the playoffs in the 2021 NFL season, and the third Eagles head coach to make the playoffs in their first year as head coach, joining Chip Kelly in 2013 and Ray Rhodes in 1995. 2022 season: Super Bowl LVII run The 2022 Eagles compiled a 14–3 record in the regular season, earning the NFC East division championship and a first-round bye in the playoffs. The Eagles became the first team since the 1989 Minnesota Vikings to record at least 70 sacks, led"
  },
  {
    "chunk_id": "nick_sirianni_004",
    "doc_title": "nick_sirianni",
    "text": "in 1995. 2022 season: Super Bowl LVII run The 2022 Eagles compiled a 14–3 record in the regular season, earning the NFC East division championship and a first-round bye in the playoffs. The Eagles became the first team since the 1989 Minnesota Vikings to record at least 70 sacks, led the league in fewest passing yards allowed, and set a franchise record for wins and points scored in a season. One notable sideline incident occurred during a Week 11 away matchup against the Indianapolis Colts, where Sirianni had previously served as an offensive coordinator. After the Eagles defeated the Colts 17–16, Sirianni turned to a group of Eagles fans that had travelled to Lucas Oil Stadium and shouted that the win \"was for Frank Reich\", the coach who mentored him and who was fired as head coach of the Colts earlier that month. In the playoffs, Sirianni led the Eagles to their fourth Super Bowl in franchise history after a 38–7 Divisional Round playoff victory over the New York Giants and a 31–7 NFC Championship victory over the San Francisco 49ers. The Eagles lost to the Kansas City Chiefs in Super Bowl LVII 38–35. 2023 season During the 2023 NFL offseason, Sirianni lost both offensive coordinator Shane Steichen and defensive coordinator Jonathan Gannon, both of whom received head coaching jobs with the Indianapolis Colts and Arizona Cardinals, respectively. The 2023 Eagles once again compiled a 10–1 regular season record to start the season, but experienced a late season slide and finished with a 1–5 record and ultimately lost out on the NFC East Division title and the #2 seed in the NFC playoffs to the Dallas Cowboys in the last week of the season. Sirianni became the first head coach in NFL history to experience a 1–5 record to end"
  },
  {
    "chunk_id": "nick_sirianni_005",
    "doc_title": "nick_sirianni",
    "text": "finished with a 1–5 record and ultimately lost out on the NFC East Division title and the #2 seed in the NFC playoffs to the Dallas Cowboys in the last week of the season. Sirianni became the first head coach in NFL history to experience a 1–5 record to end the season and make the playoffs. The Eagles were ultimately eliminated by the Tampa Bay Buccaneers in the Wild Card Round of the 2023 NFL Playoffs. Sirianni was widely blamed for both the offensive and defensive regression of the Eagles in 2023. In particular, Sirianni caused a significant controversy when he removed defensive coordinator Sean Desai from defensive play calling and passed them onto former New England Patriots defensive coordinator and Detroit Lions head coach Matt Patricia, a move that ultimately backfired and led the Eagles to finish second to last in total defense. Sirianni ultimately fired Desai, Patricia, and offensive coordinator Brian Johnson after the 2023 season ended. 2024 season: Super Bowl LIX victory During Week 2 of the 2024 season against the Atlanta Falcons Sirianni was widely criticized for throwing the ball on 3rd and 3 at the Atlanta 10-yard line up 18–15, where the pass fell incomplete, giving Atlanta time to march down the field and secure the victory. During week 3, despite a 15–12 victory over the New Orleans Saints, Sirianni still received criticism for his fourth down aggression. After a week 6 home victory over the Cleveland Browns, Sirianni drew criticism for having a shouting match against the Eagles' fans in attendance behind the team's sideline. While the Eagles were on the field in victory formation, TV cameras showed that Sirianni walked behind the bench, put an index finger to his right ear then shouted words that could not be heard from afar but were"
  },
  {
    "chunk_id": "nick_sirianni_006",
    "doc_title": "nick_sirianni",
    "text": "match against the Eagles' fans in attendance behind the team's sideline. While the Eagles were on the field in victory formation, TV cameras showed that Sirianni walked behind the bench, put an index finger to his right ear then shouted words that could not be heard from afar but were interpreted as, \"I can't hear you.\" Sirianni refused to go into any detail on what precipitated his post-game antics. Despite early struggles and a 2–2 start, Sirianni coached the Eagles to a 14–3 regular season record and an NFC East title, finishing as the No. 2 seed in the conference. Propelled by the 2024 addition of running back Saquon Barkley and an astounding defensive turnaround from the prior season under the leadership of defensive coordinator Vic Fangio, the Eagles secured a Wild Card Round victory over the Green Bay Packers and a Divisional Round victory over the Los Angeles Rams. For the second time in his career, Sirianni won the NFC Championship against the Washington Commanders 55–23, in which the Eagles broke an NFL record for the most points ever scored in a conference championship game en route to Super Bowl LIX. In a Super Bowl rematch against the Kansas City Chiefs, the Eagles won handily, 40–22, winning Sirianni his first Super Bowl title as a head coach. Closing out the 2024 season, Sirianni bested a 70% win percentage over his first four seasons as an NFL head coach with the Eagles, the highest career win percentage of any active NFL head coach at the time. 2025 season On May 19, 2025, Sirianni and the Eagles agreed to a multiyear contract extension. Head coaching record Coaching tree Sirianni has served under seven head coaches: Larry Kehres, Mount Union (2004–2005) Lou Tepper, IUP (2006–2008) Todd Haley, Kansas City Chiefs (2009–2011) Romeo"
  },
  {
    "chunk_id": "nick_sirianni_007",
    "doc_title": "nick_sirianni",
    "text": "NFL head coach at the time. 2025 season On May 19, 2025, Sirianni and the Eagles agreed to a multiyear contract extension. Head coaching record Coaching tree Sirianni has served under seven head coaches: Larry Kehres, Mount Union (2004–2005) Lou Tepper, IUP (2006–2008) Todd Haley, Kansas City Chiefs (2009–2011) Romeo Crennel, Kansas City Chiefs (2011–2012) Mike McCoy, San Diego Chargers (2013–2016) Anthony Lynn, Los Angeles Chargers (2017) Frank Reich, Indianapolis Colts (2018–2020) Three of Sirianni's coaching assistants have become head coaches in the NFL: Jonathan Gannon, Arizona Cardinals (2023–present) Shane Steichen, Indianapolis Colts (2023–present) Kellen Moore, New Orleans Saints (2025–present) Personal life Sirianni is married to Brett Ashley Sirianni with whom he has three children; the two met when Nick was working for the Kansas City Chiefs. His father, Fran, and his brother Jay are both former head coaches of Southwestern Central High School, and his brother Mike Sirianni is the head coach at Washington & Jefferson College in Washington, Pennsylvania. References External links Coaching statistics at Pro Football Reference Philadelphia Eagles profile"
  },
  {
    "chunk_id": "philadelphia_eagles_001",
    "doc_title": "philadelphia_eagles",
    "text": "The Philadelphia Eagles are a professional American football team based in Philadelphia. The Eagles compete in the National Football League (NFL) as a member of the National Football Conference (NFC) East division. The team plays its home games at Lincoln Financial Field in the South Philadelphia Sports Complex. The franchise was established in 1933 as a replacement for the bankrupt Frankford Yellow Jackets when a group led by Bert Bell secured the rights to an NFL franchise in Philadelphia. Since their formation, the Eagles have appeared in the playoffs 31 times, won 16 division titles (including 13 in the NFC East), appeared in four pre-merger NFL Championship Games, winning three of them (1948, 1949, and 1960), and appeared in five Super Bowls, winning Super Bowls LII and LIX. The Philadelphia Eagles rank among the best teams in the NFL for attendance and have sold out every home game continuously since the 1999 season. The Eagles are owned by Jeffrey Lurie, who bought the team in 1994 for $185 million. In December 2024, the Eagles became one of the first teams in the NFL to sell an ownership stake to outside investors. The deal sold 8% of the franchise at a valuation of $8.3 billion. History NFL in Philadelphia (1899–1931) The Frankford Athletic Association was organized in May 1899 in the parlor of the Suburban Club. The cost of purchasing a share in the association was $10. However, there also were contributing memberships, ranging from $1 to $2.50, made available to the general public. The Association was a community-based non-profit organization of local residents and businesses. In keeping with its charter, which stated that \"all profits shall be donated to charity\", all of the team's excess income was donated to local charitable institutions. The original Frankford Athletic Association apparently disbanded prior"
  },
  {
    "chunk_id": "philadelphia_eagles_002",
    "doc_title": "philadelphia_eagles",
    "text": "the general public. The Association was a community-based non-profit organization of local residents and businesses. In keeping with its charter, which stated that \"all profits shall be donated to charity\", all of the team's excess income was donated to local charitable institutions. The original Frankford Athletic Association apparently disbanded prior to the 1909 football season. Several of the original players from the 1899 football team kept the team together, and they became known as Loyola Athletic Club. In keeping with Yellow Jackets tradition, they carried the \"Frankford\" name again in 1912, to become the Frankford Athletic Association. In the early 1920s, the Frankford Athletic Association's Yellow Jackets gained a reputation as being one of the best independent football teams in the nation. In 1922, Frankford absorbed the Philadelphia City Champion team, the Union Quakers of Philadelphia. That year, Frankford captured the unofficial championship of Philadelphia. During the 1922 and 1923 seasons, the Yellow Jackets compiled a 6–2–1 record against teams from the National Football League. This led to the Association being granted an NFL franchise in 1924, thus becoming the Frankford Yellow Jackets. In spite of winning the NFL championship in 1926, midway through the 1931 season, the Yellow Jackets went bankrupt and were forced to cease operations. Bell and Wray era (1933–1940) After more than a year of searching for a suitable replacement for the Yellow Jackets in the lucrative Philadelphia market, the National Football League granted an expansion franchise to an ownership group headed by Bert Bell and Lud Wray, who were also awarded the liquidated assets of the defunct Yellow Jackets organization. The Bell–Wray group had to pay an entry fee of $3,500, or roughly US$67,000 in inflation-adjusted 2022 dollars and assumed a total debt of $11,000 the Yellow Jackets owed to three other NFL franchises. Drawing"
  },
  {
    "chunk_id": "philadelphia_eagles_003",
    "doc_title": "philadelphia_eagles",
    "text": "Lud Wray, who were also awarded the liquidated assets of the defunct Yellow Jackets organization. The Bell–Wray group had to pay an entry fee of $3,500, or roughly US$67,000 in inflation-adjusted 2022 dollars and assumed a total debt of $11,000 the Yellow Jackets owed to three other NFL franchises. Drawing inspiration from the Blue Eagle logo of the National Recovery Administration, a centerpiece of President Franklin D. Roosevelt's New Deal policies, Bell and Wray named their new franchise the Philadelphia Eagles. While it could seem as if the Yellow Jackets simply rebranded as the Eagles, both the Eagles organization and the NFL officially regard the teams as two separate entities. Not only was there no Philadelphia NFL team for a season and a half, but almost no players from the 1931 Yellow Jackets appeared on the Eagles' first roster. In the 1933 NFL season, the Eagles were one of three teams, along with the Pittsburgh Pirates (now the Pittsburgh Steelers) and the now-defunct Cincinnati Reds, to join the NFL as expansion teams. Wray became the Eagles' first head coach after being persuaded to assume the position by Bell, his former teammate at Penn. The Eagles originally intended to play their home games at Shibe Park, which was the home of the Philadelphia Athletics professional baseball in Philadelphia. When negotiations for the use of Shibe Park fell through, however, the Eagles struck a deal with the Athletics' crosstown rival, the Philadelphia Phillies, to begin playing at the Baker Bowl. The Eagles played their first game on October 15, 1933, against the New York Giants at the Polo Grounds in New York City, and lost the game 56–0. The Eagles struggled over the course of their first decade, never winning more than four games in any of their first ten seasons. Their"
  },
  {
    "chunk_id": "philadelphia_eagles_004",
    "doc_title": "philadelphia_eagles",
    "text": "played their first game on October 15, 1933, against the New York Giants at the Polo Grounds in New York City, and lost the game 56–0. The Eagles struggled over the course of their first decade, never winning more than four games in any of their first ten seasons. Their best finish was in 1934, the second season for the Eagles, when they tied for third in the East. The Eagles' early rosters largely consisted of former Penn, Temple, and Villanova players who played for the Eagles for a few years before going on to other things. In 1935, Bell proposed an annual college draft to equalize talent across the league. The draft was a revolutionary concept in professional sports. Having teams select players in inverse order of their finish in the standings, a practice still followed today, strove to increase fan interest by guaranteeing that even the worst teams would have the opportunity for annual infusions of the best college talent. Between 1927, when the NFL changed from a sprawling Midwestern-based association to a narrower, major-market league, and 1934, three teams, the Chicago Bears, New York Giants, and Green Bay Packers, won all but one title with the exception of the Providence Steam Roller, which won in 1928. By 1936, the Eagles suffered significant financial losses and were sold through a public auction. Bert Bell was the only bidder and became the sole owner of the team. Wray refused a reduction in his salary and left the team. Bell assumed the head coaching position and led the team to a record of 1–11, last place in the league. From 1936 to 1939, the Eagles played at Municipal Stadium in South Philadelphia. In 1940, Bell balked at a 66% rent increase plus 10% of the gate receipts proposed by the"
  },
  {
    "chunk_id": "philadelphia_eagles_005",
    "doc_title": "philadelphia_eagles",
    "text": "assumed the head coaching position and led the team to a record of 1–11, last place in the league. From 1936 to 1939, the Eagles played at Municipal Stadium in South Philadelphia. In 1940, Bell balked at a 66% rent increase plus 10% of the gate receipts proposed by the City of Philadelphia for the use of Municipal Stadium and signed a lease for Shibe Park, which was renamed Connie Mack Stadium in 1954. At Connie Mack Stadium, the Eagles were also able to play night games, since lights were installed at the stadium the year before. In the 1941 season, the Eagles played their home opener at Municipal Stadium, and then moved to Shibe Park. To accommodate football at Shibe Park during the winter, management erected stands in right field, parallel to 20th Street. Some 20 feet high, these east stands included 22 rows of seats. The goalposts stood along the first base line and in left field. The uncovered east stands enlarged the park's capacity to over 39,000, but the Eagles rarely drew more than 25,000 to 30,000. The Eagles finished the 1937 season 2–8–1 and continued to struggle over the next three seasons. Thompson, Wolman and the Happy Hundred era (1941–1969) In December 1940, Bell intervened to stop the sale of Art Rooney's Steelers to Alexis Thompson, and Rooney then acquired half of Bell's interest in the Eagles. In a series of events known as the Pennsylvania Polka, Rooney and Bell exchanged their entire Eagles roster and their territorial rights in Philadelphia to Thompson for his entire Steelers roster and his rights in Pittsburgh. Rooney provided assistance to Bell by rewarding him with a 20% commission on the sale of the Steelers. Bell became the Steelers' head coach and Rooney became the Steelers' general manager. Greasy Neale"
  },
  {
    "chunk_id": "philadelphia_eagles_006",
    "doc_title": "philadelphia_eagles",
    "text": "their territorial rights in Philadelphia to Thompson for his entire Steelers roster and his rights in Pittsburgh. Rooney provided assistance to Bell by rewarding him with a 20% commission on the sale of the Steelers. Bell became the Steelers' head coach and Rooney became the Steelers' general manager. Greasy Neale years (1941–1950) After assuming ownership, Thompson promptly hired Greasy Neale as the team's head coach. During the first years under Neale, the Eagles' struggles continued, and they finished the 1941 season with a 2–8–1 record. In the 1942 season, there was no improvement as the team finished the season 2–9. Steagles (1943) In 1943, with player shortages stemming from the U.S. entry engagement in World War II, it became difficult to fill the roster, and the team merged with the Steelers to form the \"Phil-Pitt Combine\", known as the Steagles. Greasy Neale continued to coach the team along with Steelers head coach Walt Kiesling. The team finished the 1943 season with a 5–4–1 record, and the merger, which was never intended to be a permanent arrangement, was dissolved at the season's end. In 1944, the Eagles, led by head coach Greasy Neale and running back Steve Van Buren, had their first winning season in team history. After two second-place finishes in 1945 and 1946, the team reached the NFL Championship game for the first time in 1947. Van Buren, Pete Pihos, and Bosh Pritchard fought valiantly, but the young team lost to the Chicago Cardinals, 28–21 at Comiskey Park in Chicago. NFL champions (1948) Undeterred, the young team rebounded in 1948 to return to the NFL Championship game. With home-field advantage and a blinding snowstorm on their side, the Eagles won their first NFL Championship against the Chicago Cardinals by a score of 7–0. The only score came in the"
  },
  {
    "chunk_id": "philadelphia_eagles_007",
    "doc_title": "philadelphia_eagles",
    "text": "Chicago. NFL champions (1948) Undeterred, the young team rebounded in 1948 to return to the NFL Championship game. With home-field advantage and a blinding snowstorm on their side, the Eagles won their first NFL Championship against the Chicago Cardinals by a score of 7–0. The only score came in the fourth quarter when Steve Van Buren ran for a five-yard touchdown. Because of the severe weather, few fans witnessed the joyous occasion. Prior to the start of the 1949 season, the Eagles were sold by Thompson to a syndicate of 100 buyers, known as the \"Happy Hundred\", each of whom paid $3,000 for a share of the team. While the leader of the \"Happy Hundred\" was noted Philadelphia businessman James P. Clark, one unsung investor was Leonard Tose. NFL champions (1949) In 1949, the Eagles returned to the NFL Championship game for a third consecutive year. The Eagles were favored by a touchdown, and won 14–0 for their second consecutive title game shutout. Running back Steve Van Buren rushed for 196 yards on 31 carries for the Eagles, and their defense held the Rams to just 21 yards on the ground. Chuck Bednarik was selected as the first overall pick in the 1949 NFL draft. An All-American lineman/linebacker from the University of Pennsylvania, Bednarik would go on to become one of the greatest and most beloved players in Eagles history. In 1950, the Eagles opened the season against the AAFC champion Cleveland Browns, who, along with two other AAFC franchises, had just joined the NFL. The Eagles were expected to make short work of the Browns, who were widely considered the dominant team in a lesser league. However, the Browns lit up the Eagles' vaunted defense for 487 total yards, including 246 passing yards, in a 35–10 rout. The Eagles"
  },
  {
    "chunk_id": "philadelphia_eagles_008",
    "doc_title": "philadelphia_eagles",
    "text": "had just joined the NFL. The Eagles were expected to make short work of the Browns, who were widely considered the dominant team in a lesser league. However, the Browns lit up the Eagles' vaunted defense for 487 total yards, including 246 passing yards, in a 35–10 rout. The Eagles never recovered from the loss and finished the 1950 season 6–6. Following the 1950 season, Greasy Neale retired and was replaced by Bo McMillin. Two games into the 1951 season, McMillin was forced to retire following a diagnosis of terminal stomach cancer. Wayne Millner finished out the season before being replaced by Jim Trimble. While the remnants of the great 1940s teams managed to stay competitive for the first few years of the decade, and younger players like Bobby Walston and Sonny Jurgensen occasionally provided infusions of talent, the team lacked the total talent necessary for true greatness during most of the 1950s. After the 1957 season, the Eagles moved from Connie Mack Stadium to Franklin Field at the University of Pennsylvania. Franklin Field had a vastly expanded seating capacity for the Eagles. While Connie Mack Stadium had a capacity of 39,000, Franklin Field's capacity was 60,000. In 1969, the grass field at Franklin Field was replaced by AstroTurf, making Franklin Field the first NFL stadium to use artificial turf. Buck Shaw years (1958–1960) In 1958, the Eagles took several steps to improve, hiring Buck Shaw as head coach and acquiring quarterback Norm Van Brocklin in a trade with the Los Angeles Rams. During the 1959 season, the team showed flashes of talent, and finished in second place in the Eastern Division. Former Eagles owner and co-founder Bert Bell had become NFL commissioner, and attended the Eagles game on October 11 at Franklin Field against the Pittsburgh Steelers, a team"
  },
  {
    "chunk_id": "philadelphia_eagles_009",
    "doc_title": "philadelphia_eagles",
    "text": "Los Angeles Rams. During the 1959 season, the team showed flashes of talent, and finished in second place in the Eastern Division. Former Eagles owner and co-founder Bert Bell had become NFL commissioner, and attended the Eagles game on October 11 at Franklin Field against the Pittsburgh Steelers, a team Bell used to own. Bell refused the box seats that the Eagles reserved for him and purchased his own tickets to sit with the fans. During the fourth quarter, while sitting behind the end zone, Bell suffered a heart attack and died later that day. NFL champions (1960) The Eagles' 1960 season remains one of the most celebrated years in team history. Shaw, Van Brocklin, and Bednarik, each in their last season before retirement, led an Eagles team more notable for its grit than its talent. One observer later quipped that the team had \"nothing but a championship\" to its first division title since 1949. The team was aided by their two Pro Bowl receivers, wide receiver Tommy McDonald, who later wrote an autobiography titled They Pay Me to Catch Footballs, and tight end Pete Retzlaff. On November 20, 1960, at Yankee Stadium in The Bronx, Bednarik launched a tackle against New York Giants' running back Frank Gifford, which has come to be known as The Hit, a tackle that is routinely ranked as one of the hardest and most vicious hits in NFL history. With the game tied 10 to 10 in the fourth quarter, Gifford caught a short pass over the middle and was immediately hit by Bednarik with a clothesline tackle so hard that it dropped Gifford to the ground unconscious. Gifford was removed from the field on a stretcher and transported to a local hospital by ambulance, where he remained for ten days. Gifford was diagnosed"
  },
  {
    "chunk_id": "philadelphia_eagles_010",
    "doc_title": "philadelphia_eagles",
    "text": "pass over the middle and was immediately hit by Bednarik with a clothesline tackle so hard that it dropped Gifford to the ground unconscious. Gifford was removed from the field on a stretcher and transported to a local hospital by ambulance, where he remained for ten days. Gifford was diagnosed with a deep concussion that resulted in his retirement from the game for 18 months. On the 100th anniversary of the NFL's founding, the NFL ranked Bednarik's tackle the 44th greatest play in league history. On December 26, 1960, one of the coldest days in recorded Philadelphia history, the Eagles faced Vince Lombardi's Green Bay Packers in the 1960 NFL Championship Game and dealt the formidable Lombardi the sole championship game loss of his storied career. Bednarik lined up at center on offense and at linebacker on defense. Fittingly, the game ended as Bednarik tackled a struggling Jim Taylor and refused to allow him to stand until the last seconds had ticked away. Van Brocklin came to Philadelphia and agreed to play through 1960 with an understanding that, upon his retirement as a player, he would succeed Shaw as head coach. Ownership, however, opted to promote assistant coach Nick Skorich instead, and Van Brocklin quit the organization in a fit of pique, instead becoming head coach of the expansion Minnesota Vikings. Back-up quarterback Sonny Jurgensen became the Eagles' starter for the 1961 season; they finished a half-game behind the New York Giants for first place in the Eastern Conference standings with a 10–4 record. Despite the on-the-field success, however, the franchise was in turmoil. The 1962 team, decimated by injury, managed only three wins and were embarrassed at home in a 49–0 loss to the Packers. The off-field chaos continued through 1963, as the 65 shareholders remaining from the original"
  },
  {
    "chunk_id": "philadelphia_eagles_011",
    "doc_title": "philadelphia_eagles",
    "text": "with a 10–4 record. Despite the on-the-field success, however, the franchise was in turmoil. The 1962 team, decimated by injury, managed only three wins and were embarrassed at home in a 49–0 loss to the Packers. The off-field chaos continued through 1963, as the 65 shareholders remaining from the original Happy Hundred sold the team to Jerry Wolman, a 36-year-old millionaire Washington developer who outbid local bidders for the team, paying an unprecedented $5.505 million for control of the club. In 1964, Wolman hired former Cardinals and Washington Redskins coach Joe Kuharich to a 15-year contract. Over the next five seasons, the team failed to make the playoffs and the failures of the team over this period were highlighted by the Santa Claus incident, when fans pelted a Santa Claus with snowballs during a halftime Christmas pageant. The team had only one winning season, in 1966, finishing second in the NFL Eastern Conference. The Eagles lost to the Baltimore Colts 20–14, in the post-season's third place consolation game, the Playoff Bowl, which was held at the Orange Bowl in Miami. The Eagles finished 6–7–1 in 1967. In the following season, the Eagles fell even further in the standings, recording a 2–12 record in 1968. Leonard Tose era (1969–1984) In 1969, Leonard Tose bought the team from Wolman for $16.155 million, the equivalent of $139 million today, representing a record then for the highest amount ever paid for a professional sports franchise. Tose's first official act was to fire Coach Joe Kuharich after a disappointing 24–41–1 record during his five-year reign. Tose then named former Eagles wide receiver Pete Retzlaff as the team's general manager and Jerry Williams as its new head coach. With the merger of the NFL and AFL in 1970, the Eagles were placed in the NFC East"
  },
  {
    "chunk_id": "philadelphia_eagles_012",
    "doc_title": "philadelphia_eagles",
    "text": "Kuharich after a disappointing 24–41–1 record during his five-year reign. Tose then named former Eagles wide receiver Pete Retzlaff as the team's general manager and Jerry Williams as its new head coach. With the merger of the NFL and AFL in 1970, the Eagles were placed in the NFC East Division with the New York Giants, Washington Redskins, and Dallas Cowboys. The Eagles' heated rivalry with the Giants is the oldest of the NFC East rivalries, dating back to 1933, and is often cited as one of the best rivalries in the NFL. 1970 was also the last season for the Eagles at Franklin Field; the team finished the first post-merger season in last place in their division at 3–10–1. In 1971, the Eagles moved to Veterans Stadium, which had just been constructed and was initially acclaimed as a triumph of ultra-modern sports engineering. After a 3–10–1 record in 1970 and three consecutive blowout losses to Cincinnati, Dallas, and San Francisco to open the 1971 season, Williams was fired and replaced by assistant coach Ed Khayat, a defensive lineman on the Eagles' 1960 NFL championship team. Williams and Khayat were hampered by Retzlaff's decision to trade longtime starting quarterback Norm Snead to the Minnesota Vikings in early 1971, leaving the Eagles a choice between journeyman Pete Liske and raw Rick Arrington. Khayat lost his first two games but won six of the season's last nine, thanks largely to the efforts of the Eagles' defense, led by all-pro safety Bill Bradley, who led the NFL in interceptions (11) and interception return yardage (248). The team regressed in 1972 to finish 2–11–1, and Khayat was released. The two wins (both on the road) proved to be surprises, however. Philadelphia beat the Kansas City Chiefs (which had had the best record in the"
  },
  {
    "chunk_id": "philadelphia_eagles_013",
    "doc_title": "philadelphia_eagles",
    "text": "who led the NFL in interceptions (11) and interception return yardage (248). The team regressed in 1972 to finish 2–11–1, and Khayat was released. The two wins (both on the road) proved to be surprises, however. Philadelphia beat the Kansas City Chiefs (which had had the best record in the AFC a year before) 21–20 and the Houston Oilers 18–17 on six field goals by kicker Tom Dempsey. The latter game had been called the \"Johnny Rodgers Bowl\", because the loser, in finishing last in the league, would gain the first overall pick in the 1973 NFL draft, which was then presumed to be Nebraska wingback Johnny Rodgers, the Heisman Trophy winner. With their loss, the Oilers got first pick and took University of Tampa defensive end John Matuszak, who later faced Philadelphia in Super Bowl XV. With the second overall pick, the Eagles selected USC tight end Charle Young. Khayat was replaced by offensive guru Mike McCormack for the 1973 season. Aided by the skills of quarterback Roman Gabriel and towering young wide receiver Harold Carmichael, they managed to infuse a bit of vitality into a previously moribund offense. New general manager Jim Murray also began to add talent on the defensive side of the line, most notably through the addition of future Pro Bowl linebacker Bill Bergey in 1974. Overall, however, the team was still mired in mediocrity. McCormack was fired after a 4–10 1975 season. Dick Vermeil years (1976–1982) In 1976, Dick Vermeil was hired from UCLA to coach the struggling Eagles, who had managed only one winning season from 1962 to 1975. Vermeil faced numerous obstacles as he attempted to rejuvenate a franchise that had not seriously contended in well over a decade. Despite the team's young talent and Gabriel's occasional flashes of brilliance, the Eagles"
  },
  {
    "chunk_id": "philadelphia_eagles_014",
    "doc_title": "philadelphia_eagles",
    "text": "to coach the struggling Eagles, who had managed only one winning season from 1962 to 1975. Vermeil faced numerous obstacles as he attempted to rejuvenate a franchise that had not seriously contended in well over a decade. Despite the team's young talent and Gabriel's occasional flashes of brilliance, the Eagles finished 1976 with the same 4–10 record as in 1975. In 1977, the first seeds of hope began to emerge. The team obtained hard-throwing quarterback Ron Jaworski in a trade from the Los Angeles Rams in exchange for popular tight end Charle Young. The defense, led by Bergey and defensive coordinator Marion Campbell, began earning a reputation as one of the hardest-hitting in the league. 1978 saw one of the great moments in Eagles history, The Miracle at the Meadowlands, when Herman Edwards returned a fumble by Giants' quarterback Joe Pisarcik for a touchdown with 20 seconds left in the game, resulting in a 19–17 Eagles victory. The Eagles would edge into the playoffs with a 9–7 season. Young running back Wilbert Montgomery became the first Eagle since Steve Van Buren to exceed 1,000 yards in a season. In 1979, the Eagles tied for first place with an 11–5 record, as Montgomery shattered team rushing records with a total of 1,512 yards. In 1980, the team dominated the NFC, facing its chief nemesis, the Dallas Cowboys, in the NFC Championship Game. The game was played in cold conditions before faithful fans at Veterans Stadium. Led by an outstanding rushing performance by Montgomery, whose long cutback TD run in the first half is one of the most memorable in Eagles history, and a gutsy game from fullback Leroy Harris, who scored the Eagles' only other TD that day, the Birds earned a berth in Super Bowl XV with a 20–7 victory."
  },
  {
    "chunk_id": "philadelphia_eagles_015",
    "doc_title": "philadelphia_eagles",
    "text": "by Montgomery, whose long cutback TD run in the first half is one of the most memorable in Eagles history, and a gutsy game from fullback Leroy Harris, who scored the Eagles' only other TD that day, the Birds earned a berth in Super Bowl XV with a 20–7 victory. The Eagles traveled to New Orleans for Super Bowl XV, where they were heavily favored over the Oakland Raiders, who had squeaked into the playoffs as a wild-card team. Things did not go the Eagles' way, beginning with Tose's imprudent decision to bring comedian Don Rickles into the pregame locker room to lighten the mood. Jaworski's first pass was intercepted by Rod Martin, setting up an Oakland touchdown. Later in the first quarter, a potential game-tying 40-yard touchdown pass to Rodney Parker was nullified by an illegal-motion penalty. The final score was 27–10. Journeyman quarterback Jim Plunkett was named the game's MVP. The team got off to a promising start in the 1981 season by winning their first six games. They ended up 10–6 to earn a wild-card berth. However, their hopes to repeat as NFC champs were dashed in the wild-card round by the New York Giants, who won 27–21. After the Eagles finished 3–6 in the strike-shortened 1982 season, Vermeil quit the team, citing \"burnout\". Defensive coordinator Marion Campbell replaced Vermeil as head coach. Campbell had helped to popularize the \"bend-don't-break\" defensive strategy in the 1970s. Philadelphia struggled through the mid-1980s, marked by flagging fan participation. The team failed to make the playoffs in 1983 and 1984. The team nearly moved to Phoenix, Arizona at the end of the 1984 season. Norman Braman era (1985–1993) In 1985, Tose was forced to sell the Eagles to Norman Braman and Ed Leibowitz, highly successful automobile dealers from Florida, for a"
  },
  {
    "chunk_id": "philadelphia_eagles_016",
    "doc_title": "philadelphia_eagles",
    "text": "failed to make the playoffs in 1983 and 1984. The team nearly moved to Phoenix, Arizona at the end of the 1984 season. Norman Braman era (1985–1993) In 1985, Tose was forced to sell the Eagles to Norman Braman and Ed Leibowitz, highly successful automobile dealers from Florida, for a reported $65 million (equal to $190 million today) to pay off his more than $25 million ($73 million today) in gambling debts at Atlantic City casinos. The team again struggled during the 1985 season, and Campbell was fired after week 16, to be replaced by assistant head coach/defensive backs coach Fred Bruney for the season's last game. In the 1985 Supplemental draft, the Eagles acquired the rights to the Memphis Showboats' elite pass rusher Reggie White. Buddy Ryan years (1986–1990) In 1986, the arrival of head coach Buddy Ryan and his fiery attitude sparked team performance and ignited the fan base. Immediately infusing the team with his hard-as-nails attitude, the Eagles quickly became known for their tough defense and tougher attitudes. Ryan began rejuvenating the team by releasing several aging players, including Ron Jaworski. Randall Cunningham took his place and, despite a 5–10–1 season, began showing considerable promise. 1987 saw another strike, which shortened the season by one game. The substitutes who had filled in for the strikers performed poorly and were crushed 41–22 by the Dallas Cowboys. After the strike, the regular Eagles' 1987 team won a 37–20 revenge game against Dallas. The season record was 7–8, of which three games had been played by substitutes. The Eagles reached the playoffs in 1988, but lost to the Chicago Bears, the team that Ryan had helped lead to a Super Bowl XX victory as defensive coordinator. The game became known as the \"Fog Bowl\", due to the inclement weather during"
  },
  {
    "chunk_id": "philadelphia_eagles_017",
    "doc_title": "philadelphia_eagles",
    "text": "three games had been played by substitutes. The Eagles reached the playoffs in 1988, but lost to the Chicago Bears, the team that Ryan had helped lead to a Super Bowl XX victory as defensive coordinator. The game became known as the \"Fog Bowl\", due to the inclement weather during the game. The Eagles lost, 20–12. The following two years would see playoff appearances as well, but the team never made it past the first round. This failure was very frustrating to Eagles fans, as the team was widely regarded as among the most talented in the NFL. On offense, the Eagles were led by quarterback Cunningham, one of the most exciting players of his generation; tight end Keith Jackson; and running back Keith Byars. The defense is commonly acknowledged as among the greatest in league history, and as the best to never win a championship. The two 1989 matches with Dallas were known as the Bounty Bowls. Both were won easily by the Eagles (the Cowboys finished 1–15 that year), and were marked by Ryan insulting new Cowboys coach Jimmy Johnson by placing a bounty on their kicker, and by Eagles fans throwing snowballs at him at Veterans Stadium. On November 12, 1990, during a Monday Night Football game at the Vet, the Eagles defeated the Washington Redskins by a score of 28–14, as the defense scored three of the team's four touchdowns. This game, more lopsided than its score would indicate, was subsequently labeled the Body Bag Game in reference to the number of injuries Eagles players inflicted on the Redskins and the physically tough play of the Eagles in the game. In the game, the Eagles knocked out the starting Washington quarterback, and then seriously injured his replacement. Running back Brian Mitchell, who would later be signed"
  },
  {
    "chunk_id": "philadelphia_eagles_018",
    "doc_title": "philadelphia_eagles",
    "text": "in reference to the number of injuries Eagles players inflicted on the Redskins and the physically tough play of the Eagles in the game. In the game, the Eagles knocked out the starting Washington quarterback, and then seriously injured his replacement. Running back Brian Mitchell, who would later be signed by the Eagles, was called upon to finish the game as the Redskins' quarterback. Washington returned to Philadelphia in the first round of the playoffs to defeat the Eagles 20–6, ending their season. Ryan was fired on January 7, 1991, and was replaced by offensive coordinator Rich Kotite. The team started the 1991 season with the loss of starting quarterback Randall Cunningham due to a knee injury. Backup quarterback Jim McMahon assumed the starting role for the rest of the season. Despite having the top-rated defense in the league, the team failed to make the playoffs by finishing third in the NFC East with a record of 10–6. On June 25, 1992, All Pro defensive tackle Jerome Brown was killed in an automobile accident. The team and fan base dedicated the 1992 season to \"bring it home for Jerome\". The team finished second in the NFC East with an 11–5 record to earn a wild-card playoff spot. Kotite led the Eagles to a victory over the New Orleans Saints in the wild-card game but then fell to the Dallas Cowboys in the Divisional round. Another blow to the team was the loss of all-time sacks leader Reggie White to free agency in the off-season. Among the team's offensive stars during that period were quarterback Randall Cunningham, tight end Keith Jackson, and running back Herschel Walker. But what was known as the Gang Green defense, led by Reggie White, Jerome Brown, Clyde Simmons, Seth Joyner, Wes Hopkins, Mike Golic, Byron Evans,"
  },
  {
    "chunk_id": "philadelphia_eagles_019",
    "doc_title": "philadelphia_eagles",
    "text": "agency in the off-season. Among the team's offensive stars during that period were quarterback Randall Cunningham, tight end Keith Jackson, and running back Herschel Walker. But what was known as the Gang Green defense, led by Reggie White, Jerome Brown, Clyde Simmons, Seth Joyner, Wes Hopkins, Mike Golic, Byron Evans, Eric Allen, Andre Waters, and Mark McMillian, defined the team. In 1993, Kotite's Eagles fell apart after a promising start and miss the playoffs, ending the regular season 8–8. Jeffrey Lurie era (1994–present) By 1994, team owner Norman Braman had become largely unpopular among local fans and a polarizing presence in the front office. Jeffrey Lurie bought the Eagles on May 6, 1994, for an estimated $185 million. In Lurie's first season as owner in 1994, the team went 7–9 and again missed the playoffs. Rich Kotite was fired and replaced by San Francisco 49ers defensive coordinator Ray Rhodes, who successfully lured 49ers star Ricky Watters to join the team as a free agent. In 1995, Rhodes's first season, the Eagles got off to a slow start by losing three of their first four games but subsequently rebounded to finish with a 10–6 record and a playoff spot. In the Wild Card Round, the Eagles, playing at home, overwhelmed the Detroit Lions 58–37, with 31 of Philadelphia's points coming in the second quarter. However, the Eagles were again eliminated in the next round by the Cowboys by a score of 30–11. This would be Randall Cunningham's last game as an Eagle. Cunningham scored the only touchdown of the game and the last Eagles postseason touchdown for six years. 1995 marked the end of Cunningham's tenure as starting quarterback. Rhodes benched Cunningham in favor of Rodney Peete, leading to friction between the two. Earlier, rumors had circulated that Lurie and Rhodes"
  },
  {
    "chunk_id": "philadelphia_eagles_020",
    "doc_title": "philadelphia_eagles",
    "text": "Eagle. Cunningham scored the only touchdown of the game and the last Eagles postseason touchdown for six years. 1995 marked the end of Cunningham's tenure as starting quarterback. Rhodes benched Cunningham in favor of Rodney Peete, leading to friction between the two. Earlier, rumors had circulated that Lurie and Rhodes had tried to trade Cunningham to the Arizona Cardinals. However, no such trade materialized and Cunningham retired shortly after the season. In 1996, the Eagles' uniform colors were changed from the classic kelly green to a darker midnight green. The team got off to a good start, winning three of their first four games. However, a week 5 Monday night game at Veterans Stadium against the rival Cowboys witnessed a season-ending knee injury to Peete, loss of the team's momentum, and the transition to an offense led by Ty Detmer and Watters. While Detmer played well and Watters rushed for 1,411 yards, the season conformed to what had become a familiar pattern: 10–6 record and early elimination (a 14–0 shutout by the 49ers) in the playoffs. In the 1996 NFL draft, future fan-favorite and hall-of-famer Brian Dawkins was chosen in the second round. The continued early playoff exits led fans and local media to cast blame on high-priced free agents (Irving Fryar, Watters, Troy Vincent, and Guy McIntyre) for not stepping up in big games, especially in the postseason. Rhodes gradually deteriorated under the stress of the job, and players were beginning to grow tired of his brash demeanor and often autocratic coaching style. After a see-saw 6–9–1 campaign in 1997, the bottom fell out in 1998. The Eagles suffered a 3–13 record, their worst since 1972, and were ranked dead last in numerous offensive statistics. Home attendance was declining, a quarterback controversy was deteriorating an already rudderless locker room,"
  },
  {
    "chunk_id": "philadelphia_eagles_021",
    "doc_title": "philadelphia_eagles",
    "text": "often autocratic coaching style. After a see-saw 6–9–1 campaign in 1997, the bottom fell out in 1998. The Eagles suffered a 3–13 record, their worst since 1972, and were ranked dead last in numerous offensive statistics. Home attendance was declining, a quarterback controversy was deteriorating an already rudderless locker room, and the players had all but tuned out the embattled coaching staff. Left with little choice after a disastrous season, fan revolt, and sagging team morale, Lurie fired Rhodes and hired Green Bay Packers quarterback coach Andy Reid as head coach. Andy Reid years (1999–2012) The Eagles reemerged as a predominant NFL team under the leadership of new head coach Andy Reid, who was hired away from the Green Bay Packers, where he was the Packers' quarterback coach. Reid's first notable step was drafting Syracuse quarterback Donovan McNabb with the second overall pick in the 1999 NFL draft. The Eagles' awful 1998 season would have entitled the Eagles to first pick but it was awarded to the rebooted Cleveland Browns. Despite clearing the roster for new talent by releasing unpopular and aging veterans such as Ricky Watters and Irving Fryar, Reid was still a virtual unknown before his arrival as head coach, and his appointment was met initially with skepticism among Philadelphia fans. The drafting of McNabb was unpopular with many Eagles fans, many of whom traveled to Madison Square Garden for the 1999 Draft and booed the selection, believing the Eagles instead should have selected Ricky Williams, a University of Texas running back who had been named the 1998 AP College Player of the Year. The 1999 season was largely a rebuilding year for the Eagles. The team, which routinely sells out its home games in Philadelphia, had two 1999 home games that failed to sell out, resulting in"
  },
  {
    "chunk_id": "philadelphia_eagles_022",
    "doc_title": "philadelphia_eagles",
    "text": "of Texas running back who had been named the 1998 AP College Player of the Year. The 1999 season was largely a rebuilding year for the Eagles. The team, which routinely sells out its home games in Philadelphia, had two 1999 home games that failed to sell out, resulting in local TV blackouts. Another six home games in the 1999 season sold out only because several local small business owners bought the remaining unsold tickets to spare Philadelphia-area viewers a television blackout of the game. The Week 5 home game at Veterans Stadium on October 10, 1999, against the Dallas Cowboys represented the last play of Cowboys wide receiver Michael Irvin's career. In the game, Irvin was driven into the turf by Eagles safety Tim Hauck, which left Irvin lying motionless. Some Eagles fans responded with applause, giving further rise to Philadelphia's reputation as unduly aggressive and hostile fans. Irvin was transported from the field by stretcher and then by ambulance to Thomas Jefferson University Hospital. Irvin, who was diagnosed with a potentially threatening cervical spine injury and forced to announce his NFL retirement after the injury, later said the Philadelphia fans were applauding his departure rather than his serious injury. The team finished the season with a record of 5–11. The 2000 regular-season opener in Dallas on September 3 became known in NFL lore as the \"Pickle Juice Game\". Kickoff temperature in Texas Stadium was 109 degrees Fahrenheit and soared to nearly 120, making it the hottest game in league history, beating a previous record set in a 1997 Cowboys–Cardinals match in Arizona. The nickname came about because an Eagles trainer had prepared for the predicted heat by having the players drink the juice from jars of dill pickles in order to retain body moisture and stave off cramps"
  },
  {
    "chunk_id": "philadelphia_eagles_023",
    "doc_title": "philadelphia_eagles",
    "text": "league history, beating a previous record set in a 1997 Cowboys–Cardinals match in Arizona. The nickname came about because an Eagles trainer had prepared for the predicted heat by having the players drink the juice from jars of dill pickles in order to retain body moisture and stave off cramps and heat exhaustion. The experiment proved successful as the Eagles won 41–14 while multiple Cowboys players had been consigned to the bench, unable to handle the torrid climate while the Eagles had no players benched. The game was also significant as marking the beginning of Philadelphia's domination of the NFC East. The team finished the season at 11–5, reaching the playoffs as a wild card, which restored fan optimism. After brushing aside the Tampa Bay Buccaneers 21–3, the Eagles moved to the second round of the playoffs, only to lose 20–10 to the New York Giants. After compiling an 11–5 record in 2001, the Eagles reached the playoffs again, this time at the top of their division. In a near rerun of the previous year, they disposed of the Buccaneers in a 31–9 game. In the second round, the Eagles defeated the Bears 33–19 at Soldier Field. In the NFC Championship game, they were unable to stop the St. Louis Rams, who defeated them 29–24. Despite injuries, McNabb led the Eagles to a 12–4 season in 2002. Once again, they reached the NFC Championship game, but lost at home 27–10 to the eventual Super Bowl champion Tampa Bay Buccaneers in the last game at Veterans Stadium. In the opening game of the 2003 season, the Eagles were shut out 17–0 by the Tampa Bay Buccaneers in the first regular-season game ever played at their new home, Lincoln Financial Field. Once again, the team went 12–4 for the season and then"
  },
  {
    "chunk_id": "philadelphia_eagles_024",
    "doc_title": "philadelphia_eagles",
    "text": "the last game at Veterans Stadium. In the opening game of the 2003 season, the Eagles were shut out 17–0 by the Tampa Bay Buccaneers in the first regular-season game ever played at their new home, Lincoln Financial Field. Once again, the team went 12–4 for the season and then reached the conference championship game. In doing so, the Eagles became the first team in modern history to get that far in the postseason after having been shut out at home in its first game. They achieved that distinction despite getting only five touchdown receptions all year by their wide receivers, which tied the league-low since the regular-season schedule was lengthened to its present 16 games in 1978 (this record would be broken in 2004 when the New York Giants' wide receivers caught only two touchdown passes). The Eagle receivers went through both September and October without a TD catch; the last time an NFL team had done that was in 1945. In the Divisional Round of the playoffs, the Eagles beat the Green Bay Packers 20–17 in overtime thanks in part to a late-game completion from McNabb to Freddie Mitchell on an iconic play that has come to be known as 4th and 26. They lost the NFC Championship game to the Carolina Panthers 14–3. Panthers cornerback Ricky Manning Jr. had three interceptions in the game. The Eagles actively pursued premier wide receiver Terrell Owens, and acquired him in a controversial three-way deal with the Baltimore Ravens and the San Francisco 49ers, on March 16, 2004. The 2004 season began with a bang as Owens caught three touchdown passes from McNabb in their season opener against the New York Giants. Owens ended up with exactly 1,200 receiving yards and 14 touchdown receptions, although his season ended prematurely with an"
  },
  {
    "chunk_id": "philadelphia_eagles_025",
    "doc_title": "philadelphia_eagles",
    "text": "San Francisco 49ers, on March 16, 2004. The 2004 season began with a bang as Owens caught three touchdown passes from McNabb in their season opener against the New York Giants. Owens ended up with exactly 1,200 receiving yards and 14 touchdown receptions, although his season ended prematurely with an ankle injury in a December 19 game against the Dallas Cowboys. The Eagles' 12–7 victory in this game gave them home-field advantage throughout the conference playoffs for the third year in a row. The Eagles tied a record by clinching the NFC East division crown (their fourth straight) after only their eleventh game of the season, matching the mark set by the 1985 Chicago Bears and the 1997 San Francisco 49ers. Their final two regular-season games thus rendered meaningless, the Eagles sat out most of their first-string players in these games and lost both, yet still finished the season with a 13–3 record. McNabb had his best season to date, passing for 3,875 yards and 31 touchdowns, with only eight interceptions. This made him the first quarterback in NFL history to throw 30 or more TD passes and fewer than 10 interceptions in a single regular season. They then began their playoff run with the Divisional round at home against the sixth-seeded Minnesota Vikings. The Eagles led from the start and never looked back, as McNabb led a very efficient passing attack (21 of 33 for 286 yards and 2 TDs), Brian Westbrook dominated on the ground with 70 rushing yards, and Freddie Mitchell performed very well on the receiving corps (5 receptions for 65 yards and a TD), as Philadelphia won 27–14, setting up their fourth-straight NFC Championship appearance. Facing the Atlanta Falcons, McNabb threw for 180 yards and two touchdowns, while also rushing for 32 yards. Westbrook rushed"
  },
  {
    "chunk_id": "philadelphia_eagles_026",
    "doc_title": "philadelphia_eagles",
    "text": "yards, and Freddie Mitchell performed very well on the receiving corps (5 receptions for 65 yards and a TD), as Philadelphia won 27–14, setting up their fourth-straight NFC Championship appearance. Facing the Atlanta Falcons, McNabb threw for 180 yards and two touchdowns, while also rushing for 32 yards. Westbrook rushed for 96 yards and caught five passes for 39. Winning the game 27–10, the Eagles advanced to Super Bowl XXXIX, where they faced the New England Patriots. Although McNabb threw 3 touchdown passes and 357 yards in the game, and the score was tied 14–14 going into the fourth quarter, the Patriots outscored the Eagles with ten straight points. McNabb completed a 30-yard touchdown pass, and the Eagles defense held the Patriots to a 3 and out, but a crucial interception with 46 seconds left sealed their fate, as the Patriots won 24–21. The team took a step back in 2005 with a 6–10 record, failing to make the playoffs for the first time since the 1999 season. McNabb had played with a sports hernia and a broken thumb, starting 4–2 then losing three in a row, before he finally succumbed to injury and missed the rest of the season. For obnoxious behavior and a feud with McNabb, Owens was suspended after 7 games and was eventually cut. In 2006, the team lost McNabb 10 games in and went into turmoil. However, Westbrook stepped up, and the Eagles earned their fifth NFC East title under coach Reid, with a 10–6 record. They won the Wild Card game against the New York Giants, but lost in the Divisional Round to the New Orleans Saints. The 2007 season would end with the Eagles finishing 8–8 and failing to make the playoffs for the second time in three seasons. However, in 2008, the"
  },
  {
    "chunk_id": "philadelphia_eagles_027",
    "doc_title": "philadelphia_eagles",
    "text": "record. They won the Wild Card game against the New York Giants, but lost in the Divisional Round to the New Orleans Saints. The 2007 season would end with the Eagles finishing 8–8 and failing to make the playoffs for the second time in three seasons. However, in 2008, the team finished the season with a 9–6–1 record, making the playoffs with a wild card berth, The team upset the Minnesota Vikings in the first round, winning the game 26–14. The team then went on to defeat the defending Super Bowl champion New York Giants 23–11 en route to their sixth NFC Championship Game. In the NFC Championship game, the Eagles rallied from down 24–6 at halftime to up 25–24 in the fourth quarter, but they lost to the Arizona Cardinals by a score of 32–25 after quarterback Kurt Warner scored a touchdown with just under three minutes remaining in regulation. Entering the 2009 season, the Eagles signed quarterback Michael Vick. On December 6, 2009, Andy Reid became only the fifth coach in NFL history to win 100 or more games with a single team in a single decade (the other four are Tom Landry, Don Shula, Tony Dungy, and Bill Belichick). McNabb finally had a complete receiving corps, between first-round draft pick Jeremy Maclin, DeSean Jackson's 1,000-yard season, and Brent Celek ranking among the top 5 tight ends in the league. Without Brian Dawkins, defensive end Trent Cole stepped up and became the dominant force on defense with 12 sacks, earning him his second trip to the Pro Bowl and All-Pro honors. In 2009, the Eagles started 5–4, then won six straight. After a shutout by the Dallas Cowboys in week 17, the Eagles failed to secure a first-round bye, and with a record of 11–5, they were the"
  },
  {
    "chunk_id": "philadelphia_eagles_028",
    "doc_title": "philadelphia_eagles",
    "text": "sacks, earning him his second trip to the Pro Bowl and All-Pro honors. In 2009, the Eagles started 5–4, then won six straight. After a shutout by the Dallas Cowboys in week 17, the Eagles failed to secure a first-round bye, and with a record of 11–5, they were the NFC's sixth seed. In their January 2010 wild card game, the Eagles played against their divisional foes for the second consecutive week, losing 34–14 to hand Dallas their first playoff win since December 1996. On January 11, 2010, General Manager Tom Heckert, Jr. was hired away by the Cleveland Browns; he was replaced by Howie Roseman, who was promoted from Vice President of Player Personnel. On March 5, 2010, Brian Westbrook was cut from the Eagles after eight seasons with the team. On April 4, 2010, the team traded long-time starting quarterback Donovan McNabb to the Washington Redskins in exchange for a second-round draft pick. Kevin Kolb was immediately named the starter for the 2010 season, but after suffering a concussion in week 1 against the Packers, Vick took over as the starter. Week 4 saw the return of McNabb to Philadelphia. The Redskins got a touchdown early in the first quarter. After that, both offenses sputtered, and the Eagles had to settle for two field goals. But things rapidly fell apart when Vick injured his ribs and chest late in the first quarter when two Redskins defensive backs crushed him from both sides while running near the end zone. Kolb was once again brought out to play but delivered an uninspiring performance. He managed a touchdown pass in the fourth quarter, but it wasn't enough. A two-point conversion attempt after the touchdown failed, and Washington won 16–12. In Week 15, the Eagles beat the New York Giants in a"
  },
  {
    "chunk_id": "philadelphia_eagles_029",
    "doc_title": "philadelphia_eagles",
    "text": "Kolb was once again brought out to play but delivered an uninspiring performance. He managed a touchdown pass in the fourth quarter, but it wasn't enough. A two-point conversion attempt after the touchdown failed, and Washington won 16–12. In Week 15, the Eagles beat the New York Giants in a stunning upset by overcoming a 21-point deficit in the second half. In the closing seconds of the game, DeSean Jackson returned a punt 65 yards for a touchdown to win 38–31. This became known as the Miracle at the New Meadowlands. Vick led the Eagles to their sixth NFC East division title in ten seasons. With a record of 10–6, the Eagles clinched the third seed. In the wild card round, the Eagles lost 21–16 to the eventual Super Bowl XLV champion Green Bay Packers. The 2011 season for the Eagles was a major disappointment. The off-season was marred by a lockout that began in March after the NFL's collective bargaining agreement expired, making practices, trades, and free agency impossible. During the draft, the Eagles did comparatively little. After the lockout ended in July, the team embarked on a rash of high-profile FA signings, including Raiders CB Nnamdi Asomugha, Dolphins RB Ronnie Brown, Giants WR Steve Smith, Packers TE Donald Lee, Titans DE Jason Babin, and Packers DT Cullen Jenkins. Meanwhile, Kevin Kolb, displeased at losing the starting quarterback job to Michael Vick in 2010, was traded to Arizona for Dominique Rodgers-Cromartie. Replacing him as 2nd-stringer was ex-Titans quarterback Vince Young. Young created a lot of hype by calling Philadelphia the \"Dream Team\". The team managed to finish only 8–8 and missed the playoffs. In 2012, the Eagles started off winning three of their first four games but lost their next eight, which eliminated them from the playoff hunt. They"
  },
  {
    "chunk_id": "philadelphia_eagles_030",
    "doc_title": "philadelphia_eagles",
    "text": "Young. Young created a lot of hype by calling Philadelphia the \"Dream Team\". The team managed to finish only 8–8 and missed the playoffs. In 2012, the Eagles started off winning three of their first four games but lost their next eight, which eliminated them from the playoff hunt. They won only one of their last four games. After a loss to the New York Giants on December 30, 2012, head coach Andy Reid was fired after fourteen seasons with the team. Chip Kelly years (2013–2015) On January 16, 2013, after a 4–12 season, the Eagles brought in University of Oregon head coach Chip Kelly to succeed Reid as head coach. The Philadelphia Eagles named Michael Vick the starting quarterback going into the 2013 season with much promise running Chip Kelly's fast-paced spread offense. The 2013 season proved very successful for the Eagles. While a hamstring injury took Michael Vick out after a 1–3 start, his backup Nick Foles led the team to a 10–6 regular-season record and its seventh NFC East title in 13 seasons, but the Eagles lost to the New Orleans Saints in the wild card round. Before throwing his first interception in Week 14, Foles had thrown 19 touchdowns, just one shy of the all-time NFL record of consecutive touchdowns without an interception to start a season, set earlier in the season by Peyton Manning. Foles also tied Manning for most touchdown passes in a single game, with seven, against the Oakland Raiders, which also made him the youngest player in NFL history to throw for that many touchdowns in a game. Foles finished the regular season with 27 touchdown passes and only 2 interceptions, giving him the then-best TD-INT ratio in NFL history. (That record was later broken by Tom Brady, in the 2016 season.)"
  },
  {
    "chunk_id": "philadelphia_eagles_031",
    "doc_title": "philadelphia_eagles",
    "text": "him the youngest player in NFL history to throw for that many touchdowns in a game. Foles finished the regular season with 27 touchdown passes and only 2 interceptions, giving him the then-best TD-INT ratio in NFL history. (That record was later broken by Tom Brady, in the 2016 season.) He also finished with a 119.0 passer rating, third-highest in league history behind only Aaron Rodgers in 2011 and Peyton Manning in 2004. He was also only the second quarterback in NFL history to have a game in which he topped 400 passing yards and a perfect passer rating. LeSean McCoy finished his Pro Bowl season as the league's top rusher with 1,607 rushing yards (also a franchise record) and 2,146 total yards from scrimmage, also best in the NFL. As a whole, the Eagles offense scored 51 touchdowns, most in franchise history, passing the previous season-high set back in 1948. Following the 2013 season, the Eagles released Pro-Bowl wide receiver DeSean Jackson due to his poor \"work ethic and attitude\", as well as speculation of his involvement in gang-related activities. The team signed All Pro safety Malcolm Jenkins to a three-year contract, worth $16.25 million. The Eagles opened the 2014 season winning their first three games and making NFL history as the only team ever to trail by ten or more points in their first three games and come back to win. Nick Foles struggled with turnovers, but ultimately did well and led the Eagles to a 6–2 record, before breaking his collarbone, resulting in his replacement by Mark Sanchez, who outplayed Foles. The Eagles held the divisional title from Week 1 to Week 15. After going 9–3 with a crucial win over the Dallas Cowboys, the Eagles lost their next three, and a week after losing the NFC"
  },
  {
    "chunk_id": "philadelphia_eagles_032",
    "doc_title": "philadelphia_eagles",
    "text": "before breaking his collarbone, resulting in his replacement by Mark Sanchez, who outplayed Foles. The Eagles held the divisional title from Week 1 to Week 15. After going 9–3 with a crucial win over the Dallas Cowboys, the Eagles lost their next three, and a week after losing the NFC East title, they lost an upset against the 3–11 Washington Redskins and were eliminated from playoff contention with the Cowboys' win over the Indianapolis Colts. Following the 2014 season, Chip Kelly was given total control and made some controversial personnel moves. He traded LeSean McCoy, who had become the team's all-time leading rusher after the 2014 season, for linebacker Kiko Alonso, a player Kelly coached at Oregon who had missed the entire 2014 season. He also cut ten-year veteran and starter Trent Cole, who was still a consistent threat on defense and was second only to legend Reggie White on the Eagles all-time sack list. He also traded the highly successful Nick Foles for Sam Bradford, who had missed the entire 2014 season with a torn anterior cruciate ligament. Kelly tried to re-sign Jeremy Maclin, who had stepped up as the team's leading wide receiver, but Maclin signed with the Kansas City Chiefs instead. However, the Eagles also acquired league leading rusher DeMarco Murray, which not only helped the Eagles, but hurt their rivals, the Dallas Cowboys. They also obtained Super Bowl champion Byron Maxwell, who left the Seattle Seahawks in free agency to sign a six-year, $63 million contract. The first two games of the 2015 season were dismal, as they lost both. Bradford had a poor 2–4 TD-INT ratio, Maxwell was constantly beaten by Atlanta Falcons wide receiver Julio Jones, and Murray was held to 11 yards on 21 carries. After Murray was injured, Ryan Mathews rushed for"
  },
  {
    "chunk_id": "philadelphia_eagles_033",
    "doc_title": "philadelphia_eagles",
    "text": "The first two games of the 2015 season were dismal, as they lost both. Bradford had a poor 2–4 TD-INT ratio, Maxwell was constantly beaten by Atlanta Falcons wide receiver Julio Jones, and Murray was held to 11 yards on 21 carries. After Murray was injured, Ryan Mathews rushed for over 100 yards in a Week 3 win against the New York Jets. Kelly made Murray the unquestioned starter and although Murray's play improved over the season, he never regained his dominant form and was held to a career-low average of 3.6 yards per carry. On December 29, 2015, with one game left in the season, head coach Chip Kelly was released by the Eagles after a 6–9 record. Offensive coordinator Pat Shurmur was named interim head coach for the final game against the rival New York Giants, which Shurmur won 35–30. Doug Pederson years (2016–2020) The Eagles hired Kansas City Chiefs' offensive coordinator Doug Pederson as their next head coach on January 18, 2016. Pederson had been with the Chiefs for the preceding three years after having spent the four seasons before those with the Eagles. He served as a quality control assistant coach for the Eagles in 2009 and 2010 before being promoted to quarterbacks coach for the 2011 and 2012 seasons. He had been praised for his work with Chiefs quarterback Alex Smith over the prior several seasons, particularly 2015, as the Chiefs moved into the top 10 in scoring offense. At the end of the 2015 season, the Eagles were slated for the 13th overall pick in the 2016 NFL draft. They traded that pick, Byron Maxwell, and Kiko Alonso to the Miami Dolphins for the eighth overall pick. Later, they traded the eighth overall pick, their third- and fourth-round picks, a 2017 first-round pick, and"
  },
  {
    "chunk_id": "philadelphia_eagles_034",
    "doc_title": "philadelphia_eagles",
    "text": "season, the Eagles were slated for the 13th overall pick in the 2016 NFL draft. They traded that pick, Byron Maxwell, and Kiko Alonso to the Miami Dolphins for the eighth overall pick. Later, they traded the eighth overall pick, their third- and fourth-round picks, a 2017 first-round pick, and a 2018 second-round pick to the Cleveland Browns for the second overall pick and a 2017 fourth-round pick. They used the second overall pick to draft North Dakota State quarterback Carson Wentz. On September 3, 2016, the Eagles traded starting quarterback Sam Bradford to the Minnesota Vikings, who had lost Teddy Bridgewater for the season, for a 2017 first-round pick and a 2018 fourth-round pick. Following the trade, the Eagles named Wentz the starting quarterback for Week 1 of the 2016 season. First-time head coach Pederson led the Eagles to a 3–0 record to start the season. His rookie quarterback started with five touchdowns, no interceptions and over 255 yards per game. After a Week 4 bye, they lost four out of the next five games, including losses to every team in their division. They also lost right tackle Lane Johnson to a 10-game suspension following the Week 5 loss against the Lions, which damaged Carson Wentz's hot start. In those four defeats, their average margin of loss was just under 5 points. Pederson and the Eagles won just three of their final seven games. Although Wentz started off the season well, he finished with a TD–INT ratio of 8:7. The rookie head coach-quarterback tandem led the Eagles to a 7–9 record, finishing last in the division. Super Bowl LII Champions The Eagles started off the season with a 10–1 record and finished with a 13–3 record in 2017, including a nine-game winning streak. In a Week 14 game against"
  },
  {
    "chunk_id": "philadelphia_eagles_035",
    "doc_title": "philadelphia_eagles",
    "text": "The rookie head coach-quarterback tandem led the Eagles to a 7–9 record, finishing last in the division. Super Bowl LII Champions The Eagles started off the season with a 10–1 record and finished with a 13–3 record in 2017, including a nine-game winning streak. In a Week 14 game against the Los Angeles Rams, starting quarterback Carson Wentz left the game with a torn anterior cruciate ligament, and backup Nick Foles, who had been re-signed in the off-season, took over for the rest of the season. Wentz was considered to have been playing at an MVP level at the time of his injury. Foles's first start was a comeback from a 20–7 deficit against the New York Giants where he scored four touchdowns to win 34–29. Foles struggled in the last two games of the season against the Oakland Raiders and the Dallas Cowboys and threw a touchdown and two interceptions in those two games. The Eagles clinched the #1 seed and home-field advantage throughout the playoffs after the win against Oakland in Week 16. Despite making history by being home underdogs, Foles led the Eagles past the Atlanta Falcons in the Divisional Round 15–10. In the NFC Championship game, the Eagles dominated the Minnesota Vikings and their league best defense 38–7, again having been betting underdogs in the game. Foles elevated his play and threw for 352 passing yards and three touchdowns. The Eagles traveled to Minneapolis to compete in Super Bowl LII, their third attempt at a title, against Tom Brady and the New England Patriots in a rematch of Super Bowl XXXIX from 2005. In the second quarter, Philadelphia faced fourth-and-goal on the 1-yard line with 38 seconds left. Deciding to go for the touchdown, they attempted a trick play similar to one that had failed for"
  },
  {
    "chunk_id": "philadelphia_eagles_036",
    "doc_title": "philadelphia_eagles",
    "text": "against Tom Brady and the New England Patriots in a rematch of Super Bowl XXXIX from 2005. In the second quarter, Philadelphia faced fourth-and-goal on the 1-yard line with 38 seconds left. Deciding to go for the touchdown, they attempted a trick play similar to one that had failed for the Patriots earlier. It would be the most memorable play of the game. As Foles stepped up to the running back position, Clement took a direct snap and pitched the ball to tight end Trey Burton, who then threw the ball to Foles, who was wide open in the right side of the end zone. Foles caught the ball, making him the first quarterback ever to catch a touchdown pass in a Super Bowl, and the ensuing extra point was good, giving the Eagles a 22–12 lead. The scoring play came to be known as the Philly Special. The Eagles went on to win 41–33, capturing their first Super Bowl Vince Lombardi Trophy in franchise history and their first championship since 1960, ending the third-longest active championship drought in the NFL at 57 years. Foles won Super Bowl MVP going 28 for 43 with 373 passing yards, three passing touchdowns, one interception, and one receiving touchdown. Foles became the first backup quarterback to start and win a Super Bowl since his opponent Tom Brady won as the backup for Drew Bledsoe in 2002's Super Bowl XXXVI. The combined 74 points scored was one point shy of the Super Bowl record of 75, set in Super Bowl XXIX in 1995; this game marked only the second time in the history of the Super Bowl where the teams combined for 70+ points. The game also set a record for most yardage by both teams (combined) with 1,151 yards, the most for any"
  },
  {
    "chunk_id": "philadelphia_eagles_037",
    "doc_title": "philadelphia_eagles",
    "text": "of 75, set in Super Bowl XXIX in 1995; this game marked only the second time in the history of the Super Bowl where the teams combined for 70+ points. The game also set a record for most yardage by both teams (combined) with 1,151 yards, the most for any single game, regular season or postseason. Before the 2018 season started, many injuries plagued the team, including quarterback Carson Wentz, who was still recovering from an anterior cruciate ligament injury that he had sustained during the previous season. Nick Foles was named the starting quarterback to begin the season, and helped the team win their opening game against the Atlanta Falcons, 18–12. Wentz returned as the starting quarterback in week 3 after Foles had led the team to a 1–1 record. Injuries continued to be a major problem throughout the season, especially on defense as Jalen Mills, Ronald Darby, and Rodney McLeod all suffered season-ending injuries. Wentz suffered a fractured vertebra in his back after a week 14 loss to the Dallas Cowboys, and Foles was again named the starter for remainder of the season. The Eagles' 4–6 record after 10 games seemed to give them little chance of making the playoffs, but the team managed to win 5 of their last 6, including upsets over the eventual NFC champion Los Angeles Rams and Houston Texans. The Eagles finished the season with a 9–7 record and made the playoffs as the sixth seed. In the Wild Card game against the Chicago Bears, Foles threw 2 touchdowns and 2 interceptions in a 16–15 win. With ten seconds left, Bears kicker Cody Parkey missed a potential game-winning field goal that became known in NFL lore as the Double Doink. This sent the Philadelphia Eagles to an NFC Divisional matchup against the New"
  },
  {
    "chunk_id": "philadelphia_eagles_038",
    "doc_title": "philadelphia_eagles",
    "text": "Chicago Bears, Foles threw 2 touchdowns and 2 interceptions in a 16–15 win. With ten seconds left, Bears kicker Cody Parkey missed a potential game-winning field goal that became known in NFL lore as the Double Doink. This sent the Philadelphia Eagles to an NFC Divisional matchup against the New Orleans Saints. The Eagles offense initially performed well, ending the first quarter with a 14–0 lead. The Eagles would not score again after the Saints defense rallied, forcing Foles to throw two interceptions. The Eagles ended up losing by a score of 20–14, ending their opportunity to repeat as Super Bowl champions In 2019, the Eagles matched their 9–7 record from 2018. They won 4 straight games against divisional opponents to close the season, clinching the NFC East in Week 17 with a 34–17 win over the New York Giants and clinched a playoff berth for the third consecutive season. Carson Wentz started his first playoff game in the Wild Card round against the Seattle Seahawks, but left the game early in the first quarter after suffering a concussion on a controversial helmet-to-helmet hit by Jadeveon Clowney. Backup quarterback Josh McCown finished the game even after suffering a torn hamstring in the second quarter. The Eagles lost to the Seahawks 17–9, ending their season. The Eagles opened the 2020 season with consecutive losses to the Washington Football Team and Los Angeles Rams. In week 3, the Eagles tied with the Cincinnati Bengals after controversially punting the ball instead of attempting a potential 64-yard game-winning field goal late in overtime. The decision was widely criticized by sports media and fans as they accused head coach Doug Pederson of settling for a tie, rather than playing to win. Once again, injuries continued to plague the team as almost every offensive starter had"
  },
  {
    "chunk_id": "philadelphia_eagles_039",
    "doc_title": "philadelphia_eagles",
    "text": "a potential 64-yard game-winning field goal late in overtime. The decision was widely criticized by sports media and fans as they accused head coach Doug Pederson of settling for a tie, rather than playing to win. Once again, injuries continued to plague the team as almost every offensive starter had suffered an injury throughout the season, and the team fielded 14 different offensive line combinations in 16 games. The team entered the bye week with a 3–4–1 record and proceeded to lose their next four games. During their week 13 match-up against the Green Bay Packers, rookie quarterback Jalen Hurts entered the game in the third quarter in relief of Wentz after poor play. Hurts would later be named the starting quarterback for the remainder of the season after a career-worst season performance by Wentz. Hurts led the Eagles to a 24–21 victory against the New Orleans Saints in week 14. This would be the team's last win of the 2020 season as they lost their next three games, finishing with a 4–11–1 record and missing the playoffs for the first time in four seasons. During the off-season, defensive coordinator Jim Schwartz announced that he would step down from his position. A day later, linebackers coach Ken Flajole left his position on the team. Doug Pederson met with Eagles owner Jeffrey Lurie to discuss the future of the team. Pederson proposed changes to the coaching staff that were described by internal reporters as \"underwhelming\" and out of line with Lurie's vision for the team. On January 11, 2021, the Eagles announced that they had fired Pederson. In a statement, Lurie described the move as in the best interests of both Pederson and the team. Pederson became just the first head coach to be fired within three years of winning a"
  },
  {
    "chunk_id": "philadelphia_eagles_040",
    "doc_title": "philadelphia_eagles",
    "text": "vision for the team. On January 11, 2021, the Eagles announced that they had fired Pederson. In a statement, Lurie described the move as in the best interests of both Pederson and the team. Pederson became just the first head coach to be fired within three years of winning a Super Bowl since the Baltimore Colts fired Don McCafferty after the 1972 NFL season. Nick Sirianni years (2021–present) The Eagles hired former Indianapolis Colts' offensive coordinator Nick Sirianni as their next head coach on January 21, 2021. During the offseason, the Eagles traded starting quarterback Carson Wentz to the Colts for a 2021 third-round draft pick and a 2022 conditional second-round pick. In doing so, Wentz was reunited with Frank Reich, head coach of the Colts who served as the Eagles' offensive coordinator for Wentz's first two years in Philadelphia, including during their Super Bowl-winning season in 2017. The Eagles absorbed a $33.8-million dead-cap hit for trading Wentz. During the 2021 NFL draft, the Eagles selected Heisman Trophy–winning wide receiver DeVonta Smith with the 10th overall pick, and maneuvered around the draft to gain an extra first-round selection in the 2022 NFL draft. Smith was a highly touted prospect out of the University of Alabama, and was the first Heisman winner the Eagles drafted in over fifty years. The drafting of Smith also reunited him with Jalen Hurts, his first quarterback at Alabama. After training camp, Hurts was officially named the Eagles' starting quarterback for the 2021 season by head coach Sirianni. After starting the season 2–5, the Eagles went 7–3 in their last ten games, clinching a playoff berth in week 17 after a victory over the Washington Football Team along with a loss by the Minnesota Vikings and win by the San Francisco 49ers. The Eagles finished the"
  },
  {
    "chunk_id": "philadelphia_eagles_041",
    "doc_title": "philadelphia_eagles",
    "text": "coach Sirianni. After starting the season 2–5, the Eagles went 7–3 in their last ten games, clinching a playoff berth in week 17 after a victory over the Washington Football Team along with a loss by the Minnesota Vikings and win by the San Francisco 49ers. The Eagles finished the season with the #1 rushing offense; It was the best rushing offense since the 1985 Chicago Bears, and the best in the franchise history since the 1949 Eagles team. They lost in the wild card game against the Tampa Bay Buccaneers 31–15. The Eagles went on to win their first eight games of the 2022 season and earned the top seed in the NFC with a 14–3 overall record. the Eagles matched their franchise-best 13–1 start in the 2004 season and secured their third 13-win season win in franchise history, after 2004 and 2017. With a 22–16 win over the Giants in Week 18, the Eagles won the NFC East for the first time since 2019, and clinched the NFC's #1 seed for the first time since 2017. The Eagles also reached 14 regular season wins, a franchise record. In the Divisional Round, the Eagles routed the Giants 38–7 for their first postseason win since 2018. With this win, Philadelphia completed a 3–0 sweep of all three games played against New York, and advanced to the NFC Championship for the first time since 2017. The Eagles went on to win the NFC Championship against an injury depleted San Francisco 49ers team 31–7, advancing to Super Bowl LVII, their fourth Super Bowl appearance in franchise history, to face the Kansas City Chiefs and former longtime head coach Andy Reid. The Eagles ultimately lost to the Chiefs by a score of 38–35. The Eagles opened the 2023 season as the defending NFC"
  },
  {
    "chunk_id": "philadelphia_eagles_042",
    "doc_title": "philadelphia_eagles",
    "text": "team 31–7, advancing to Super Bowl LVII, their fourth Super Bowl appearance in franchise history, to face the Kansas City Chiefs and former longtime head coach Andy Reid. The Eagles ultimately lost to the Chiefs by a score of 38–35. The Eagles opened the 2023 season as the defending NFC Champions. Despite starting the season 10–1, The Eagles failed to equal or improve on their 14–3 record from the previous year. Even in victory, the Eagles had problems with a poor defense the entire season, which was ranked 26th out of 32; 8 of their 11 victories fell within one score, none of their aforementioned wins went outside of 2 scores, and their losses to the playoff-bound 49ers and Cowboys were blowouts. The Eagles' late-season woes continued into the playoffs, in which they were eliminated in the Wild Card round by the NFC South champion Tampa Bay Buccaneers in a 32–9 blowout loss. The Eagles promptly fired offensive coordinator Brian Johnson and defensive coordinator Sean Desai within a week of their playoff exit. In the subsequent offseason, on March 4, 2024, center Jason Kelce retired after spending his entire 13-year career with the Eagles. On March 10, defensive tackle Fletcher Cox would also retire after spending 12 seasons with the team. Super Bowl LIX Champions On March 13, 2024, Saquon Barkley, a running back with the New York Giants from 2018 to 2023, became a free agent, and signed a three-year $37.75 million deal with the Eagles. On September 6, 2024, the Eagles opened their season in São Paulo, Brazil. In his debut, Barkley rushed for 109 yards with two rushing touchdowns and a receiving touchdown in a 34–29 victory over the Green Bay Packers, becoming the first Eagles player to score three touchdowns in their debut with the team"
  },
  {
    "chunk_id": "philadelphia_eagles_043",
    "doc_title": "philadelphia_eagles",
    "text": "2024, the Eagles opened their season in São Paulo, Brazil. In his debut, Barkley rushed for 109 yards with two rushing touchdowns and a receiving touchdown in a 34–29 victory over the Green Bay Packers, becoming the first Eagles player to score three touchdowns in their debut with the team since Terrell Owens in 2004. Despite a turbulent 2–2 start to the season, the Eagles improved on their 11–6 record from the previous season, and won ten consecutive games for the first time in franchise history. For the fourth straight year and seventh time in the last 8 seasons the Eagles clinched a playoff berth. Barkley continued his dominance in Week 12 against the Los Angeles Rams, recording 255 rushing yards and 302 total yards. His 255 rushing yards were the ninth-most in a single game in NFL history and the most in Eagles history. In Week 17, the Eagles clinched the NFC East by sweeping the Dallas Cowboys for the first time since 2011. Barkley ran for 167 yards and crossed the 2,000 yard mark, becoming only the ninth running back in NFL history to do so, and recording the second-most yards of any running back in NFL history in a single season. With their Week 18 win over the New York Giants, the Eagles finished 14–3 for the second time in three seasons. The Eagles started the playoffs by defeating the Green Bay Packers 22–10 in the Wild Card Round. In a snowy rematch of their Week 12 meeting, the Eagles again beat the Los Angeles Rams in the Divisional Round 28–22. In the NFC Championship Game, the Eagles dominated their division rival Washington Commanders 55–23, setting the record for the most points scored in a conference championship game. In Super Bowl LIX, the Eagles met the Kansas"
  },
  {
    "chunk_id": "philadelphia_eagles_044",
    "doc_title": "philadelphia_eagles",
    "text": "meeting, the Eagles again beat the Los Angeles Rams in the Divisional Round 28–22. In the NFC Championship Game, the Eagles dominated their division rival Washington Commanders 55–23, setting the record for the most points scored in a conference championship game. In Super Bowl LIX, the Eagles met the Kansas City Chiefs in a rematch of Super Bowl LVII from two years earlier, this time defeating the two-time defending champions by a score of 40–22 and winning their second Super Bowl and first since the 2017 season. The Eagles' win prevented the Chiefs from achieving the first-ever Super Bowl three-peat. Barkley recorded 57 rushing yards, setting the NFL record for most rushing (2,504) and scrimmage yards (2,857) in a full season surpassing Terrell Davis. Philadelphia quarterback Jalen Hurts threw for 221 yards with two touchdowns and rushed for 72 yards and a touchdown, breaking his own record for most rushing yards for a quarterback in a Super Bowl, with 72. Hurts was named Super Bowl MVP for his performance in the victory. The Eagles finished with 18 total wins, tying the NFL record for most total wins in a season along with the 1984 San Francisco 49ers, 1985 Chicago Bears, and 2007 New England Patriots. The Eagles 145 points scored set an NFL record for the most points scored in a postseason. Championships NFL championships (pre-Super Bowl era) Super Bowl championships NFC championships Division championships The Eagles were a part of the NFL Eastern Division from 1933 to 1949, the National Conference from 1950 to 1953, and the Eastern Conference from 1953 to 1966. They were then placed in the Capitol Division of the Eastern Conference in 1967. When the league reformed into the NFC and AFC in 1970, the Eagles were placed in the NFC East. Logo and uniforms"
  },
  {
    "chunk_id": "philadelphia_eagles_045",
    "doc_title": "philadelphia_eagles",
    "text": "National Conference from 1950 to 1953, and the Eastern Conference from 1953 to 1966. They were then placed in the Capitol Division of the Eastern Conference in 1967. When the league reformed into the NFC and AFC in 1970, the Eagles were placed in the NFC East. Logo and uniforms The choice of an eagle as the team mascot honored the insignia of the New Deal program, the National Recovery Administration, which featured a blue eagle as its insignia. For the 1933 and 1934 seasons, the Eagles colors were light blue and yellow. In 1935, they added green to their uniforms and for several decades, their colors were kelly green, silver, and white. In 1954 the Eagles, along with the Baltimore Colts, became the second team ever in the NFL to put a logo on their helmets, with silver wings on a kelly green helmet. In 1969 the team wore two helmet versions: Kelly green with white wings in road games, and white with kelly green wings at home. From 1970 to '73, they wore the white helmets with Kelly green wings exclusively before switching back to Kelly green helmets with silver wings. By 1974, Joseph A. Scirrotto Jr. designed the silver wings within a white outline, and this style on a kelly green helmet became standard for over two decades. From 1948 to 1995, the team logo was an eagle in flight carrying a football in its claws, although from 1969 to 1972, the eagle took on a more stylized look. In 1973, the team's name was added below the eagle, returning to its pre-1969 look. Both the logo and uniforms were radically altered in 1996, when the primary kelly green color was changed to a darker shade, officially described as \"midnight green\". Silver was practically abandoned, as uniform"
  },
  {
    "chunk_id": "philadelphia_eagles_046",
    "doc_title": "philadelphia_eagles",
    "text": "stylized look. In 1973, the team's name was added below the eagle, returning to its pre-1969 look. Both the logo and uniforms were radically altered in 1996, when the primary kelly green color was changed to a darker shade, officially described as \"midnight green\". Silver was practically abandoned, as uniform pants moved to either white or midnight green. The traditional helmet wings were changed to a primarily white color, with silver and black accents. The team's logo combination (the eagle and club name lettering) also changed, with the eagle itself limited to a white (bald eagle) head, drawn in a less realistic, more cartoon-like style, and the lettering changed from calligraphic to block letters. The eagle head is the only NFL logo to \"face left\" which causes the right side of the logo to present a stylized \"E\". Since 1996, the team has made only minor alterations, mostly related to jersey/pants combinations worn during specific games. For example, in 1997, against the San Francisco 49ers, the team wore midnight green jerseys and pants for the first of only two occasions in team history. The second occasion was in 2002, during the final regular season game at Veterans Stadium, a win over the division-rival Washington Redskins. A year later, in the first two games of the 2003 season (both home losses, to the Tampa Bay Buccaneers and New England Patriots), the Eagles wore white jerseys with white pants. After that, the white jerseys along with white pants were worn exclusively during preseason games from 2004 to 2011, with the exception of 2007 and 2010. The 2003 season also saw the first (though subtle) change to the 1996-style uniform. On both white and green jerseys, black shadows and silver trim were added to both the green and white numbering. The stripe on"
  },
  {
    "chunk_id": "philadelphia_eagles_047",
    "doc_title": "philadelphia_eagles",
    "text": "preseason games from 2004 to 2011, with the exception of 2007 and 2010. The 2003 season also saw the first (though subtle) change to the 1996-style uniform. On both white and green jerseys, black shadows and silver trim were added to both the green and white numbering. The stripe on the pants changed from black-green-black to black-silver-green on the white pants, and from a solid black stripe to one stripe of black, another of silver, with one small white stripe in between for the midnight green pants. The 2003 season also saw the team debut black alternate jerseys, with a green (instead of black) shadow on white numbers, and silver trim. These black jerseys have been worn for two selected home games each season (usually the first home game after a bye week and the season finale). In the 2003 and 2004 regular-season home finales, the team wore the green road pants with the black alternate jerseys, but lost both games. Since then, the Eagles have only worn the black jerseys with the white pants. However, due to the special 75th-anniversary uniforms serving as the \"alternates\" for one game in 2007, the Eagles could not wear the alternate black jersey that season per league rules at the time (alternate uniforms were permitted twice per season but only one can be used). The black jerseys with white pants, however, re-appeared for the 2008 Thanksgiving night game against the Arizona Cardinals. From 2006 to 2013, the Eagles have only worn the alternate black jerseys once a season and for the last November home game, but did not use them in 2007, 2010, and 2011. For the 2007 and 2010 seasons, the Eagles used throwback uniforms in place of the black alternates for their anniversary to commemorate past teams. The team also started"
  },
  {
    "chunk_id": "philadelphia_eagles_048",
    "doc_title": "philadelphia_eagles",
    "text": "black jerseys once a season and for the last November home game, but did not use them in 2007, 2010, and 2011. For the 2007 and 2010 seasons, the Eagles used throwback uniforms in place of the black alternates for their anniversary to commemorate past teams. The team also started wearing black cleats exclusively in 2004, although the rule was relaxed by the mid-2010s. To celebrate the team's 75th anniversary, the 2007 uniforms featured a 75th-season logo patch on the left shoulder. In addition, the team wore \"throwback\" jerseys in a 2007 game against the Detroit Lions. The yellow and blue jerseys, the same colors found on Philadelphia's city flag, are based on those worn by the Philadelphia Eagles in the team's inaugural season, and had been the same colors used by the Frankford Yellow Jackets franchise prior to its suspension of operations in 1931. The Eagles beat Detroit, 56–21. In the 2010 season against the Green Bay Packers, on September 12, 2010, the Eagles wore uniforms similar to the ones that were worn by the 1960 championship team in honor the 50th anniversary of that team. In weeks 4 and 6 of the 2010 season, the Eagles wore their white jerseys in a match-up against the Washington Redskins and Atlanta Falcons, respectively, before reverting to their midnight green jerseys for the rest of their home games. For the 2012 season, Nike took over from Reebok as the NFL's official apparel licensee, but the Eagles decided that they would not be adopting Nike's \"Elite 51\" uniform technology. Aside from the Nike logo replacing the Reebok logo, the only other change is the league-wide revision of the NFL shield on the uniform (replacing the NFL Equipment logo). Other than that the uniforms essentially remain unchanged. The Eagles also revived their black"
  },
  {
    "chunk_id": "philadelphia_eagles_049",
    "doc_title": "philadelphia_eagles",
    "text": "be adopting Nike's \"Elite 51\" uniform technology. Aside from the Nike logo replacing the Reebok logo, the only other change is the league-wide revision of the NFL shield on the uniform (replacing the NFL Equipment logo). Other than that the uniforms essentially remain unchanged. The Eagles also revived their black alternate jersey and resumed wearing white pants with their white jerseys in the regular season. For the 2014 season, the Eagles officially adopted the \"Elite 51\"-style uniform from Nike. However, they only wore the midnight green jerseys and pants in the second half of that season due to the difficulty of producing their preferred shade of midnight green. In Week 6 of 2014 against the New York Giants, the team introduced black pants to complement their black jerseys, giving them a blackout uniform set. The Eagles won the game 27–0. The victory was their first shutout in 18 years. In Week 16 of 2016 (also against the Giants), the Eagles wore a variation of the all-black look as part of the NFL Color Rush program, but with solid black socks as opposed to black with white sanitary socks of the original look. With the exception of 2017 and 2025, the Eagles have regularly worn the all-black uniforms at home against the Giants since the 2014 'blackout' game. The black jerseys/white pants combination was last seen during a preseason road game against the New England Patriots, after which the black jerseys were paired exclusively with the black pants. In 2018, the Eagles' midnight green pants were not worn at all, marking the first such instance since the 1996 rebrand that the Eagles wore only white pants with their primary white or midnight green jerseys. In Week 6 of the 2017 season, the Eagles debuted an all-white look with white jerseys, white"
  },
  {
    "chunk_id": "philadelphia_eagles_050",
    "doc_title": "philadelphia_eagles",
    "text": "Eagles' midnight green pants were not worn at all, marking the first such instance since the 1996 rebrand that the Eagles wore only white pants with their primary white or midnight green jerseys. In Week 6 of the 2017 season, the Eagles debuted an all-white look with white jerseys, white pants and solid white socks in a road game against the Carolina Panthers. The all-white look began to be utilized full-time as a road uniform set in 2019 thanks to the NFL's decision to allow teams to wear solid color socks as an alternate look. During Week 10 of the 2021 season, the Eagles paired their white uniforms with the alternate black pants against the Denver Broncos, marking the first time the black pants were paired with a different colored uniform. In 2022, the Eagles unveiled a new black alternate helmet, which would be worn alongside the all-black uniform. In addition, the team announced that throwback Kelly Green uniforms would return as an alternate uniform starting in the 2023 season. The team originally intended to release the uniforms in 2022, but due to production supply issues, the Eagles elected to delay its release to the 2023 season. The Eagles returned to wearing Kelly Green uniforms as the teams alternate, with their debut being in a Week 7 win vs the Miami Dolphins. With the Kelly Green helmet becoming the team's one alternate, the black helmet was temporarily shelved, and the Eagles returned to wearing their primary midnight green helmets with the all-black uniform. Back in 2022, it was released to the media that the Eagles would be changing their wordmark to a more modernized design. Due to supply chain issues, the new wordmark was not able to be applied to the uniforms until the 2024 season. In addition, the black"
  },
  {
    "chunk_id": "philadelphia_eagles_051",
    "doc_title": "philadelphia_eagles",
    "text": "the all-black uniform. Back in 2022, it was released to the media that the Eagles would be changing their wordmark to a more modernized design. Due to supply chain issues, the new wordmark was not able to be applied to the uniforms until the 2024 season. In addition, the black helmet was brought back as the team's third helmet option; while the NFL only allowed teams with new designs to adopt a third helmet in 2024, the Eagles' minor change of jersey wordmark counted as such. The black helmets were worn with the white jerseys, black pants and white socks for the team's Week 1 game in São Paulo, Brazil against the Green Bay Packers, and again in a 2025 Week 10 rematch at Lambeau Field. Rivalries Divisional Dallas Cowboys The Eagles and Dallas Cowboys rivalry has been listed among the best and most acrimonious in the NFL. The Eagles won the first game in this rivalry 27–25 on September 30, 1960. Dallas leads the all-time series 74–58 as of the 2024 season, but in recent years, the series has been close, with each team winning 12 games since 2006. There is considerable hostility between the two teams' fan bases, with incidents such as the 1989 Bounty Bowl. The rivalry has even spilled over into draft weekend, with Cowboys legend Drew Pearson and Eagles legend David Akers exchanging insults at the opposing franchise in 2017 and 2018, respectively. New York Giants The Eagles' rivalry with the New York Giants began in 1933 with the founding of the Eagles and slowly strengthened when both teams came to relative prominence in the 1940s and 1950s. The two teams have played in the same division in the NFL every year since 1933. The ferocity of the rivalry can also be attributed to the"
  },
  {
    "chunk_id": "philadelphia_eagles_052",
    "doc_title": "philadelphia_eagles",
    "text": "in 1933 with the founding of the Eagles and slowly strengthened when both teams came to relative prominence in the 1940s and 1950s. The two teams have played in the same division in the NFL every year since 1933. The ferocity of the rivalry can also be attributed to the geographic New York–Philadelphia rivalry, which is mirrored in Major League Baseball's Mets–Phillies and the NHL's Flyers–Rangers and Flyers–Islanders. It is ranked by NFL Network as one of the greatest rivalries of all time, Sports Illustrated ranks it as the fourth best NFL rivalry of all time, and according to ESPN, it is one of the fiercest and most well-known rivalries in the football community. As of the 2024 season, the Eagles lead the all-time series 96–89–2. Washington Commanders While not as big as the rivalries with the Giants and Cowboys, the Eagles' historical rivalry with the Washington Redskins / Washington Football Team / Washington Commanders has still been fierce. Although the two franchises played in the same division in the Eagles' inaugural 1933 season, their first meeting did not take place until October 21, 1934, during Washington's first year under the Boston Redskins moniker; the Redskins defeated the Eagles 6–0 at Fenway Park. Washington currently leads the all-time series 90–87–6. Since 2010, the rivalry has been very even overall with the Eagles winning 19 of the last 31 matchups. Conference Atlanta Falcons The Eagles lead the Atlanta Falcons 21–16–1, with a 3–1 lead in playoff games. The rivalry first emerged after the Falcons upset the Eagles in the 1978 Wild Card Round 14–13, and only intensified further during the 2000s thanks to the rivalry between prominent dual-threat quarterbacks Donovan McNabb and Michael Vick. Recently, the Eagles' path to winning Super Bowl LII included a 2017 divisional round victory over the"
  },
  {
    "chunk_id": "philadelphia_eagles_053",
    "doc_title": "philadelphia_eagles",
    "text": "after the Falcons upset the Eagles in the 1978 Wild Card Round 14–13, and only intensified further during the 2000s thanks to the rivalry between prominent dual-threat quarterbacks Donovan McNabb and Michael Vick. Recently, the Eagles' path to winning Super Bowl LII included a 2017 divisional round victory over the Falcons. Interconference Pittsburgh Steelers The Eagles and Pittsburgh Steelers are both located in Pennsylvania and began play in 1933. From that season through 1966, this was a major rivalry for both teams, as both were part of the same division. In 1967 they were placed in separate divisions, but remained in the same conference for three years. In 1970 the Steelers (along with the Cleveland Browns and Baltimore Colts) moved to the American Football Conference, while the Eagles stayed with the rest of the old-line NFL teams in the National Football Conference. As a result, the Eagles and Steelers no longer played each other every year; instead, they are scheduled to meet once every four years in the regular season. The most recent meeting was in 2024 at Lincoln Financial Field, with the Eagles winning 27–13. The Steelers have lost eleven straight games on the road against the Eagles dating back to 1966, which was also the start of the Super Bowl era. As of the 2024 season, the Eagles lead the all-time series 50–29–3. Players Current roster Awards and honors Retired numbers Notes: (*) Posthumous honors. Despite not being retired, the Eagles have not issued out Randall Cunningham's No. 12 since he left the Eagles in 1995, LeSean McCoy's No. 25 since he left the team in 2015, or Nick Foles' No. 9 since he left the team in 2019. Pro Football Hall of Famers As of 2025, 14 individuals who spent a significant part of their career with"
  },
  {
    "chunk_id": "philadelphia_eagles_054",
    "doc_title": "philadelphia_eagles",
    "text": "12 since he left the Eagles in 1995, LeSean McCoy's No. 25 since he left the team in 2015, or Nick Foles' No. 9 since he left the team in 2019. Pro Football Hall of Famers As of 2025, 14 individuals who spent a significant part of their career with the Eagles (shown in bold below) have been inducted into the Pro Football Hall of Fame. Eagles Hall of Fame In 1987, the Eagles Honor Roll was established. Every Eagles player who had been elected into the Pro Football Hall of Fame at that point was among the inaugural induction class. By 2012, the Honor Roll had been retitled as the Eagles Hall of Fame. Players are considered for induction three years after their retirement from the NFL, and there have been 52 inductees into the Eagles Hall of Fame as of 2024. 75th Anniversary Team Franchise records The following players below have franchise records for the Eagles: Passing + = min. 500 attempts, # = min. 100 attempts, ∗ = minimum 15 attempts, Rushing ∗ = minimum 15 attempts, # = min. 100 attempts, + = min. 500 attempts Receiving ∗ = minimum 4 receptions, # = min. 20 receptions, + = min. 200 receptions Other Returning Defense Exceptional performances Staff Current staff Radio and television Eagles radio affiliates From 2008 through 2010, Eagles games were broadcast on both rock-formatted WYSP and sports-talk Sports Radio 610 WIP, as both stations were owned and operated by CBS Radio. In 2011, CBS dropped the music on WYSP, renaming it WIP-FM and making it a full simulcast of WIP. By 2020, 610 WIP had changed call letters to WTEL and rebranded to the Philadelphia affiliate for the Black Information Network, while WIP-FM broadcast all Eagles games. In 2017, the Eagles extended their"
  },
  {
    "chunk_id": "philadelphia_eagles_055",
    "doc_title": "philadelphia_eagles",
    "text": "CBS dropped the music on WYSP, renaming it WIP-FM and making it a full simulcast of WIP. By 2020, 610 WIP had changed call letters to WTEL and rebranded to the Philadelphia affiliate for the Black Information Network, while WIP-FM broadcast all Eagles games. In 2017, the Eagles extended their broadcasting contract with WIP-FM through 2024. Merrill Reese, who joined the Eagles in 1976, is the play-by-play announcer, and former Eagles wide receiver Mike Quick, who replaced offense lineman Stan Walters beginning in 1998, is the color analyst. The post-game show, which has consisted of many Philadelphia sports personalities, as of the 2014 season is hosted by Kevin Riley, a former Eagles linebacker and special-teamer, and Rob Ellis. Riley was the former post-game host for the show on 94 WYSP before the WIP change over; Rob Ellis hosts a weekly show nightly from 6–10 on 94.1 WIP-FM. Spanish language broadcasts are on WEMG Mega 105.7FM with Rickie Ricardo on play-by-play, and Oscar Budejen as color commentator. In 2015, the preseason games were being televised on WCAU, the local NBC owned and operated station. During the regular season, games are governed by the NFL's master broadcasting contract with Fox, CBS, NBC, and ESPN. Most games can be seen on Fox-owned WTXF-TV. When hosting an AFC team, those games can be seen on CBS-owned KYW-TV. Training camp The Eagles previously held their preseason training camp from the end of July through mid-August each year at Lehigh University in Bethlehem in the Lehigh Valley. In 2013, with the addition of head coach Chip Kelly, the Eagles moved their training camp to the NovaCare Complex in Philadelphia. Training camps were previously held at Chestnut Hill Academy in 1935, Saint Joseph's University in 1939 and 1943, Saranac Lake from 1946 to 1948, Hershey from 1951"
  },
  {
    "chunk_id": "philadelphia_eagles_056",
    "doc_title": "philadelphia_eagles",
    "text": "Valley. In 2013, with the addition of head coach Chip Kelly, the Eagles moved their training camp to the NovaCare Complex in Philadelphia. Training camps were previously held at Chestnut Hill Academy in 1935, Saint Joseph's University in 1939 and 1943, Saranac Lake from 1946 to 1948, Hershey from 1951 to 1967, Albright College from 1968 to 1972, Widener University from 1973 to 1979, and West Chester University from 1980 to 1995. Fight song This fight song is heard during Eagles' home games after touchdowns and before the team is introduced prior to kickoff. Eagles' cheerleaders The Eagles have their own cheerleading squad, which performs a variety of dance routines for the fans and the Eagles on the sideline. The squad also releases a swimsuit calendar each year, and is the first squad in the league to release the calendar on the Android and iOS mobile systems. Fans Devotion Although the method may vary, studies that attempt to rank the 32 fan bases in the NFL consistently place Eagles fans among the best in the league, noting their \"unmatched fervor\". American City Business Journals, which conducts a regular study to determine the most loyal fans in the NFL, ranked Eagles fans third in both 1999 and 2006. The 2006 study called Eagles fans \"incredibly loyal\", noting that they filled 99.8% of the seats in the stadium over the previous decade. Forbes placed the Eagles fans first in its 2008 survey, which was based on the correlation between team performance and fan attendance. ESPN.com placed Eagles fans fourth in the league in its 2008 survey, citing the connection between the team's performance and the mood of the city. The last home game that was blacked out on television in the Philadelphia market as a result of not being sold out was"
  },
  {
    "chunk_id": "philadelphia_eagles_057",
    "doc_title": "philadelphia_eagles",
    "text": "fan attendance. ESPN.com placed Eagles fans fourth in the league in its 2008 survey, citing the connection between the team's performance and the mood of the city. The last home game that was blacked out on television in the Philadelphia market as a result of not being sold out was against the Arizona Cardinals on Sunday, September 12, 1999, which was Andy Reid's first home game as new head coach of the Eagles. The studies note that, whether the Eagles have winning or losing teams, fans can be counted on to pack the stadium each year. As of August 2008, the team had sold out 71 consecutive games, and 70,000 additional fans were on the Eagles' waiting list for season tickets. Despite finishing with a 6–10 record in the 2005 season, the Eagles ranked second in the NFL in merchandise sales, and single-game tickets for the next season were sold out minutes after phone and Internet lines opened. Eagles fans have also been known to chant the famous, \"E-A-G-L-E-S – Eagles!\" at Flyers, Phillies, and 76ers games when the team is getting blown out late in a game and a loss is inevitable, signifying their displeasure with the given team's performance, and that they are instead putting their hope into the Eagles. Occasionally, travelling Phillies fans may even chant this when the Phillies appear to be a few innings away from an inevitable win on the road as a way to celebrate their team and Philadelphia as a whole. The Eagles and Phillies were both the main tenants at Veterans Stadium before Lincoln Financial Field and Citizens Bank Park were built. Notable famous fans of the Eagles include actors Bradley Cooper, Rob McElhenney, and Miles Teller, actor and comedian Kevin Hart, Jeopardy! champion Brad Rutter, journalists Jake Tapper and Jesse"
  },
  {
    "chunk_id": "philadelphia_eagles_058",
    "doc_title": "philadelphia_eagles",
    "text": "Eagles and Phillies were both the main tenants at Veterans Stadium before Lincoln Financial Field and Citizens Bank Park were built. Notable famous fans of the Eagles include actors Bradley Cooper, Rob McElhenney, and Miles Teller, actor and comedian Kevin Hart, Jeopardy! champion Brad Rutter, journalists Jake Tapper and Jesse Watters, morning talk show host Kelly Ripa, TV personality Jim Cramer, and soccer star Carli Lloyd, the latter of whom also appeared at a joint practice of the Eagles with the Baltimore Ravens in 2019 where she nailed a 55-yard field goal attempt. One week later, during an international friendly pitting the United States against Portugal at Lincoln Financial Field, Lloyd celebrated scoring a goal by doing the \"E-A-G-L-E-S, Eagles!\" chant. The United States ultimately won that match 4–0. The Eagles also have famous fans from outside of the United States, which include Australian professional wrestler Grayson Waller, who currently wrestles in American pro wrestling promotion WWE (WrestleMania XL, which was held at Lincoln Financial Field itself, saw Waller don Eagles-themed ring gear), and Andrea Bain, a Canadian talk show host best known for her work as one of the four hosts of the lifestyle talk show The Social on Canadian network CTV. Bad behavior Along with their fierce devotion, Eagles fans have a reputation for bad behavior and sports-related violence, especially when the team plays its rivals. One of the most famous incidents occurred in the 1968 season when fans of the struggling 2–11 Eagles pelted snowballs at an incarnation of Santa Claus during a halftime Christmas celebration. In 2006, HarperCollins published If Football's a Religion, Why Don't We Have a Prayer?, a book by Jereé Longman, in which he describes the fans of the 700 Level at Veterans Stadium as having a reputation for \"hostile taunting, fighting, public"
  },
  {
    "chunk_id": "philadelphia_eagles_059",
    "doc_title": "philadelphia_eagles",
    "text": "incarnation of Santa Claus during a halftime Christmas celebration. In 2006, HarperCollins published If Football's a Religion, Why Don't We Have a Prayer?, a book by Jereé Longman, in which he describes the fans of the 700 Level at Veterans Stadium as having a reputation for \"hostile taunting, fighting, public urination and general strangeness.\" A 1997 game against the San Francisco 49ers in Philadelphia featured so many incidents that, beginning at the following home game, the Eagles appointed a judge, Seamus McCaffery, to preside over a temporary courtroom at the stadium; 20 suspects came before him that day. Fan behavior improved after the team's move to Lincoln Financial Field, and \"Eagles Court\" ended in December 2003. During a January 2025 home playoff game against the Green Bay Packers, an Eagles fan shouted obscenities at a woman wearing Packers gear; the incident went viral online, leading to the Eagles fan losing his job and receiving a ban from the stadium. In popular culture The 1976 Philadelphia Eagles season was the subject of the movie Invincible. The movie stars Mark Wahlberg as Vince Papale, a part-time school teacher and diehard Eagles fan who became an Eagles player. The film differs slightly from true events as the selection process was invitation-only, and Papale had at least some previous playing experience. The film Silver Linings Playbook highlights the 2008 Philadelphia Eagles season, and the novel mentions the 2006 team. The comedy television series It's Always Sunny in Philadelphia makes several references to the Philadelphia Eagles, most notably on Season 3, Episode 2, \"The Gang Gets Invincible\", a reference to the 2006 Wahlberg film. Season-by-season record See also Forbes' list of the most valuable sports teams South Philadelphia Sports Complex Sports in Philadelphia Notes References Sources Lyons, Robert S. (2010). On Any Given Sunday: A"
  },
  {
    "chunk_id": "philadelphia_eagles_060",
    "doc_title": "philadelphia_eagles",
    "text": "Eagles, most notably on Season 3, Episode 2, \"The Gang Gets Invincible\", a reference to the 2006 Wahlberg film. Season-by-season record See also Forbes' list of the most valuable sports teams South Philadelphia Sports Complex Sports in Philadelphia Notes References Sources Lyons, Robert S. (2010). On Any Given Sunday: A Life of Bert Bell. Philadelphia: Temple University Press. ISBN 978-1-59213-731-2. OCLC 607553558. External links Official website Philadelphia Eagles at the National Football League official website Franchise Encyclopedia at Pro Football Reference"
  },
  {
    "chunk_id": "run-pass_option_001",
    "doc_title": "run-pass_option",
    "text": "The run-pass option (RPO) is a type of designed option play in American football in which the offensive team has the ability to either rush or pass the ball depending on the alignment and actions of defensive team. Like the standard read-option, the quarterback is responsible for viewing the actions of a particular defender (the \"read man\") and makes a decision to hand the ball off to their running back depending on how that defender chooses to act after the snap of the ball. However, unlike the read-option, the quarterback is responsible for making a decision regarding whether or not to throw a play-action pass to a receiver running a designed route, rather than simply the decision to keep the ball and run with it. History The run-pass option is a development of the triple option that became popular after a 2009 revision to the NCAA rulebook. This rule change allowed linemen to advance three yards downfield prior to a forward pass being thrown. Previously linemen had been restricted to blocking just one yard downfield on pass plays. The additional downfield blocking greatly assisted the wide receiver's ability to run after the catch. As such, the RPO became a staple of many successful college team playbooks. There were many notable critics of the RPO, including former Alabama Crimson Tide Football head coach Nick Saban. Critics of the RPO's adoption within college football generally argued that the rule changes that enabled the RPO had made the game unbalanced by allowing linemen to block so far downfield on passing plays, which was exacerbated by the failure of referees to properly penalize linemen who blocked too far downfield. Just prior to the 2016 college football season, the NCAA proposed to restore the pre-2009 rule, which would have had the effect of restricting the"
  },
  {
    "chunk_id": "run-pass_option_002",
    "doc_title": "run-pass_option",
    "text": "to block so far downfield on passing plays, which was exacerbated by the failure of referees to properly penalize linemen who blocked too far downfield. Just prior to the 2016 college football season, the NCAA proposed to restore the pre-2009 rule, which would have had the effect of restricting the efficacy of the RPO, but declined to do so after a large number of coaches expressed their discontent with the proposed rule change. The RPO has since spread beyond college football, becoming a part of professional offenses in the National Football League. By 2018, the RPO had entered the playbooks of NFL teams including the Chicago Bears, Carolina Panthers, and Cincinnati Bengals. Strategy College football In college football, the relatively lax definition of an illegal man downfield allows for RPOs to involve heavy downhill running plays and vertical passing attacks. The extra space downfield that linemen are allowed to advance allows more time for passing plays to develop and allows for linemen to engage with linebackers in order to support a downhill run. NFL In the National Football League, the use of the RPO is more restricted than in college football due to its more stringent criteria for an illegal man downfield penalty. As such, passes tend to be quick-hitting and near the line of scrimmage, and linemen are less able to engage with second-level defenders. Examples There are several run-pass option plays that have become commonplace, even earning adoption in the NFL. One common such RPO involves a slot receiver running a slant route run alongside an inside zone read. == References =="
  },
  {
    "chunk_id": "run-pass_option_003",
    "doc_title": "run-pass_option",
    "text": "receiver running a slant route run alongside an inside zone read. == References =="
  }
]